{"totalReviewCount":56,"review":[{"create_time":"2022-07-20T02:51:32.219314Z","update_time":"2022-07-22T07:26:08.636897Z","review_id":"AbFvOqmh6LII98-f4OWlEw_TThB27346ONAsBUIln8g5cFRvYzg7OLyMTSXaK88YG5zrtMSfqWYx","reviewer_display_name":"Werner Siebert","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucp8NXukKZCQ1F-VJIze28k0PYE-k6WfkSscJdJi=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"My wife was there for therapy for about 2 months at the beginning of this year. So far, this has also proven to be quite successful. We were very happy about the success of the therapy and would have given it a 5-star rating.\nHowever, we were also told at the time that telephone follow-up was a crucial part of the therapy. Therefore, she was to be called by her therapist every week at the beginning and later at somewhat longer intervals. Unfortunately, this telephone follow-up was discontinued by \"The Dawn\" a few weeks ago. Even after several inquiries we did not receive any explanation.  Although we have been promised again and again for about 3 weeks by the responsible Admission Manager that our inquiries would be forwarded to the responsible office and that a call back would be made from there, unfortunately such a call back has not yet been made. It is not possible to contact the responsible person directly, as we are not given any contact details and there is no reply from the ones we know.\nWe now consider the long-term success of the therapy to be in great danger. We have been strongly advised of the importance of the now prematurely discontinued telephone aftercare by \"The Dawn\".  We are now very disappointed about this.\nApparently they have problems with the Thai speaking team. At least there is a notice on the Thai language website that new Thai speaking patients cannot be accepted at this time. If this leads to the fact that already started and already paid therapies are simply discontinued without comment, this facility can of course no longer be recommended, despite initially great success.\nTherefore, for the time being, I have to give it a bad rating. However, should \"The Dawn\" find a solution, I will gladly change my rating again. Until then, unfortunately, only 2 stars.\n\nAddition: The problems could be solved in the meantime. I have therefore changed my initial rating to 4 stars.","rating":"FOUR","review_reply":"Dear Werner Siebert,\n\nMany thanks for your positive comments. We are happy to hear that your wife has made progress with our support. We have checked with both our Clinical and Admissions team and they have confirmed that they have been in contact with your wife to provide the appropriate aftercare guidance prior to the date this Google review was posted. We value your comments because we use all customer feedback to enhance our clinical and operational services.\n\nWe wish your wife every success in maintaining her recovery.\n\nThe Dawn Management Team","reply_update_time":"2022-07-27T10:02:35.682077Z"},{"create_time":"2022-07-04T11:56:06.769419Z","update_time":"2022-07-04T11:56:06.769419Z","review_id":"AbFvOqlPajiUFlCA6avwPwQy5rd1Sw2bvLxL_zEowIXG2QHz1enrkBb7ogXQrpHJgio00DsGJbdNvw","reviewer_display_name":"Rajen Sharma","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmncVPCLUhDoO-sbXIoz8fB0FWZu-ITHLqTD-Oeh=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"The Dawn Mental Wellness Center has been tremendous support to my son who is currently tackling his Anxiety disorder in the Center. From the Communication I have so far with the Dawn Team (Counselor & Admin and Support Team), I have observed that my son has been receiving excellent support in all fronts and I am really grateful to the entire team.  Keep up the good work Dawn Team !!!","rating":"FIVE","review_reply":"Dear Rajen\n\nThank you for your warm remarks and trust in The Dawn. We are pleased to hear that your son is making progress with our help. We have shared your positive feedback with our counselling and support teams, which they greatly appreciated as they endeavor to provide the best service possible to each and every one of our clients.\n\nPlease do not hesitate to contact us if there is anything else we can do for you.\n\nThe Dawn management","reply_update_time":"2022-07-05T07:20:35.093992Z"},{"create_time":"2022-05-13T09:03:10.737456Z","update_time":"2022-05-13T09:03:10.737456Z","review_id":"AbFvOqkcJl6gCvBtj6hkmm7zOsVsEXH_ByyVvsvwHl2pCpNLeh-nUxXtRM_gJ4HbTw79tD1T4vI5vA","reviewer_display_name":"h. b.","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmk9nMzD3v3Zh5O_iFghuFiWl1DlyGR2-cNQt1Rk=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"My stay was for longer than a month, and I have learnt many things regarding emotional disregulation and other mental health factors that have impacted my daily life prior to The Dawn. The staff were lovely and helpful, from support to the counseling team.","rating":"FIVE","review_reply":"Dear H.B.,\n\nThank you very much for your kind words. We are pleased that you found your stay at The Dawn to be beneficial. We have shared your positive feedback with our counselling and support teams, which they greatly appreciated as they seek to provide the best service possible to each and every one of our clients.\n\nThank you for your warm remarks and trust in The Dawn. Please do not hesitate to contact us if there is anything else we can do for you. From the Dawn staff, best wishes for your future endeavors.\n\nYours sincerely,\nThe Dawn Management","reply_update_time":"2022-05-16T07:40:34.585732Z"},{"create_time":"2022-05-06T17:43:33.461572Z","update_time":"2022-05-06T17:43:33.461572Z","review_id":"AbFvOqk5jEsBoc7PGFvj7lLebhDqPyW7RNHy1TS-jzyFysHU7QH83zrw-OhGvb4mdsZHnPkNw2mjzQ","reviewer_display_name":"Gareth B","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlWpUn0Q_lmYjSoCfLUQdU-XNJ2oCqnTGKh5Wlt=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I do not know how I made it on to the plane to get there, but it was the best thing I have ever done. The staff are amazing, the councellers are 5 star. I was very ill when I arrived but left a new person. Tony was my counceller and he really went above and beyond. Its hard work here but you get out if it what you put in to it. I went for mental health and didn't know what to expect but I got everything. I'm only giving 4 stars as the food was so so. I would highly recommend this place. You will hate it to start with but leave loving it","rating":"FOUR","review_reply":"Dear Gareth,\n\nThank you so much for your positive feedback. We are glad you found your stay at The Dawn a beneficial experience. We have shared your positive feedback with the relevant teams, which was greatly appreciated as they strive to do their very best for each and every one of our clients. In addition, we want to say ‘thank you’ for sharing your story of overcoming mental health issues, and maintaining healthy well-being. People who are going through the same thing can look up to you as a source of inspiration. Only you have the power to make your life worthwhile. Congratulations!\n\nAgain, thank you for your kind words and confidence in The Dawn. If there is anything further we can do for you, please don't hesitate to contact us. Greetings from the Dawn crew and best wishes for your future endeavours.\n\nYours sincerely,\nThe Dawn Management","reply_update_time":"2022-05-09T03:56:59.810024Z"},{"create_time":"2022-01-20T10:10:36.358545Z","update_time":"2022-01-20T10:10:36.358545Z","review_id":"AbFvOqmxtC77RaAIw8F-SeeZpWALy2nkTSDZml9sQMiq2CcQCzc92ZOSRNsLkrOqYwiMuK3d4Gcl3w","reviewer_display_name":"Elaina Massie","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucqaPqOc1Cowndka263Crc5FrhF39ve-AmWVjGLD6g=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"The Dawn Rehab literally transformed the direction of my life in extraordinary ways.\n\nI couldn’t understand why no matter how hard I tried to make my life work I seemed to hit roadblocks.\n\nThanks to my allocated therapist unresolved complex trauma was identified in my first counselling session.\n\nI’m  a mental health practitioner myself and I assumed my lack of success and achievement was due to a lack of effort on my part. This is how insidious trauma is on our internal and external model of the world.\n\nThanks to The Dawn’s entire team my 1 month stay put me on the road to recovery.\n\n3 years later and my life continues to change in positive ways and  has rippled into my professional work with clients needing extra support on their trauma recovery journey.\n\nI highly recommend The Dawn as your first step to finally leaving your painful past behind you.","rating":"FIVE","review_reply":"Dear Elaina,\n\nThank you so much for your positive feedback. We are glad you found your stay at The Dawn a beneficial experience. Your recovery journey has inspired us and we hope this will inspire people who are reading this too. We have shared your positive feedback with the relevant teams, which was greatly appreciated as they strive to do their very best for each and every one of our clients. Once again we appreciate your affirmative comments and your trust in The Dawn. Please feel free to reach out to us directly if there is any other assistance we can provide. The Dawn team wishes you the best of luck in your journey.\n\nYours sincerely,\nThe Dawn Management","reply_update_time":"2022-01-26T05:14:40.438299Z"},{"create_time":"2021-09-06T18:08:23.925229Z","update_time":"2021-09-06T18:11:11.530420Z","review_id":"AbFvOql-14ImoiFq_SWcoJMMFDKgNHYYk1Ts-A0_R2XThhy-vpobvs0VA84hrZQGjGQOAkscCHf3RA","reviewer_display_name":"Mark Wright (zdunce)","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmKdldsK3QOMK-I7uZDliqv_xnDloBfx34qqILo=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I went to The Dawn for several months and would not recommend this place to anyone. I did not feel it accuratly represented itself and in my conversations with the administration. I wish  I had trusted the \"flagged\" reviews.\n\n-I am posting this under a different name to protect my privacy-","rating":"ONE","review_reply":"Dear Mark,\n\nThank you for your feedback. We are sorry to hear this. We have forwarded your comments to the head of our Admissions departments for further investigation and appropriate action to be taken.\nWe appreciate your feedback as we use all client feedback to improve our services, both clinical and operational.\n\nYours sincerely,\nThe Dawn Management","reply_update_time":"2022-01-26T05:22:11.332307Z"},{"create_time":"2021-08-10T04:29:25.291218Z","update_time":"2021-08-10T04:29:25.291218Z","review_id":"AbFvOql_gm31EZli3KSVTgAJWt2gfZGOu48q_GDf8mPgD2bkvivGNmngQiToT9R7bAXPaL5F7A08Pg","reviewer_display_name":"Larry Reid","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvml2q3JDA5jp-Z54ofZ2zBIAD2jlmIC1vdKsoFuh=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"My experience at The Dawn has been unexpected and worth every minute. The staff are very professional and kind. The counselors provide excellent care for addiction as well as mental health issues. You can tell they take great pride in getting to know you, as much as you allow them to, which in turn helps them steer you toward being your best self.\n\nThe treatment they implement here has been instrumental in my recovery. This, along with the small group settings and one-on-one counseling have proven to be a great system, (because I put in the work,) that put me on the correct mental path for life after rehab.\n\nIf you leave all outside distractions behind (as much as you can), and truly focus on yourself and what you can learn from your peers and counselors and also give back to your peers, The Dawn puts every effort to support your recovery.\n\nIt can be a roller coaster ride of emotions, perceived setbacks and leaps forward, but if you're patient and willing to be present, the program has every aspect of your recovery in mind. I took advantage of the healthy food, the amazing personal trainers and the incredible yoga teacher every  day.\n\nIf you're ready for recovery, this is the place for you.","rating":"FIVE","review_reply":"Dear Larry,\n\nThank you so much for your positive feedback. We are glad you found your stay at The Dawn a beneficial experience. We have shared your positive feedback with the relevant teams, which was greatly appreciated as they strive to do their very best for each and every one of our clients. Once again we appreciate your affirmative comments and your trust in The Dawn. Please feel free to reach out to us directly if there is any other assistance we can provide. The Dawn team wishes you the best of luck in your journey.\n\nYours sincerely,\nThe Dawn Management","reply_update_time":"2022-01-26T05:16:31.564967Z"},{"create_time":"2021-07-12T04:56:48.106416Z","update_time":"2021-07-12T04:56:48.106416Z","review_id":"AbFvOqle5pcSwQQGRV4p1QaS0-4MNyfYFmAOMZC-dZY2MSz4mFI96EGdQxuo7TK3VYggMR6HaHNw","reviewer_display_name":"Daniel Noble","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmm3BfDeb_F_uGrI-qj2bawtOCyyq4_43u7rLjoh=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"The Dawn met all my needs. The support staff were fantastic and still are, the councellors had my best interests at heart and the whole experience saved my life. I highly recommend The Dawn for addiction and mental health issues. To this day they still play a big part in my recovery.","rating":"FIVE","review_reply":"Dear Daniel Noble,\n\nThank you so much for your positive feedback. We are glad you found your stay at The Dawn a beneficial experience. We have shared your positive feedback with the relevant teams, which was greatly appreciated as they strive to do their very best for each and every one of our clients. Once again we appreciate your affirmative comments and your trust in The Dawn. Please feel free to reach out to us directly if there is any other assistance we can provide. The Dawn team wishes you the best of luck in your journey.\n\nYours sincerely,\nThe Dawn Management","reply_update_time":"2021-07-12T09:45:37.064554Z"},{"create_time":"2021-07-05T03:59:29.414557Z","update_time":"2021-07-05T04:03:56.174215Z","review_id":"AbFvOqnclvWHPS9Z-hbMLOiNP5viLqU0ExyVlhkldxRQN-L9c4oJkm4Oy3vD3oAC8lAdE72kzVPuwg","reviewer_display_name":"Daniel Matthews","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnsNdpsJ9Tf9QIDcu6N0xo1j0S3nTUqljBvtavkDGE=s120-c-c0x00000000-cc-rp-mo-ba4-br100","is_anonymous":null,"comment":"I was in treatment in 2019 and remained sober for six months and I now understand the reasons why. The Dawns overall approach is to enable us addicts to challenge our emotional beliefs and thought systems that produce feelings that drive us to drink and use.\nFrom the offset Ahmed was wonderfully clear and responsive taking me through in detail the process of entering Thailand during a pandemic. I was collected from the airport and entered The Dawn at my rock bottom having lost almost everything. I was truly powerless over my addiction and my life had become unmanageable.\nThe multiple discipline approach of working in a group and individual counselling setting, backed up with yoga, fitness and meditation works wonderfully for the body, mind and spirit. I have certainly connected with my higher power.\nThe support team especially Nick and Peng are always on hand and able to help talk me through a panic attack or any other thoughts, feelings and consequential behaviours.\nThe nursing team especially Ping Pong are wonderfully caring and balanced in their approach of regulating medication dispensing .\nI not longer think I am a terrible him being who deserves to be miserable for the rest of his (what would have been) a very short life. I have been able to test  thoughts, feelings and behaviours in a real life group setting and learn to challenge my thinking, leading to a fresh developed outcome, whilst no longer activating my long gone negative self beliefs.\nFor me this was a last change saloon scenario and thank god I found the Dawn. I am here currently and have been for three months.\nSuch is the tremendous work they do here I've experienced so many 'wow' moments, where I've realise how corrupt my thinking was and how cunning the addict within me can be. I have extended for another three months with my wonderful counsellor Di and look forward to being testing further by my peer group and developing new skills to take out into my new world","rating":"FIVE","review_reply":"Dear Daniel Matthews,\n\nThank you so much for your positive feedback. We are glad you are finding your stay at The Dawn a beneficial experience. We have shared your positive feedback with the relevant teams, which was greatly appreciated as they strive to do their very best for each and every one of our clients.\n\nOnce again we appreciate your affirmative comments and your trust in The Dawn. We would like to say that we are so proud of you and your bravery to share your journey with us, we hope it will empower others to reach out for help. Remember! recovery is a process. And like any other process – it has to start somewhere. There will be good days, not-so-good days, and downright bad days. No matter where you are in the recovery process, know that you are accomplishing an astounding feat each day, each hour – and even each minute and The Dawn team will always be with you. Please feel free to reach out to us directly if there is any other assistance we can provide. The Dawn team wishes you the best of luck in your journey.\n\nYours sincerely,\nThe Dawn Management","reply_update_time":"2021-07-12T09:44:54.896661Z"},{"create_time":"2021-07-01T13:21:47.193691Z","update_time":"2021-07-01T13:21:47.193691Z","review_id":"AbFvOqkAVqQLBvE-SQEUA534g1Xh-qcGHt9TAlbQfarubItK_Ng9sigPnWhO4Umv-wZcxcsSIRk0","reviewer_display_name":"Sophie Mautle","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucr4tAnj9upADOnHa_vtecLXU-zV3A5gG8xkn0A5JSU=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"It gives me so much pleasure to add my review of this wonderful place. From the day I googled and found the Dawn, my son and  I have had a very good and comforting experience. Being in Botswana and in the middle of the pandemic, I needed a place where my son would not only get the help he needed for his depression, but I also wanted to be sure it would be provided with care and empathy.\n\nThank you everyone at the Dawn, especially Paul, who handheld us through the visa and travel procedures and listened patiently to our questions. The pre counselling therapy made my son and myself at ease .  Thank you so much the Dawn for making our healing experience so comfortable.\n\nI remain forever grateful, and even as I am anxious of the recovery period after rehabilitation, I am confident knowing that the after care programme will continue.\nThank you.\n\nSophie … Botswana","rating":"FIVE","review_reply":"Dear Sophie,\n\nThank you so much for your positive feedback. We are truly glad you found your son’s stay at The Dawn a beneficial experience. We have shared your positive feedback with the relevant teams, which was greatly appreciated as they strive to do their very best for each and every one of our clients. We believe that your message will help many families having the same kinds of issues and let them know that they are not alone. There is hope and abundant love and support – you just have to take that first step and ask for help. In fact, with proper care and support, many individuals go on to live rich and fulfilling lives.\n\nOnce again we appreciate your affirmative comments and your trust in The Dawn. Please feel free to reach out to us directly if there is any other assistance we can provide. The Dawn team wishes you the best for your son and your family.\n\nYours sincerely,\nThe Dawn Management","reply_update_time":"2021-07-05T05:44:55.545196Z"},{"create_time":"2021-06-16T13:32:04.738115Z","update_time":"2021-06-16T13:32:04.738115Z","review_id":"AbFvOqnQdYLoziYOvFpLnEPydI-hz7rCQ5Zy62qnHpvJNfPgwCXNayGWrOuazZSYw8NrkEI_ftiGAQ","reviewer_display_name":"Tuan Will","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucp7bQuCH8ySeEKqap9aZ9O4yC21D2ZLq28nzB9R=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Having cared for my father until his death and then suffering a relationship breakdown all within a few months of each other I turned to alcohol and drugs putting myself into a horrible spiral. A close friend found The Dawn and put me in touch with them. They supported me from the very beginning in the UK and even helped with a court case I had for drink driving. They facilitated the travel and quarantine to Thailand as this was during the height of Covid and it couldn't have gone any smoother.\nOnce at The Dawn I was made very welcome and the facilities were brilliant. The gym is very modern with great PT's who are super friendly and push you. The food was AMAZING and I still miss it. The support staff were really friendly and approachable and SUPER helpful. The absolute highlight and reason for the 5 star review was the excellent councilling and group therapy sessions. They really helped me figure out the root causes of my mental health issues and drug and alcohol abuse problems. This was truly life saving and I cannot thank the whole team enough. Even now I am still doing aftercare sessions with the Dawn online which has been a huge help in transitioning back to everyday life. Finally you will not find this level of care for the price ANYWHERE else and I strongly recommend anyone who is dealing with similar issues to get in contact. Thank you so much The Dawn!","rating":"FIVE","review_reply":"Dear Tuan Will,\n\nThank you so much for your positive feedback. We are glad you found your stay at The Dawn a beneficial experience. We have shared your positive feedback with the relevant teams, which was greatly appreciated as they strive to do their very best for each and every one of our clients. Moreover, we would like to say that we are proud of you and your journey has inspired us all here. We also believe your story can be life-saving for others. Once again we appreciate your affirmative comments and your trust in The Dawn. Please feel free to reach out to us directly if there is any other assistance we can provide. The Dawn team wishes you the best of luck in your journey.\n\nYours sincerely,\nThe Dawn Management","reply_update_time":"2021-06-21T04:07:26.198792Z"},{"create_time":"2021-06-08T06:02:32.290324Z","update_time":"2021-06-08T06:02:32.290324Z","review_id":"AbFvOqmUkrZaIWSExVDRKzXuVxHIVUhl2KM1WMeJsg099yCV8X2KLVwp5NTiFo-vis8aMD_oOEMlsA","reviewer_display_name":"Jason Thelen","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpKTrJSqx1VLxG5nS5CFZjrzDTYdo3whYV66TGAqZM=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I chose the Dawn for a 2 week mental health reset and had an excellent experience. The entire process was smooth, easy and well explained. The best parts of my experience were; 1. The staff. Every single member of the team was deeply caring, proactive and clearly concerned with my best interests. 2. The group experience and supportive environment with my fellow guests. It was such a powerful experience to spend 2 solid weeks in such a healing and supportive environment.","rating":"FIVE","review_reply":"Dear Jason,\n\nThank you so much for your positive feedback. We are glad you found your stay at The Dawn a beneficial experience. We have shared your positive feedback with the relevant teams, which was greatly appreciated as they strive to do their very best for each and every one of our clients. Once again we appreciate your affirmative comments and your trust in The Dawn. Please feel free to reach out to us directly if there is any other assistance we can provide. The Dawn team wishes you best of luck in your journey.\n\nYours sincerely,\nThe Dawn Management","reply_update_time":"2021-06-14T05:57:08.940208Z"},{"create_time":"2021-05-10T09:45:22.018210Z","update_time":"2021-05-10T09:45:22.018210Z","review_id":"AbFvOqmx8dxpG5chyTzZ3fkl1yUR4V_syeHD85AxiXPiCG2wCnwqpdWQi382FpQo4Tmn8zjJApbP","reviewer_display_name":"jane jones","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnIMdBwodyFcETak3wzngTUvVj33wT2tIXi5KAE=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I arrived at the dawn just in time I was suffering from complex PTSD Trauma and anxiety after suffering from domistic abuse\nFor four decades I had left a long marriage\nAnd was in a paralyzed state when I arrived.\nI thank the dawn for helping me to make sense of what how and why my life exsploded\nThe way it did they have given me the tools to\nReturn to the UK and rebuild even though I still have a long way to go  .\nI thank everybody at the dawn for everything they have done for me you are amazing people and I will miss you all so much 😘❤️ x x 🙏🌈 Jane catchpole","rating":"FIVE","review_reply":"Dear Jane Jones,\n\nThank you so much for your positive feedback. We would like to say that we are proud of you and your journey has inspired us all here. We are glad you found your stay at The Dawn a beneficial experience. The Dawn team wishes you best of luck in your recovery journey.\n\nYours sincerely,\n\nThe Dawn Management","reply_update_time":"2021-05-12T04:03:33.150163Z"},{"create_time":"2021-04-04T10:35:17.220157Z","update_time":"2021-04-04T10:35:17.220157Z","review_id":"AbFvOqnDUpIjFBy1ISk2x38dHtXCRBADlwEOuHj8_QVa9oWBjqoRUzafJhIRFaejxCTYt-B0nNlk","reviewer_display_name":"Sophie Liberty","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucqDkZNbJlhW42NtE2mFVRCD6dyIVfnbJH7fi1z1mA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I partook in a 3 month stay in primary treatment at the Dawn. With outstanding care before arriving, and brilliant aftercare, it’s fair to say that this treatment facility saved my life. I travelled during covid, and received 24 hour support throughout my time in quarantine and even before hand in the UK, way before my flight. After battling the UK mental health system for 7 years, I received the care and therapy I’d always needed. It is concentrated help, with a serene and tropical environment. With a balanced sector in addiction, mental health and trauma, I cannot recommend this place enough. THANK YOU THE DAWN!","rating":"FIVE","review_reply":"Dear Sophie,\n\nThank you for taking the time to review your stay at The Dawn. We have shared your positive feedback with our teams, which were greatly appreciated as they strive to do their very best for each and every one of our clients. Once again we appreciate your affirmative comments and your trust in The Dawn.\n\nYours sincerely\nThe Dawn Management","reply_update_time":"2021-04-07T10:07:56.690316Z"},{"create_time":"2021-02-15T13:33:45.163938Z","update_time":"2021-02-15T13:33:45.163938Z","review_id":"AbFvOqna8lgMZM8YOGfMk87qyjLPPGwcODRrq79GhgSHkcx7-y6Zxe9AwOvuT1arwliPowfaF7tL","reviewer_display_name":"marissa thoman","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkjPRS2W42GcOnPMfDCxDMgWjcBPIcbmg9VIlYd=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Before I begin, I will say I am a REAL patient. Many of the reviews are FAKE.\n\nHaving suffered insomnia and mood issues for the most part of my teen and adult life, I chose to go to the Dawn. I had high hopes that were let down.\n\nTheir website advertises a 5 star treatment facility. This cannot be further from the truth! Much of their staff are recovered addicts some early as 6 months. Not what you would expect from “5 star”.\n\nSecondly 5 star say yes to reasonable request. I being PREGNANT yes, PREGNANT asked for 6 eggs to be eaten out of meal times….. The facility found my request not to reasonable and asked that I bring eggs from outside. This contradicts their statement of taking care of ALL your needs so patient can focus on recovery. A few days in, I had to arrange for 90 eggs to be brought from outside….. You would think paying $6k for 2 weeks 6.50 usd would not break their bank! Not to forget them price gouging prescription medication. I paid 300 percent more for medication.\n\nIf you are thinking of spending your life savings on this place, or putting money toward treatment, I as a REAL patient, advise you look at the alternatives. Please do not be fooled by Paul, their salesman.\n\nI wish you the best of luck in you recovery.","rating":"ONE","review_reply":"Dear Marissa,\n\nThank you for taking the time to review your stay at The Dawn. We are sorry to learn about your dissatisfaction with our centre’s operating procedures. We have forwarded your feedback to  the relevant department head for their consideration. In terms of our staffing – as an addiction and mental health treatment centre we pay meticulous attention to the caliber of all the personnel we hire in order to best serve our clients. Apart from their  academic qualifications and professional experience, we understand that in many instances an individual in recovery can better assist a client who is going through a similar process.  Once again we appreciate your feedback as we use all client feedback to improve our services both clinical and operations. The Dawn wishes you well.\n\nYours sincerely\nThe Dawn Management","reply_update_time":"2021-02-16T09:31:35.617363Z"},{"create_time":"2021-01-28T16:52:34.754970Z","update_time":"2021-01-28T16:52:34.754970Z","review_id":"AbFvOqntoiKwtG_WrKXZ_o79DoKjX_vuLXYhcMLQe7sVsWA_7j57HcKhVopnFsp2BaAmr51qoNFqIQ","reviewer_display_name":"Sama Bel","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmqnisqxFhhLG6yJBjhK6ig6-ym_IsVOKb3v7uR=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Sadly, I cannot recommend this place. The post about lies and the \"Ministry of health needing to investigate\" are VERY much TRUE. This place is nothing other than a falsely advertised 5 star treatment facility...... I mean bank. Money NOT patients needs are put first.","rating":"ONE","review_reply":"DISCLAIMER FROM THE DAWN\n\nTHIS IS A FAKE REVIEW – The Dawn cannot identify this client’s identity based on this information. Please post evidence of your treatment with us, such as:\n1. Client Registration\n2. Invoice and Payment Receipt\n\nPlease make a complaint to the following authorities if you feel this matter requires further attention and The Dawn will be happy to make amends through formal channels.\n\nOffice of Thai Consumer Protection Board: 1166 or website https:\/\/complaint.ocpb.go.th\/?lang=EN\nThai Ministry of Public Health - Complaint Department:  +66 259 0287 67 \/ complain@health.moph.go.th\n\nThe Dawn Management","reply_update_time":"2021-04-21T06:16:50.858132Z"},{"create_time":"2021-01-28T12:00:19.470157Z","update_time":"2021-01-28T12:00:19.470157Z","review_id":"AbFvOqln84RF_wiMVPxHNZ4AUhmD6tvZPcOYAGkVUiMDnaQna1iTyWQEAjNqU5SLjGiikLqqZ3vPTg","reviewer_display_name":"Caroline Liberty","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkpfcDg_qnRbMUpYOne70N-REZpnZP0GEGRa82X=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"My daughter was diagnosed with bpd when she was just 17, after struggling with her mental health since the age of 12, after many many suicide attempts, drug addiction, and frankly inadequate “help” in the uk, she was discharged by adult mental health services at 20, when she was at her absolute lowest point, they discharged her because she used drugs as her coping mechanism instead of cutting and we were told this was “her choice “. But if she had carried on cutting they would of continued to treat her!\nWe were told about The Dawn, and contacted them. I spoke with Craig and explained the situation we were in and my daughter spoke with Craig and outlined her illness and addiction. We asked lots of questions and asked how long they felt she needed to go for and were advised for the best outcome the full programme of 3 months would give her the best chance. I was worried because sometimes my daughter would shut down and not be open to help but Craig reassured me that as long as “ the door” was open even a crack they could get their foot in and help her.\nBecause of covid restrictions it proved quite difficult getting her out there, but The Dawn offer remote therapy via Skype, which proved invaluable, not only did it give my daughter a chance to meet her therapists, she began to see a light at the end of the tunnel.\nMy daughter left for the Dawn on 03\/01\/2021, she had to quarantine in Bangkok for 15 days, which was very daunting, as she does not cope well on her own, but the 24 hour support offered from the team at the Dawn was exceptional, she continued with group and individual therapy sessions, yoga classes and even Thai boxing classes. By the time she reached The Dawn she felt like she was meeting up with friends.\nShe’s still at the beginning of this journey, but the difference I have seen in her so far is beyond anything I had even hoped for. Obviously she is not “cured” but for the first time she has hope. The support from the staff and her peers has actually made her begin to believe she can come out of the darkness and live the life she deserves.\nI can’t thank Craig and the team enough for looking after her while she is so far away, and I am now very hopeful for her future.","rating":"FIVE","review_reply":"Dear Caroline,\n\nThank you for taking the time to review our services. We have shared your positive feedback with the relevant teams, which was greatly appreciated as they strive to do their very best for each and every one of our clients. Once again we appreciate your affirmative comments and your trust in The Dawn. Please feel free to reach out to us directly if there is any other assistance we can provide.\n\nYours sincerely\nThe Dawn Management","reply_update_time":"2021-02-16T09:31:49.568798Z"},{"create_time":"2021-01-27T00:06:11.863638Z","update_time":"2021-01-27T00:06:11.863638Z","review_id":"AbFvOqmrZgxO3eFRaqUiY7_bQZ8DU5E8TAI5rN-Av_dDaL31RHZuIUEJ8V_gIW2zbb1O1z6SPYxD3w","reviewer_display_name":"Badoop Warbleton","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucq9T4w-oy_HoVKuGcVx3hmaR4Xc75XmQVB4OW0BxA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Going to this rehab was more or less just a choice of a path on my journey. Fortunately after paying close attention to myself and my peers I learned the truth about myself over time and several more failures.\nIn the end the truth is the world is suffering from vampirism. Either ignorant to the fact or cruely aware and using the same slave systems all down the ladder. Further I learned through the 12 step program the True nature of the Unseen which most call God.\n\nI will say my willingness to change began here for whatever reason. Either what I was seeing or feeling had finally , forced me to bend. Though I did break many times before realizing my need to change.","rating":"FOUR","review_reply":"","reply_update_time":""},{"create_time":"2020-10-06T14:41:22.086025Z","update_time":"2020-10-27T08:24:06.400368Z","review_id":"AbFvOqmqKDswjsEtKcfhB7uT4hFoo0z7H8-A4AHc7mShFcpzW-1aodkfubRfzb8ox37EWs-3QM0B","reviewer_display_name":"MR. AMORN SACHAMUNIWONGSE","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucp5BJfaevq7TfEZR_j5D7e40iU7cGRR336C3bEuNw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"THREE","review_reply":"","reply_update_time":""},{"create_time":"2020-09-06T16:21:10.859413Z","update_time":"2020-09-06T16:29:52.116972Z","review_id":"AbFvOqk1hRqggJcaex8RXCg8jNPrOjcsuQqNI24oALjM-5lT_w_8VLskFL7kGsLf96NR5gymRD__CA","reviewer_display_name":"Amro Salama","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmuUQ0rPoZjLbbzKL04Z11f8zCKRYPf_O4vjs8T=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Dont trust them with money and the refunds because you will never get it back its been 9 months now asking for my refund with\n(paul strachman) the admissions manager  and its just going back and forth and delaying and pretending that he will send the refund and he never does , best regards from\namro salama","rating":"ONE","review_reply":"Dear Amro,\n\nThank you for your feedback. We have forwarded your comments to the head of our Admissions departments for further investigation and appropriate action to be taken.\nWe appreciate your feedback as we use all client feedback to improve our services, both clinical and operational. The Dawn will be in touch with you directly as soon as possible.\n\nThe Dawn Management","reply_update_time":"2020-09-09T15:38:59.588180Z"},{"create_time":"2020-08-28T04:59:05.129979Z","update_time":"2020-08-28T04:59:05.129979Z","review_id":"AbFvOqlrCem7OOi4NbiprjIWxHSDWDDwt9Rr5NZTOIKjz04MiwhFNEIrQoYHCip2gZdeli5dv-DF","reviewer_display_name":"Zara Wallis","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucry4RdFmqeeFO_LYsHE9pA-3w-PMW6rRl7mH2R8=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Having recently been at The Dawn, I was browsing through these reviews and would also like to share my personal experience at the place and my personal views about mental health treatment in general.  I was there for 7 weeks at the end of 2019\/ start of 2020 and had an extremely good treatment experience. Not only did my therapist really know his stuff - the whole team, including the fitness trainers and masseuses, were really supportive warm-hearted people. I still access their online aftercare sessions almost weekly as I find it helpful in managing my condition. To be fair, I do not know the details regarding these other cases, but after being in treatment at The Dawn for several weeks (and seeing therapists on and off for the last 10 years) I'd like to share my wisdom with anyone looking into treatment.\n\n1. Firstly, make sure the therapist is both clinically qualified to treat your particular condition and that they have handled similar cases before. One of my old therapists told me these days people can take a 6 week course and call themselves a therapist. My therapist had a masters degree which made me feel comfortable and able to trust him quicker.\n\n2. MORE IMPORTANTLY, if you truly want to get to get better (and we all can), YOU have to be willing to put in some HARD WORD and to trust your therapist and work together as a team. And once you feel better, the only way to maintain your recovery is to keep working at it - using the techniques you've learnt, like I am doing currently everyday, one day at a time.\n\nI was in a really dark place when I came to The Dawn and they worked really hard with me to see where my issues came from and what I could do about them. I'm forever grateful.  Good luck to all!","rating":"FIVE","review_reply":"Dear Zara,\n\nThank you for taking the time to review your stay at The Dawn. Our team strives very hard to deliver the most effective outcomes for each of our clients and appreciate the effort you put into your treatment, as you said, we could not have done it without 'working as a team.' The Dawn wishes you well in your recovery and please feel free to reach out to us directly if there is ever any assistance we can provide.\n\nKind regards,\nThe Dawn Management","reply_update_time":"2020-09-09T05:16:57.595970Z"},{"create_time":"2020-08-25T01:07:26.346572Z","update_time":"2020-08-25T01:07:26.346572Z","review_id":"AbFvOqkOIuhu6DgwfwYvWnE0pQKxOG9a8ZkR6ExQEn_k10hHhOEfokVDRGJdGIEZ8pxVVUuAHSsteA","reviewer_display_name":"Jennifer Henderson","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmm8rLKhiZEGxM0T6IMLGQSRPAGf_-j1SJ22Gndj=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"It’s difficult to read the reviews of the Dawn and correlate it with the experience I had. I attended in 2018 looking for mental health care after suffering the loss of my brother and father in quick succession. I had a traumatic childhood with significant emotional abuse which had been compounded by grief and trauma.\nThe Dawn had its issues - I found the food substandard and the kitchen sanitation poor. Not much was done to accommodate my restricted diet but equally I didn’t make much of an issue of it either - I just ordered things I knew I could eat from the weekly shop. The therapy schedule was intensive and hard going, we were in groups from 7-7 with one day off doing activities a week. I was immediately put on the trauma track but also did work with those in the larger Dawn community who had issues with addiction etc. Having been an inpatient at private hospitals in the U.K. I feel the therapies, especially the group settings that were offered were comparable to those at the Priory in London. Some of the therapeutic staff were not as qualified as they could have been and there were definite safeguarding issues when it came to people being kicked out unfairly when the Dawn realised it was unable to help them with their issues, however for me it provided what I needed and I found the EMDR in particular extremely life changing when it came to coping with my fathers death. I think a lot of the success of my treatment hinged on the patients I found myself there with. We became very close very fast and it was a huge support to feel like I was amongst friends as I was addressing the issues I went there to deal with. Amazing support staff such as David Gale and Jared made the most difference, we became a community of sorts and I got the most benefit from the peer support sessions as opposed to those that were heavily structured or 1 on 1. (This was also my experience in London inpatient facilities where often seeing a psychiatrist was at an additional cost) I am aware that there have been a lot of staff changes since my stay which worries me as it was the staff who really made the difference between it being a helpful experience or not. Management definitely needs to take note of data protection - it wasn’t uncommon to see other people’s charts and documentation lying around offices during 1:1 sessions and they also need to have a much better system to really understand the issues patients are coming to them with. One person sadly died after being treated there the summer I was there and he should never have been accepted by the facility as they weren’t equipped to help him in the condition he was in. Equally they kicked out a very vulnerable lady during my stay with no concern for her wellbeing after she left the facility and was essentially stranded at the airport for the night,  thousands of miles from home which caused huge distress for the rest of us left behind worrying about her and also left us worrying about the prospect of being kicked out ourselves if we were too “difficult”. I know some people for whom the Dawn made the world of difference. I know some who found it no better than what they’d have gained just spending a month away from the stresses of their normal lives and I know some for whom it was outright detrimental. I am aware that Tony Tan no longer works there which is concerning as he was one of the more highly qualified staff members. If they can tighten up the way they run the place and retain qualified staff for longer than they have been so far I can see how they could be considered an option when private mental health and addiction care isn’t available in the U.K. and USA. However, I’d not feel 100% comfortable recommending friends go there the way it is. Approach with caution and ask as many questions as you can about whether they are able to help with your issues before you commit if you are intending on seeking treatment as it’s definitely not a one size fits all facility and while cheaper than equivalent in the U.K., it’s still a large financial investment to make.","rating":"FIVE","review_reply":"Dear Jennifer,\n\nThank you for taking the time to review your stay at The Dawn. We are glad to learn that you benefitted from our treatment as we sincerely strive to do our very best for each and every one of our clients. We consistently try to improve on our clinical techniques in order to address the unique symptoms of each client – and we believe our programme is even stronger than it was in 2018 and so is out clinical team in terms of qualifications and experience.\nWe have also improved on our food services and generally have had no complaints in this area. And lastly, we hope you and your loved ones are keeping safe in these uncertain times.\n\nKind regards\nThe Dawn Management","reply_update_time":"2020-08-26T05:48:49.271982Z"},{"create_time":"2020-08-08T23:02:39.072786Z","update_time":"2020-08-08T23:02:39.072786Z","review_id":"AbFvOql5yXrxzA8e-kQlTMlQLJqa3lrfcE7YaulJAe1JP4TEl6BVWmWFnt7ASVdo3sK6kbzQJ8C2","reviewer_display_name":"Mel Deacon","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkYdgOuEx8PGTLDNC6Fb4EEet1G9LvrgSZAEB65=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Unfortunately I recommended a friend to The Dawn, which I now bitterly regret. She had experienced very similar trauma (with no cross diagnosis with addiction) to my own, which I had managed to make great progress with during my 10 day stay at The Dawn last year, thanks to excellent care I received back then.\n\nThe standard of care for trauma patients (with no cross diagnosis with addiction) has plummeted in the last year, and my friend was discharged half way through her stay in a much worse state than when she arrived. I have now withdrawn the testimonial video I made for their website.\n\nMy friend  made a reasonable request to be assigned to a female therapist, citing valid reasons for her preference and her request was met by an email not only refusing her request, but directly threatening her with both financial and emotional consequences as a result.\n\nShe then endured more than four days of isolation at The Dawn and was left entirely unattended by both therapists and management (only nursing staff checked on her). While this was happening the clock was ticking on her finances, and in the end she was discharged without any refund having suffered a significant setback.\n\nThroughout this time her patient confidentiality was breached, coercive methods were employed to unnecessarily detain her, and ethical guidelines were not followed either in the way she was treated or in the method employed to retain payments made by her.\n\nI can't comment on the treatment offered for problems with addiction, and this still appears to be the main area of business for The Dawn, but I would warn anyone suffering from trauma symptoms to stay well clear of this facility.","rating":"ONE","review_reply":"","reply_update_time":""},{"create_time":"2020-07-21T13:44:16.210341Z","update_time":"2020-07-23T12:26:15.047458Z","review_id":"AbFvOqnwbBLQbXylyGguAnzYIV3dQ3K57gOJKlHnWqIzhXztC8Tad67UwPY3_JrxFdBvJBwuatrn","reviewer_display_name":"Alexandria Orlando","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlEfRLZiHBJp7qM-EmW0ZWOJRe-qGXLHWCkCPM=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Reply from management under my post is more LIES and more lies!\nWe have all the proof.\nWe have emails and letter you want her to sign where you say she is discharge for \"program demands are not met\".\nCan post here and show your lies?\nshe did not leave, you throw her out because she asked for lady psychologist!!!!!\nWe do not need help from black heart people. Now good Thai people take care her, proper Thai culture style.\nWe \"proceed\" by expose you using proof, even from meeting where you tell her to leave with no help or care for safety and refuse to give back her money. We can use that  proof to show you abuse her.\nOther people also have bad experience at Dawn, we already speak to them.\nbad reputation!!!!!!!!!\nshameful for Thailand. We do not cheat foreigners visitor.\nPlease wait. soon soon media and health ministry will investigate you and show who is liars.\n5555\n\n______________________________________________________________\nAvoid this place ! If you have trauma this is not a place for you.\nthey only know how to deal with drug addicts using a tough regime.\nMy friend is farang,  booked in to treated for PTSD trauma and have to be rescued from the Dawn by Thai friends and lawyer  because they treated her so bad.\nEven the vulnerable trauma patients are treated as junkies.\nMy friend asked for a women psychologist and was threatened and isolated, there are no ethics. They only have one woman psychologist and shes will leave soon.\nShe was refused to speak to management and threatened not to discuss with other patients.\nThe CEO hasn't  interest in client welfare and ignored her email and request for meetings about her concern, also hiding in his office to avoid her and telling staff not to talk to her.\nThe positive Google reviews  are based on client's experiences from the previous clinical  professionalls. It has gone very downhill.\nManagement has changed and trauma patients treated like criminals.\nStaff turnover is  high and former patients asking to withdraw their positive testimonials from the Dawn website.\nIf you are a vulnerable women with trauma this is not aplace for you. They will make you worse attack you and threaten you.\nThai Ministry of Public Health need to investigate this place quickly. It brings shame on Thailand and it's reputation for foreigners on medical tourism.","rating":"ONE","review_reply":"Dear Alexandria,\n\nWe are sorry that we were unable to help your friend during the clinically deemed “very short period of time” that she allowed herself for treatment, before deciding not to move forward with the remainder of her treatment plan. Hers was a complicated case and based upon her clinical assessment, we assigned her the most suitable therapist who has much experience in treating similar cases. In order for you to better understand the circumstances that your friend shared with you, she would have to give you permission to access her clinical reports and then her focal therapist would be happy to walk you through them. This may also help your friend’s loved ones in properly supporting her were she to seek treatment in the future. Please send us an email as to how you would like to proceed.\n\nThe Dawn Management","reply_update_time":"2020-07-22T05:49:07.775025Z"},{"create_time":"2020-01-18T05:05:35.639202Z","update_time":"2020-01-18T05:05:35.639202Z","review_id":"AbFvOqmZStmOXF5-JliVVBR6OOiMKxgxOtTBanZVkOsth-0aQac97KpvrUN5C8CAQ8Sr-b2WaXAx_Q","reviewer_display_name":"aukarawat leesakunruk","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucp-BpGIwep2EHBg-U0tM5cKe7fRtGmVt-hA7kUyYbY=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-11-21T15:40:20.075651Z","update_time":"2019-11-21T15:40:20.075651Z","review_id":"AbFvOqkUa8UkYoqaWAWP0srYOpSU8XL08I875517kwe_Fa1N9GvpTi2u1lPN1YE0stlgiC_LaG6C","reviewer_display_name":"D Kerr","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpXmenD2Q8aEDqylzZ8kWGKPnYbeAiEA95H9Lk1Zg=s120-c-c0x00000000-cc-rp-mo-ba4-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-08-04T03:37:22.777116Z","update_time":"2019-08-04T03:37:22.777116Z","review_id":"AbFvOqnPymLDQ4lLGg-FJcSym73BtTe36tGbxYCubBYNKazTiGXiQxNie8IakMjdLql0-FA-ef3k4Q","reviewer_display_name":"Roongnapa Pooduan","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpGZwcQmUqeptASK1Ak6TftptYZ0FLWe9NZ-ZZeiA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-06-26T00:11:17.497347Z","update_time":"2019-06-26T00:11:17.497347Z","review_id":"AbFvOqlay9KQgWphw7LEZCPUQitigzsb312C1Klh793W8EvgwEtoHdRarRDmCGawv-PAqUFJC9wnuw","reviewer_display_name":"Divyesh Vithlani","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrVAYgEjTGJn8eRTqcbM_onw7mRriy6AbR43ak4og=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-05-08T05:03:25Z","update_time":"2019-05-08T05:03:25.201584Z","review_id":"AbFvOqmbgouldpuXg_jHjkJDN1GxAePBqdV8oq8ir11qMUCpUCtdHyRoCgYSj6h381DzZg","reviewer_display_name":"Williams Seth","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrP5MyNeE9f51TXPQmXO5pABFSVBF7q1ZOVG5uj=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I was at my lowest point in life and needed help with my depression and alcohol addiction. Being in The Dawn for 2 months has helped me tremendously with my coping skills and learned so much about myself. The staff were friendly and genuinely cared about my well-being (Paolo was my counselor) and Andy & Katie were great help too as support workers! I made life long friends and enjoyed working out with Pump as my trainer. I recommend this place to anyone that needs the care and help.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-05-01T18:33:05.453120Z","update_time":"2019-05-01T18:33:05.453120Z","review_id":"AbFvOqnPr04x0hjjfyeZ229O18-2vXXEMlbjJemUnM39kkABcjO8jKfYelWOI0_o9S5pB5PxYGffiQ","reviewer_display_name":"Rachel Lee","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnQLp7BUKXsBLxyf1CjDwDsisTWUL_E5K73aa9v=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-02-06T04:07:03.147121Z","update_time":"2019-02-06T04:07:03.147121Z","review_id":"AbFvOqkxJcC_NQEokjmaEnf8-JmWzlFt4zMQYDrU83kkpAGZpfoUl3MfCSA3tAbH4flpyCccXn4g","reviewer_display_name":"Carolina Owen","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrd3kQi0dRUVuRAWiU_Vqhw535dn1vIQsQWt8Ru=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"After the ten-week treatment, I feel much stronger and more confident. This changes my life. Thanks to my counsellors, Tony and support staffs who helped me to go through my treatment. The Dawn is such a healing and peaceful place at the same time. The small group size has allowed me to get to know each other very well. I’ve had a very close relationship with all the staff members here.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-12-26T03:07:01.186945Z","update_time":"2018-12-26T03:08:36.995062Z","review_id":"AbFvOqnJZzQlK-N3ebXIAUjoo6boRrjYkFsDEafQGQ6aKk5wvioc2R__IUKMMSrzFZ_CsUS15a31","reviewer_display_name":"Letitia May","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZuco1drSAZOk8aJo9zcHtmDHilJ-rXqXNgfSyd-h6=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"The Dawn is like a family. It is clinical team, support staffs and people here. They truly care about your well-being. It is very therapeutic. There’s a lot of nature that makes you feel at ease. I really loved the view by the river. I liked to go there for focusing with myself. They also have a Saturday morning session with the monk. I was really enjoyed to know about Buddhism and culture. It was very insightful also relaxing. It was a great way to learn a meditation that I’d never discovered before.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-12-13T15:29:55.615526Z","update_time":"2018-12-13T15:29:55.615526Z","review_id":"AbFvOqkX4PtJM-56C6SgHsJ-osYnV1pahwQxiKSa3k-t1EtPDX88sDRjEKDeymXHT9_fcc8rtm_XJA","reviewer_display_name":"Adam Brigante","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrCfoVE8rnMBbZ-I0oD4zqgJ65II25R3d7IBYkAlg=s120-c-c0x00000000-cc-rp-mo-ba4-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-12-12T10:16:49.536477Z","update_time":"2018-12-12T10:17:02.269902Z","review_id":"AbFvOqlfo_NzdHaChRw37mfFTVmzSrs4TTyrpfjPG_xSON9GCK60EG6Abb7kCcTNPb-6egtDBpUscw","reviewer_display_name":"Pierce Sampson","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrl1THkSMK0fHohCn9g5Uw8ZcoTEeymCJGLKhHT=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Thanks everyone for helping me along the way. Anyone who is prospectively looking for the treatment, this place is a good place. Not only the surrounding is amazing but people and support staffs are also high class and really good at interactive engaging and it works. I came here with one thought of mine that it was my heart and soul. Everything here is nothing but supported that I trusted in the system. I do believe that I got the results that I was looking for. Hopefully your journey, you do realize that there’s hope, there is life, there is the whole world out there.","rating":"FIVE","review_reply":"We're thrilled to read this, Pierce. It was a pleasure having you at The Dawn, and all of us wish you a bright, healthy future ahead!","reply_update_time":"2018-12-14T01:50:19.371636Z"},{"create_time":"2018-11-12T08:19:13.124878Z","update_time":"2018-11-12T08:19:13.124878Z","review_id":"AbFvOqmklyzplqQJRR-7BzoHOpWKM7PPT2yHgcGw9F2BTV5z6A-_hNOIKRQBkMm04X3si---DDn5","reviewer_display_name":"Milena Broughton","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlXR61wDMWvko04JfuS8nB1PD5xfLmJALSWtniO=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I am a single mom struggling with depression for years after my divorce. I woke up one day and decided I needed to do something about it. I started to look at some programs in California. However, finding an affordable treatment back in the US was almost impossible. So I started to look for a rehab aboard and came across The Dawn. I took me months to commit to it because of my anxiety. As I look back, it was the best decision I’ve ever made. It's been 6 months now since I left The Dawn. Everyday is not easy but I am managing it. I would like to thank everyone there, the counselors, the support staffs, and the Thai staff. I would like to especially thank Wei Ling. She was very understanding and care. I really miss you guys. I hope to see visit again next year.","rating":"FOUR","review_reply":"","reply_update_time":""},{"create_time":"2018-11-07T07:24:46.448716Z","update_time":"2018-11-07T07:24:46.448716Z","review_id":"AbFvOqkTarkCoBg2jwuYtxdgUr7I9WG9rRuO3Rx4Fao7knY9FYpRRfc6WT27pMPFKZ4VhXGCoekMJQ","reviewer_display_name":"Yosef Franklin","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkeFUuEXgOkcDaSapZd6HXjNYcDEqdsVbimi682=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Quick, sweet, and tranquil.\nThey are located at beautiful location, experienced clinicians, and caring staff. Can’t say enough about the Thai hospitality. The Dawn saved my daughter’s life. She’s now back to university. Thank you again for taking care of her throughout her 6 weeks with you guys.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-09-13T23:02:32.349086Z","update_time":"2018-09-13T23:02:32.349086Z","review_id":"AbFvOqkwKU3i6RkXreL7mvVI9HMy_dLzLqRysodJfX6hq4vWvzBG0X7BviS3zlaI81qn_vj4_MAGJg","reviewer_display_name":"Don Taknow","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnp_CbGcvgsilbTtEga3SCYn46u5uryB2wyHFI=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Feeling like I had very few options at home for an affordable inpatient treatment center, I went to the Dawn seeking help for depression, suicidal tendencies, an eating disorder, chronic pain and anxiety.\nWhile at the Dawn, it was not disclosed to me that I would be locked into a gated facility and that my passport would be taken away. It was also not communicated that it would be 3 weeks before I would be allowed to leave. As a person with depression, I have spent years locked inside of my house (of my own doing) and found this to be very distressing. I was also bullied by another client and felt that the staff was not only slow to address this issue but was not prepared to do so.\nSeveral times during my stay during my stay, I expressed thoughts about suicide. These thoughts were not addressed. I was paired with a counsellor who I did not feel was a great fit. I had requested a meeting with the manager of the counsellors to express my concerns about my counsellor and about the bullying that I was experiencing but was not seen.\nIn the presence of three counsellors including one that I was unfamiliar with (which I found to be very intimidating), I was asked if I wanted to stay at the Dawn to which my reply was “no” and was I asked to leave that night without a plan for my safety.  I was also not refunded any money for the 5 days that I left treatment early. (Finances were not a big concern for me – but I know for some people reading this – they will be). I spent my last night in Thailand alone in a hotel room near the airport contemplating suicide. I left with the impression that I had failed in rehab felt and that I was incapable of being helped and that I was better off dead. This negative thought is still repeating in my head\nIn addition to the above feedback, the local staff were not trained professionals. Receiving massages, going to personal training and yoga with professionals who are not trained made my chronic pain worse.\nI chose this facility for its comprehensive care and because it was a much cheaper than its North American competitors however, the quality of care I received was not comprehensive.\nI also selected this facility because the reviews of the counsellors were also very good. However, I was not pleased with my own counsellor who had one particular method for treatment which I did not find effective (hypnosis).  I discovered that some of the reviews on Google and Facebook are written by the owners, their family members and the counsellors.  The website is much like any other website that is trying to sell you a product – the product or quality of the rooms, food, services or program are not as polished as the website. . I have worked in a counselling field myself and feel that this facility did not adhere to ethical standards for treatment.\nI would however, like to thank the local staff who showed a lot of empathy and compassion for the clients and offered simple words of encouragement and hugs. I suspect they are overworked and underpaid as many of them work 6 days a week. I would also like to acknowledge Dave G. who was apart of the support staff. He is a wonderfully kind and caring person with a tremendous amount of empathy for other people.  He is an excellent fit for working with people who are struggling with his endless patience and positivity.","rating":"ONE","review_reply":"","reply_update_time":""},{"create_time":"2018-09-05T14:12:12.608132Z","update_time":"2018-09-05T14:12:12.608132Z","review_id":"AbFvOqmWbyH2bqDUqTLmfnCf-zgI9iCHdqGEvD2oFZRA7CPaSlZHwC2JJCyQBYIH-c34CIfu4dl8yA","reviewer_display_name":"Patient Client","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmgLi9zMId7WutNJB8rsxYU4P8SmrMbp8lQ6ohx=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"A mixed experience. Several people thrown out for not finding the treatment helpful or making complaints about things like the poor food. Thrown out regardless of the significant difficulties they were dealing with and left without any support or refund. The amount paid was massive for some people in relation to income so this was a real financial as well as emotional loss for people who were already feeling desperate. The staff seemed to find it impossible to deal with the clients feeling that the place wasn’t helpful or even feeling angry about how they were treated. So the response was to throw them out with the naive hope that that would make everything okay for others. It didn’t- it made most people anxious and worried about whether they could trust the place. Very vulnerable people accessing this treatment- not the way to treat them. If staff cannot handle negative feelings (yes even ones directed towards them and the treatment) then there needs to be a much more thorough assessment of who they take. Not just take everyone and then throw them out when they feel like it’s not working. The 5 minute phone assessment can not establish whether or not this is going to be helpful for different complex individuals demonstrated by 3 people being thrown out in as many weeks.\nThe medical care was also poor.\nHowever, the dawn was\/ is helpful for some- even life changing. And there will be some people who go there and it turns them round to a life with a future. But for others it may be damaging and this needs to be really looked at by those working there. If considering using this service, be aware that it may be helpful but it’s not for everyone. This may be the same as other rehabs in Thailand as I have nothing to compare it to. Also, while not everyone is thrown out, everyone is pushed to stay longer and almost everyone is told they have trauma which requires more time in treatment (and more money paid to the dawn)...","rating":"TWO","review_reply":"","reply_update_time":""},{"create_time":"2018-08-28T14:18:59.601090Z","update_time":"2018-08-28T14:18:59.601090Z","review_id":"AbFvOqkCbjPWZTnmWCPWhur6ftimrURfS6Qn3PQq9YDbQXFlq4j2XbtKhv-WPpw4LA3JfICGJaSm_w","reviewer_display_name":"H","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrQedDreFUk_wWFKiS3hDT_ByOYT2eMr19qWDG4yQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"After much concern and  detailed research of numerous facilities in Thailand  our son recently spent some time at The Dawn and it truly has been life changing.  They were professional, thoughtful, kind and caring throughout his time there and may well have saved his life. He reported the counselling, fitness and wellbeing\/mindfulness as all excellent.  The facilities and setting charming and above all the kindness, knowledge and empathy of all staff.  There is of course a long road ahead but we cannot recommend them more highly.  For a long time our son was very reluctant to seek any help at all, but from our initial tentative enquiries, to him arriving back home to the UK with a completely new focus and determination to remain well,  they were simply wonderful.\nThank you so much.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-07-24T04:25:04.137Z","update_time":"2018-07-24T04:26:43.197Z","review_id":"AbFvOqleiKbktwFhhCLnknxo2YFXH7CfTqWEIbAtXRLWTn_31m5c2AYh0ROzPQAYtaa2StmEzYX0","reviewer_display_name":"Douglas Chapman","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrUHwqYERGrztl7uoKamgrDp2aBiO5zNuvTYEJlvA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"The Dawn has an incredible PTSD programme to offer. There is an Inpatient Programme which is very beneficial as in my country,they only have outpatatient programmes.\nA major benefit of an inpatient programme is that you have medical and psycological support during the PTSD treatment which is essential for your safety and well being.There is also  EMDR which appears to approach psychological issues in an unusual way. It does not rely on talk therapy or medications. Instead, EMDR uses a patient's own rapid, rhythmic eye movements. These eye movements dampen the power of emotionally charged memories of past traumatic events and desensitize the emotions associated with the traumatic event.The uses of hypnosis in the psychotherapy of PTSD victims involve coupling access to the dissociated traumatic memories with positive restructuring of those memories. Hypnosis can be used to help patients face and bear a traumatic experience by embedding it in a new context, acknowledging helplessness during the event, and yet linking that experience with remoralizing memories as well as positive memories and a positive belief system.\n\nThe clinical team as well as the support workers made a huge difference in my rehabatilation as they gave me 100% percent support during this difficut time in my life and i am very greatful for my whole experince during my stay at the dawn.","rating":"FOUR","review_reply":"","reply_update_time":""},{"create_time":"2018-03-18T05:56:38.385Z","update_time":"2018-03-18T05:56:38.385Z","review_id":"AbFvOqks8YfakrwOWTGOLhkbD0gUmBWo76JSLFQgxUche4s4tgB_Qdi4nfMW-MxzQKCCD_qyqoJMpw","reviewer_display_name":"Samruay Ketruangroj","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlGevQ8AZe-TAdcy8d3fi9nAtqBMK-s6x-gpkcD=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-03-11T14:51:29.384Z","update_time":"2018-03-11T14:51:29.384Z","review_id":"AbFvOql7YrZg_m9D9jBSd9hneCbpuGyI1pIQZUvzCgITCpEvMjnama5CeyyErknz4qNXOfMAuj-Hpg","reviewer_display_name":"shakti huilin","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmMiAdQrOw7v0X3A55r4n7q3atx8F0Kjm6ukryB=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-03-08T02:33:44.403Z","update_time":"2018-03-08T02:33:44.403Z","review_id":"AbFvOqmUVNmGJ4GimMFQPn1K24JLs55apxUSoqOLJLV1YoPvf4QR9SBYOFSjj4AEEkBgYUaJN5TnlA","reviewer_display_name":"Julie Messenger","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkguDR_QSQWj_2kygGYWIvYMnsuMApMe7ILGFw8=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I was lost in Australia due to not being about to have intensive mental healthy care. The Dawn was a wonderful location, with great staff and it has really helped me on my journey of recovery.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-02-06T07:00:37.674Z","update_time":"2018-02-06T07:00:37.674Z","review_id":"AbFvOqkdfNdb33Tp1NmM4Js9dWPNQXUXQ729ql3zMDfn02CSUcZoCO2yqTGZBR07Pq_ySCvhtQ_p2g","reviewer_display_name":"Paan Saengkaew","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucqD5oP5jHKURxv-R530E5fsjoFMswkg5fV-tIak1g=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"The Dawn Rehab is a great place to relax and cure. Situated by the river, and surrounded by abundant of greens. World-class facilities and consultants. Highly recommended.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-11-10T12:15:09.454Z","update_time":"2017-11-10T12:15:09.454Z","review_id":"AbFvOqkkcmlex2QUT22SzBn0musRIJK4m58PhKsMVyHs-vPu2FiVk_ZM5_7pNHiMXkkuRHX3gsmCqw","reviewer_display_name":"Tuukka Rihkola","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucqez7RfXjTKvZZIeWepKOhHXCtP5I2dqIWALYT9=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-10-28T01:38:58.590Z","update_time":"2017-10-28T01:38:58.590Z","review_id":"AbFvOqlsdv-eJ7-fmQ-r1atb8F-cVZJUNKkEHLAZpNtIOd5Jk_gN7KJyARuaG-8R-Tu_gMCNOh-ymQ","reviewer_display_name":"Harry Spencer","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlSRf25MUFNWt-xUkd9OLIe3mUhh4gRg-7cFwIA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Never thought I will have this much positive experience in a rehab. I was there for 8 weeks and it really did change my life for the better","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-10-28T01:25:09.346Z","update_time":"2017-10-28T01:25:09.346Z","review_id":"AbFvOqk-CuOybvp4OlbCdqckGa_TTIOkSAg8EPm0HXzEr7t3DXG7SLByBjTDpk1g88c8clO85-yvJA","reviewer_display_name":"Athiporn Poolsawaddi","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmn9ABPYCNrTyIG0JmSEH_HxsiEM_GZagJPA9X6C=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-10-27T18:08:48.399Z","update_time":"2017-10-27T18:08:48.399Z","review_id":"AbFvOqlJ6itms517KVWbzj8ZY45mwUxtzhNl1ldHAlqo5z3o4oZyqQEItQ0ourTMW0QuT9G35kAdmw","reviewer_display_name":"Juniva Jhetam","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucoZhgRUfpMqor_V2A-eCR6-CGPx0_cIRHJCii32=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"No stars  be cared🐱","rating":"ONE","review_reply":"","reply_update_time":""},{"create_time":"2017-07-02T10:31:50.410Z","update_time":"2017-07-02T10:31:50.410Z","review_id":"AbFvOqml-wI5if9giQsplT9ah-RPxnq-PS7K2kZ6qeC_Nb_WJ4FoA28dFn7740mHvhywC3beph6TZA","reviewer_display_name":"Joe Coffey","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucriT-oTue9EXmQGjFBUpoaAzlbTjXZ5Z6V50v61=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I stayed at The Dawn for almost a month, from New Year's Day 2017, until the end of January.  The place was wonderful, the food incredible, and the staff was very kind and supportive.  I'd struggled with alcoholism for my entire adult life, and this was the first step to my recovery.  I'm 6 months sober now.","rating":"FIVE","review_reply":"Thank you for your review, Joe! We are very happy to hear that you enjoyed your stay at The Dawn, and we are even more proud of reaching 6 months of sobriety. Wishing you all the best, always.","reply_update_time":"2017-07-03T06:41:34.103Z"},{"create_time":"2017-05-27T12:14:29.188Z","update_time":"2017-05-27T12:15:02.399Z","review_id":"AbFvOqmo96Mbvf-jkjOj4HoUumac5BSy0W-fZ3rGZr1qF7M8I3prWBVGO9G3xsmFyZ0MVhpyAm3Q","reviewer_display_name":"Michael O'Connor Pugh","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucqvIEmezkRZudGR51ciKFjotuc54S329jTr-kIOd50=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Incredible Wellness.  I have been in residence at The Dawn Rehab, and have had amazing results after several weeks.  I plan to extend my stay.  My private room and villa  are very comfortable. I feel safe, secure, and enjoy walking the tropical gardens daily.  Highly recommend, I especially enjoy the fresh food, yoga, meditation, and program tailored to my specific needs.  The staff and team are very professional and sincerely care about my recovery.","rating":"FIVE","review_reply":"","reply_update_time":""}]}