{"totalReviewCount":1,"review":[{"create_time":"2021-09-20T18:55:27.736Z","update_time":"2021-09-20T18:55:27.736Z","review_id":"AbFvOqlLPxzqxRHMbmeXRw-sM4ATnz1JWIdkn5-5RP0Q0nTcEbvdRxk1cxvB8tEAyZxu7vk4urXx","reviewer_display_name":"Jennie Kwong","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gjx0q-uDp6XW2mwXzqMjpCI_YKV4E4aQ0UcA8pV=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"From the very first conversation I had with Tamao, it felt like talking to a friend I had known for years! She was so eager and helpful with suggestions and offered many options for our elopement planning:  sunset vs sunrise start time, best ceremony locations and backdrops, the amazing wedding officiant Kelvin Ho, florist, hair, meal recommendations, to the fun, adventurous things we could do on our big day! The recommendations definitely didn't disappoint, and I was so happy to have the expertise of this knowledgeable Kauai local to help guide us! Their patience, understanding and willingness to be so fluid were very much appreciated during these unprecedented, pandemic times for this indecisive bride! AYA Productions never pressured us about any decisions unless it felt absolutely right. It really does show how much the client's needs were made a priority, and the grace, and aloha extended towards us, meant so much.\n\nFurther, they exceeded our expectations times infinity with the magical photos and video! They sent us a few sneak peak teaser photos just 3 days after our elopement day, which made us hungry for more, but the wait was definitely worth it! We watched our video last night and were immediately transported back to the most special, magical evening of our lives! Our day was intimate, heartfelt, authentic, playful, spontaneous, and radiated all the joy and love we feel for one another. It was effortlessly captured by this passionate husband\/wife duo!  Tamao and Matt worked together as a team, so seamlessly and the love and respect they had for each other really shined through. It was just the energy we wanted to be around on this important day that we committed our lives to one another as newly husband and wife. We felt immediately at ease around them. They were professional and efficient, but their friendly, chill vibes helped us get over any awkwardness we felt - from our messy, fumbly, professions of vows during a gorgeous sunset on the dramatic cliffs to us jumping in the blue ocean wearing our wedding attire and rolling around on the beach.  Tamao was so sweet, she even let me wipe my salt water eyes on her own romper after our adventures since we didn't have a towel with us! They were with us every step of the way.  We will cherish these memories forever and can't wait show them off to all our friends, family, and future kids! Sacred, beautiful Kauai really was the perfect way to set the tone for the rest of our lives. Thank you AYA Productions for being such an integral part of our love story and helping make our hearts sing! Their talent for capturing the details and the precious emotion of our day is something we are forever thankful for! Sending our deepest gratitude, love, and Aloha from California!","rating":"FIVE","review_reply":"","reply_update_time":""}]}