{"totalReviewCount":143,"review":[{"create_time":"2021-10-22T20:47:10.453Z","update_time":"2021-10-22T20:47:10.453Z","review_id":"AbFvOqnEx3TIqgAtEiReZtyS-r8dH2Z3fYP9gfBCsMYKqKi22o5UJiQVawTUkwcjdA97DJGft3Cxjw","reviewer_display_name":"danny costales","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhLoWi8XfhCaM-omY8jsFOU2HpRtwH8x0zeRQ9l=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Rafe was my sales representative in the Plainfield area. He was very clear-cut and precise on what the task at hand was. He was not only passionate and caring about his business but also about my customer needs. Follow up and the work turned out magnificent. I highly recommend Titan construction and if you get the chance to work with Rafe as he will go above and beyond for you even get the Hoa approval of need be in your area. Made the project less stressful 👍🏼","rating":"FIVE","review_reply":"Danny, thank you for the review! We appreciate the 5 stars. We are very happy to hear that Rafe did a great job working with you to meet the needs of your project. Thank you for choosing Titan!","reply_update_time":"2021-10-22T21:31:51.703Z"},{"create_time":"2021-10-14T11:43:07.159Z","update_time":"2021-10-14T11:43:07.159Z","review_id":"AbFvOqm99RbivIdLg20LiqzM-XsKGygZvhtzvwJArWeqq1s26f5r6-7WDgT5HYwGw90_--mEHblE","reviewer_display_name":"Renee Lang","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxceoALUgB-FUI00zN5L7hzuVie4ALkv9qS82fS=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"We are extremely pleased with Titan. Project Manager Aaron VanDerMolen was a pleasure to work with. He worked with us for months to determine the best financing and design options for our roof. Their installers were on time, professional, kind, worked all day long for 2 days, and they cleaned up the job site with a magnet. Not a nail in sight. We are so pleased with their work and the professionalism of Aaron VanDerMolen that we are now in discussions of redoing our siding, upgrading the chimney and front entryway as well as replacing windows and redirecting pesky gutters. I am a very specific client and Titan Construction didn’t blink and eye and got the job completed on time and most importantly on budget. Thanks Aaron and everyone that worked on our project!","rating":"FIVE","review_reply":"Renee, we appreciate your 5 star review! We are so happy to hear that Aaron did a fantastic job working with you on your project. We love hearing that you are looking to work with Titan on your remaining projects! Thank you for choosing Titan!","reply_update_time":"2021-10-14T15:56:03.553Z"},{"create_time":"2021-10-09T22:47:04.707Z","update_time":"2021-10-09T22:47:04.707Z","review_id":"AbFvOqlgRtMH2kiaLCyHTPNstD-1PIOtMnQkGWP2g9mYErEMW-tlPiZLgzEU6JxwmnXxzv9k40OZLg","reviewer_display_name":"Samuel Rush","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxJAIL82Swz8XJH91JdwszAkAfVmAGkSZg33CPE=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Everything went smoothly, from the initial consultation to the job completion. Had a roof and gutters replaced; both jobs done in a timely fashion (one day for roof, gutters done in three hours the following day). Big shout-out (do people still do those?) to Steve Rostowsky! A-1 service…","rating":"FIVE","review_reply":"Samuel, we are glad to hear Steve provided you with excellent 5 star service! Thank you so much for the review, and we hope to hear from you in the future regarding any and every home project you may need!","reply_update_time":"2021-10-11T16:35:19.672Z"},{"create_time":"2021-09-29T21:05:37.731Z","update_time":"2021-09-29T21:05:37.731Z","review_id":"AbFvOql-lCsTRqUIIG67LwY7enmnJSpdUz9XTb4WQgsXMwT6IKH-_b0AdPdOxBFFEBgQSQ93zfZWrQ","reviewer_display_name":"Nick H.","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwoRMy3DjxNi6KDnpXhc43fAndw0d8RX7wWO57E=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Rafe kept in contact with me during the entire process. Will definitely use Titan for future projects.","rating":"FIVE","review_reply":"Nick, we are glad to hear that Rafe earned your 5 star praises! We work hard to ensure each and every customer has a great experience with Titan! Thank you for your business!","reply_update_time":"2021-10-11T16:32:45.484Z"},{"create_time":"2021-09-28T20:35:14.578Z","update_time":"2021-09-28T20:35:14.578Z","review_id":"AbFvOql70TFjz28tkbuau9H4K4XbTi_fpHDAKcanE_Tssbh74Dwb855Fr0dYItFa8pegqU86CfTfXw","reviewer_display_name":"Charles 1955","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJywE0Y2X74m6HRXf191I5FqclMBcT-qeOG9WF0D=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"High compliments to Rafe the sales contact and job overseer. Rafe was always readily available by phone, text and on site if needed. He was very patient and helpful. I highly recommend asking for Rafe if you call for a quote. Also appreciated time the GM Tim spent with details. Very happy with the work and the outcome. I would hire Titan again.","rating":"FIVE","review_reply":"Charles, thank you for your high praises! We are very happy to hear about the excellent job Rafe did on your project. We hope to hear from you in the future for any and every home project you may need!","reply_update_time":"2021-10-11T16:28:51.536Z"},{"create_time":"2021-09-26T20:56:28.388Z","update_time":"2021-09-26T20:56:28.388Z","review_id":"AbFvOqmUH7NFBwKL34NTT4-Am78FXKtW3TWfAz5_n9QcsYHfvH7JljWisw0_CnjD5kOzPDRQRxO1DA","reviewer_display_name":"Debbie Wolf","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwZ4akMtBzX-6ZeYiapgSx8eFS-kBg65g9wPLGD=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Titan construction and Rafe were wonderful. Rafe explained everything thoroughly. Called us several times to make sure everything was ok. We have had several comments about our roof on how nice it looks. Love the company so much we are having them do our siding now. Rafe has made several trips to the house with different samples of gray siding for me to pick and choose from. Would highly recommend Rafe and Titan Construction.","rating":"FIVE","review_reply":"Debbie, thank you for the high praises! We are glad to hear Rafe went the extra mile to make sure everything was exactly as it should be several times. Thank you for choosing Titan!","reply_update_time":"2021-10-11T16:27:47.417Z"},{"create_time":"2021-09-23T19:20:39.430Z","update_time":"2021-09-23T19:20:39.430Z","review_id":"AbFvOqnBll0hNdf1uMeGm-sJmVh772u-WAuLCx3evgjO2rAzmps-xNaX8D-VpSZ-cn6V5hZP-iBKsA","reviewer_display_name":"Roger","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyEWWT6PXK4ZGpbcDXVIhpzcgiji8tkCGSeD2eR=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"My recent reroofing was very professionally managed by Rafe Lawson, Project Consultant at Titan Construction.His response time to all my questions was always timely and on point. The roofing crew did an excellent job and Rafe took the time to be on site during the day to monitor the progress and answer any queries.","rating":"FIVE","review_reply":"Roger, we are very happy to hear you had an excellent experience with Titan! We are glad that Rafe earned your 5 star praises. Thank you for choosing Titan!","reply_update_time":"2021-10-11T16:22:44.280Z"},{"create_time":"2021-09-21T18:54:48.217Z","update_time":"2021-09-21T18:54:48.217Z","review_id":"AbFvOqmUozM8b6pqnAbSrAP5RJAdhjxmkXkL_qOmkslrNxGebGE4yq1EUdj4XQ43BC7zO5wSm3sx","reviewer_display_name":"Steve Miller","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxSnhp1-aqYZBdKJH6c4mo4QE0RCxDhgg2DMj6s=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Titan did a fantastic job with my windows and slider door. I've been recommending them to friends ever since. Rafe was my rep and I appreciated his ability to listen to what my needs were provide a solution that fit my budget while educating me on the good, better and best options. I pulled estimates from other contractors and had to sit through long sales pitches with inflated quotes. Rafe got my estimate right the first time because he listened to me... Other companies want to meet after the fact, to try and give better deals because the first quotes were so high. Rafe was respectful of my time and fully understood what I wanted. The install team was great as well and followed up to make sure I get exactly what I was looking for... I could not be happier with Titan!","rating":"FIVE","review_reply":"Steve, we are happy to hear you had an excellent experience with Rafe and Titan Construction! We try to provide the best experience possible to each and every customer, and are ecstatic to hear that Rafe earned your 5 star praises! We hope to hear from you in the future regarding any, and every home project need.","reply_update_time":"2021-10-11T16:21:26.320Z"},{"create_time":"2021-09-17T19:52:22.242Z","update_time":"2021-09-17T19:52:22.242Z","review_id":"AbFvOqmVqIhsCWXK34MS0Zc06PFAPoIsBn61dyW6aaBJl7i8_Mh7wbbuw1GwSXDfjnUOoVe4bNS2","reviewer_display_name":"Jessica Southwick","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GjDKxuRPvEfiYAr8koCAhfsP11nFq50xE0Vmzdm=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"We had titan construction install a sliding glass door for us and from start to finish our experience has been great. Phil was our sales rep and he was amazing! Very professional, personable and not pushy. I had multiple companies give us estimates and he was the most thorough to make sure what was causing the problem would be resolved. (We had water coming into our basement from our old door) he was honest and they were very reasonable. I would highly recommend for any of your construction needs!","rating":"FIVE","review_reply":"Jessica, thank you for the positive feedback! We are very happy to hear that Phil did an excellent job searching for and solving the issue you were having. We hope to hear from you in the future regarding any and every home project you may need!","reply_update_time":"2021-10-11T16:17:55.755Z"},{"create_time":"2021-09-17T14:16:37.934Z","update_time":"2021-09-17T14:16:37.934Z","review_id":"AbFvOqmG2m0pliSkG5W5ENJaBfN1nXQTXMCF71ZchMU1EuF0zqasb0NX7jfzYKuG8AOlmL1pnmIIpg","reviewer_display_name":"Cheryl","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwFSecatgkuuEYX6XA3JWn-WVDk-jWg611rjcDA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Phil was very responsive, and great to work with.  Will definitely recommend him and Titan Construction.","rating":"FIVE","review_reply":"Cheryl, thank you for the high regards for Phil and Titan Construction! We appreciate your positive feedback, and we hope to hear from you in the future regarding any home project needs you might need.","reply_update_time":"2021-10-11T16:15:46.491Z"},{"create_time":"2021-09-17T13:31:41.696Z","update_time":"2021-09-17T13:31:41.696Z","review_id":"AbFvOqkR_hBWPxbOV3tE3D60F9IbdOfkvp554voF1W9SSuZWkEjQS_ViY4Kfedqr8HSWiPmRFxI-WA","reviewer_display_name":"P O","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJx-jnSXktTwmif4G3SoioRngOAGZSmzmd5oz-E=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Phil and his team were great about answering all our questions. We felt confident in the process and are very happy with our new windows","rating":"FIVE","review_reply":"Thank you for choosing Titan! We are very happy to hear that Phil provided you with 5 star service! We hope to hear from you for any future project needs.","reply_update_time":"2021-10-11T16:14:45.940Z"},{"create_time":"2021-09-17T13:09:31.933Z","update_time":"2021-09-17T13:09:31.933Z","review_id":"AbFvOqnDqH99Bm3Ar5hxArsE9vJuYPoVfFETVz2T0U8Ct6eL99-AnEpPH27WFT4brZUKGqpPM06vpQ","reviewer_display_name":"Nick Rasinskis","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJx64VceAsXNErNjoArx0o6izf97W8KC8qCmifsf=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Had a small garage door project I was looking to get done, called titan and they came out quickly! I met Phil Carlton and he was very happy to help. Answered all my questions and went through all my options. Had my project completed and it looks amazing. Phil was great and I will be using titan again.","rating":"FIVE","review_reply":"Nick, thank you for choosing Titan! We are very happy to hear that Phil provided you with excellent service and earned your 5 star rating. Each team member here tries their hardest to make every customer happy with their experience. We hope to hear from you in the future regarding any home project needs!","reply_update_time":"2021-10-11T16:12:56.117Z"},{"create_time":"2021-09-15T22:34:57.471Z","update_time":"2021-09-15T22:34:57.471Z","review_id":"AbFvOqntc0qXQ4TV-a6dRMjxJxSAUTgegmuTVGEuUhj07pacnL4Jvx_7tbBrWcNgwoAenHFes5b8AA","reviewer_display_name":"Dan Mourning","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxS05neTUd8QCRPYJfSIejlBibTE54cDBjVOLTC=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"My wife and I moved into our house back in October. Reached out to Titan through a contact I had there (Phil Carlton) as of course we had a few items like a deck and a roof that needed some attention. Phil always got right back to me, and they've delivered quality work at a fair price every time.  Highly recommend.","rating":"FIVE","review_reply":"Dan, we are glad to hear that Phil helped you out with the projects you needed! Thank you for choosing Titan, we hope to hear from you in the future regarding any projects you need help with!","reply_update_time":"2021-10-11T15:57:32.752Z"},{"create_time":"2021-09-15T14:37:27.106Z","update_time":"2021-09-15T14:37:27.106Z","review_id":"AbFvOqkbQVMRcz-1HOQobxitQ1JtYxsVMDUW8IUpvd9S5VC8bFvq7sET1n8Algj6qzdTFHbOeEp6","reviewer_display_name":"Doug Czerniakowski","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzkH3C7arhizedz0fY3TAg5nwa5mGBgfyXiXfc=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"We had Titan replace our windows.  From purchasing with Raf, who was very knowledgable about the product and professional throughout the entire process.  He kept us updated on timing as to when windows would be ready and came back to make sure installation went well.  Installer was great as well.  He was very knowledgable and an extremely hard worker. He cleaned up after the job\nwas finished.  Titan did an amazing job from start to finish.  We would definitely recommend Titan Construction.  They used quality products and are a good value as well!","rating":"FIVE","review_reply":"Doug, thank you for your 5 star review! We are happy to hear that Rafe did a fantastic job providing you with excellent service. We hope to hear from you in the future regarding any home projects you need!","reply_update_time":"2021-10-11T15:56:36.493Z"},{"create_time":"2021-09-14T20:49:03.982Z","update_time":"2021-09-14T20:49:03.982Z","review_id":"AbFvOqldWRd01N__uqObOCxO0uqyCwhvJFTbhBvyAPPERyOh4iRxb3NPrUeeNF9gkOB62Rd8Rrc0qA","reviewer_display_name":"Jim Rife","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxEa-jz0l61aXy_pihvA6L6JsckD5a0gyc-NkjK=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Titan Construction has done an excellent job taking care of all of my situations. They have replaced my roof, gutters and repaired my siding . I have and will continue to refer them to all of my friends and family! It is awesome to have a locally owned company that I can reach out to to get issues taken care of.","rating":"FIVE","review_reply":"Jim, we are happy to hear we earned your high praises! We work hard to provide excellent service to each and every customer. We hope to hear from you in the future regarding any and every one of your home project needs!","reply_update_time":"2021-10-11T15:54:43.795Z"},{"create_time":"2021-09-11T00:34:43.142Z","update_time":"2021-09-11T00:34:43.142Z","review_id":"AbFvOqmQdmjsTHFr9Oiqkpf0HuO9dfPwp9J-bu2qK8xpYYN2ZrFiCQ1Mv08tt6tUGOm8U4NFkUzH","reviewer_display_name":"G M","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyqneW6HIwWMcRszyWVYrFQFfVVBVo20j8atjJJ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"My experience with Phil Carlton and the entire Titan Construction Team was excellent.  Currently working on a small project and the contractor that I am working with indicated that before they could finish the job, some siding needed to be repaired.  I got online and read through some great reviews Titan Construction received so I decided to give them a call.  I spoke to their friendly and knowledgeable staff and provided pictures via my phone of the damage that required repair.  I received a call from Phil that same day and he offered to stop by the house to see the work that needed to be done.  Since Titan provided a fair quote, I decided to work with Phil.  I really appreciated that Phil took into account that I had contractors waiting for the siding to be repaired before the project could be completed.  Due to the age of my home, the siding that is currently on my home is no longer manufactured but Phil took the extra steps to ensure that the color and pattern of the siding that Titan was going to install matched the siding I have on my home. Furthermore, within four business days, there was a crew member at my home doing the repairs.  The repair person took great care and was detailed to make sure that the repair was done correctly and that everything looked right.  The old siding was hauled away by Titan so i did not have to be concerned with disposal.  Phil called me a couple of days before to ensure that I would be home during the repair and called me on the day of the repair to ensure that everything was going as planned.  Phil kept me informed throughout the entire process which brought me peace of mind that i had hired the right contractor.  Thanks Phil and the Titan Team for providing a great experience and look forward to working with you again in the near future.","rating":"FIVE","review_reply":"Thank you Giovanni! It was genuinely a pleasure working with you from the first call! We are here for you whenever you need us! - Phil\/Josh","reply_update_time":"2021-09-14T21:01:08.587Z"},{"create_time":"2021-09-05T12:14:04.885Z","update_time":"2021-09-05T12:14:04.885Z","review_id":"AbFvOqndCLFmlJD4ZYUKzelFAV6oLYXNo81Vz3G2QcPw8Y_uTh5TF3Ry-Nq9XpXlLQtWpu5oie6jXQ","reviewer_display_name":"H Donn","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgMsvrJWF-xVOtG4gaZgzo0nGqL9Z_rbFXfELvLidw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Had our roof replaced 10 years ago and surprisingly it was a very pleasant experience,  Bill Dodge was fantastic.   A genuine professional, he walked us through the process  as well as seamlessly working with our insurance company,  communicating the ‘why’ we needed certain types of work that needed to be performed as a result of a storm.  Recently we had a ‘drain’ issue.  We called and their Sales Manager  and Tim showed up promptly, pulled the ladder out, climbed right up to the area where the issue was, and started to chuckle., took a picture and said, “you are not going to believe this”.  An animal put dirt and nuts in the elbow downspout !  Tim took apart the downspout, cleaned it out, put it back together and noted we should not have a problem in the future.  When we asked ‘how much do we owe ya?’  He said ‘nothing, you are existing customers, it is part of our service to you!   WOW - what an ethical guy…. Thank you Tim and Titan.  Our next project at the house, you will be the first call for service and repair!!","rating":"FIVE","review_reply":"Thank you for choosing Titan! We are very glad to hear that Tim provided excellent service to you with this extraordinary issue! We hope to hear from you in the future regarding any and every one of your home project needs.","reply_update_time":"2021-10-11T15:53:33.878Z"},{"create_time":"2021-09-01T00:05:43.351Z","update_time":"2021-09-01T00:05:43.351Z","review_id":"AbFvOqkD9rtDyxEcm8uQxDWXWXTk4Y5UM-LabrHLjrEo8KAaAsced1tNOp9DqSFBqgub9MWx6_lKKQ","reviewer_display_name":"Brittany Bolek","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzm9v268Xi8s_WdcuijLD_zr5BIh56pM8G8m7XA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Titan Construction completed a project on my home and I can’t say enough about this company! I worked with Nathan and it was a seamless process from beginning to end I would highly recommend.","rating":"FIVE","review_reply":"Brittany, thank you for choosing Titan! We are glad to hear that we earned your high praises. We hope to hear from you in the future regarding any home projects you need help with!","reply_update_time":"2021-10-11T15:50:41.047Z"},{"create_time":"2021-08-28T16:08:39.777Z","update_time":"2021-08-28T16:08:39.777Z","review_id":"AbFvOqmrnoRfTsnzDkoaB9LMPl4rEgUOiEbETlgiUllJAaAKHB1LAF-8veMNRWU7C-m6hwBIF9WuJQ","reviewer_display_name":"Christine Pratscher","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJw3Avg9iwLkTeLRHbqQBXT9HTXCYzuto2gbWY0-=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"The first thing that impressed me about this company is the quick response that we received from Aaron. He got in touch with us immediately when we requested information on siding and windows. During the whole work process, Aaron was right on top of things. His communication throughout has been a key factor of why I highly recommend Titan as well as his working with us to get the best for our home. Communication is number 1 in my book and Aaron gets 5 stars not only for that, but for making sure our home was taken care of with the best workmanship from Titan. It's like looking at a brand new home! Also, all the crews who worked on our home were professional, courteous, and  friendly. I highly recommend Titan Construction.","rating":"FIVE","review_reply":"Christine, we are glad to hear that Aaron earned your high praises! We work hard to make sure each and every customer is happy when choosing Titan. Thank you for the 5 star review!","reply_update_time":"2021-10-11T15:49:29.330Z"},{"create_time":"2021-08-27T16:55:03.633Z","update_time":"2021-08-27T16:55:03.633Z","review_id":"AbFvOqkF183qZLxx4dBVqlXmtSZps1R59XYGPXrnwg2Z6hstLu7SURj-8kWk4tHW9O0YqW38nTcfjw","reviewer_display_name":"Zach Shoop","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhPjQrZC2ZOSdmy1fG0fGQxtlUvGssTTsgKfYCd5vc=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I worked with Nate on a project, he provided outstanding customer service throughout the entire process. I appreciated his honesty and passion for his craft. I would love to work with him again in the future.","rating":"FIVE","review_reply":"Zach, we are glad to hear that Nate met or exceeded your expectations! Thank you for the high praises, and we hope to hear from you in the future regarding any of your home project needs!","reply_update_time":"2021-10-11T15:47:55.893Z"},{"create_time":"2021-08-26T23:49:45.507Z","update_time":"2021-08-26T23:49:45.507Z","review_id":"AbFvOqnsO6pBeUY-8qgCBYGWpP96mWxYORmC4iDaXdowDBjEeM9pj_2QG1HJUXTQ3Nbg-I6s_NPkrw","reviewer_display_name":"Alex Shelton","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwmD5AdeYU3GRgWkSwOZgxypi0vxXerYAjhI9iq=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Needed one window replaced in my kitchen and called Titan after the larger window companies lack of customer service. Very easy to work with, great value and local!","rating":"FIVE","review_reply":"Alex, we are very happy to hear that Titan was able to take care of your needs! Thank you for the high praises, and we hope to hear from you in the future regarding any future projects!","reply_update_time":"2021-10-11T15:46:20.817Z"},{"create_time":"2021-08-26T21:56:16.865Z","update_time":"2021-08-26T21:56:16.865Z","review_id":"AbFvOqmaclMPYnOGeKowB6P_NfPpBprN5q3Elsru--aNYsw4n8Sm_4sV-sgEmjE9Ntx2ll70aL7rxw","reviewer_display_name":"Brett Butler","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwPTfjZJiG--UE30ftxdhSVGPtQHKFeqrYMs-21=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"After a not-so-pleasant experience with another contractor, my insurance company referred me to Titan. The way they operate their company far surpasses other smaller companies I have worked with. Lysette in the office is great and the crew was extremely clean! Very impressed, can't wait to replace my windows in the future!","rating":"FIVE","review_reply":"Brett, thank you for the high praises! We are glad to hear your experience working with Lysette and Titan was a good one. We hope to hear from you regarding any future home projects!","reply_update_time":"2021-10-11T15:45:19.283Z"},{"create_time":"2021-08-26T21:51:17.954Z","update_time":"2021-08-26T21:51:17.954Z","review_id":"AbFvOqktGtGNzDw1yk9K_gWyoyJIkIf1BwrImrLrs4ENmheU9No_Ok5FB7khOU-K0KfD7SqZLnIHFQ","reviewer_display_name":"Joshua Skummbag","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyB8Iakv-hgRkkNh59zBeCf8NCSOpaDtEyutto7d6w=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Nothing but great things to say about Titan Construction. I've seen their trucks for years and after 2019s hail storm, I finally had a chance to use them! They exceeded my exceptions and everything went surprisingly smooth. After seeing my neighbors have quite the headache after working with their contractor, I'm glad I chose Titan!","rating":"FIVE","review_reply":"Joshua, thank you for the great review! It's a pleasure working with each and every customer, and we are glad we earned your high praises!","reply_update_time":"2021-10-11T15:42:51.164Z"},{"create_time":"2021-08-26T17:58:15.214Z","update_time":"2021-08-26T17:58:15.214Z","review_id":"AbFvOqmogil8wIEIXdvJccmICtVTThdwezSL1_AFRN9c3AqiSFs0M4MvN24bAqWxVhS6Jh8g_f5k","reviewer_display_name":"Luke Phelan","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzlrvWy7l2SdvLVCDr4xig8N7RWWJ-8k7-dHXBU=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Had Nate come help out with a recent project and he did a phenomenal job. Nate and the team were great to work with. Would highly recommend!","rating":"FIVE","review_reply":"Luke, we are glad to hear Nate worked hard, and earned your high praises! We work hard to make each and every customer happy. Thank you for choosing Titan!","reply_update_time":"2021-10-11T15:40:07.971Z"},{"create_time":"2021-08-26T15:12:06.715Z","update_time":"2021-08-26T15:12:06.715Z","review_id":"AbFvOqldvsJ1N5gE7Q7yUKMZXlUMt9xCcMoVmubegK_QXKoDjsfv02MgN6MAB61XNVX8ell0whtZyg","reviewer_display_name":"D BARNES","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzOHZe7gyqDIGZUKH9n8Fh_n0DZlVmj2e4QzGc=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"ABSOLUTELY AMAZING. Aaron and his team was very very professional. I had a new roof on my house and garage, new gorgeous chocolate\/coco siding on house and garage. I also 4 exterior  doors made. My home stands out and is  eye catcher. You can't drive by without slowing down to see my masterpiece","rating":"FIVE","review_reply":"Thank you for choosing Titan! We are glad to hear Aaron earned your high praises, and made your home stand out from the rest. We hope to hear from you in the future regarding any home projects you may need!","reply_update_time":"2021-10-11T15:37:37.359Z"},{"create_time":"2021-08-26T03:08:37.755Z","update_time":"2021-08-26T03:08:37.755Z","review_id":"AbFvOqnJbacXxBfZ1ahP9-MVd5lntuOSJrqiCV3ZXNVNlG3thqvgxs4UFgHI85-wccAdWcRAxTPzXg","reviewer_display_name":"Stefan Cetenovic","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GisxguW2dwbzb6AcQcKXfd3wPkwwo5t7QpgFSQo=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Absolutely amazing company, highly recommend asap for all of your work. I was always worried prior with roof work but this company is my go to now for life Aaron Vandermolen is absolutely amazing with all his effort and making sure the job went perfect. The work that was done was beyond what i could of asked for in quality.\n\nThey worked on and did amazing work in\n1. wrapping front of fascia trim below soffit\n2. Repair and caulk siding\n3. Repairing my damaged fascia on the home.\n\nIn plainfield illinois they took care of my home amazing","rating":"FIVE","review_reply":"Stefan, we are glad to hear that Aaron did a great job with your project! Thank you for choosing Titan, and we hope to hear from your regarding any future home projects","reply_update_time":"2021-10-11T15:36:23.892Z"},{"create_time":"2021-08-25T15:45:00.601Z","update_time":"2021-08-25T15:45:00.601Z","review_id":"AbFvOqmeeqOHTCzRv9DdpsE4JecXICVGkGMlieQMR7y1FZ1bmgxY4zEmaRAjb0pY3gXY_zDPmyfwTQ","reviewer_display_name":"Amy Zurita","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJx-ClxCFj9Uk8IUy_hCX3UgnSLng4hJDSh5l1lb=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"My parents have used Titan for a lot of things at their house, and when I bought my own house and had some leaky windows, calling them was a no-brainer. Phil was super helpful in setting a time to do a water test, and I really appreciated that they took the time to figure out what the problem was, rather than just trying to get me to buy new windows, especially since it wasn't a window problem after all. I also worked with them to get a new exterior door, which I love. As a new homeowner, I'm sure I'll have more inevitable projects come up down the line, and when they do, I'll be having Titan come to help me out.","rating":"FIVE","review_reply":"Amy, we are glad we earned your 5 star rating! We work our hardest to make each and every customer happy. We are happy to hear Phil did a great job for your project and worked to find the problem! We look forward to keeping in touch regarding any future home projects","reply_update_time":"2021-10-11T15:33:41.274Z"},{"create_time":"2021-08-24T14:49:37.226Z","update_time":"2021-08-24T14:49:37.226Z","review_id":"AbFvOqkMSqAhbJRTnLbONSicdg3KjEkSGLyRUnYKaNk8ymbblkSSEiyr6dRWksXGVtLrdt-U3d_Y","reviewer_display_name":"Marty Krizka","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gi1WuZL2AxbXxf28I8JXWVK0CE6T4cCGrF6B7Gq=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Worked with a Titan rep Nate Tomich over there he was super responsive and professional. I would highly recommend to anyone in the market for a roof","rating":"FIVE","review_reply":"Marty, thank you for the 5 star rating and for your recommendation! We work hard to make each customer happy, and we are glad Nate did a great job on your project!","reply_update_time":"2021-10-11T15:31:30.496Z"},{"create_time":"2021-08-19T20:51:51.768Z","update_time":"2021-08-19T20:51:51.768Z","review_id":"AbFvOqlnjtBAkjJXsBA8V3yuw-GI27IeKCpcxswOFmBU4iwHV7iXfBGfDciZU1a6Epe9lAAlvmC4uw","reviewer_display_name":"Eileen Bleidorn","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxMkq85sS7mQU7vB3Rxrswsuo9s7cYDclK1J9qW=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Worked with Phil and found him to be very professional, kept in contact the whole time which is a plus in my book!","rating":"FIVE","review_reply":"Eileen, thank you for the 5 star rating! We are glad Phil met or exceeded your expectations in order to earn a 5 star rating.","reply_update_time":"2021-10-11T15:29:52.940Z"},{"create_time":"2021-08-18T00:32:27.426Z","update_time":"2021-08-18T00:32:27.426Z","review_id":"AbFvOqmSkmNw1YAdLuk9zBuQafsvsipOOzSYLh4oaoMP-jJ8eWXBmkxzLkCHQWGTkCAPUXft10oPkA","reviewer_display_name":"Michele Ditello","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyZCjgzD1MY_EgEHjkeG-uRMw63n7N8otOc-QgR=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Work done on my home in Crest Hill by Titan Construction.  Prompt, truthful and impressive work.  My roof and gutters look great, I actually have received a number of compliments on how they make a positive impact on the look of my home...great curb appeal !! Communication with their project manager Nathan made the whole process a great experience.  I highly recommend this local company.","rating":"FIVE","review_reply":"Michele, we are so happy to hear that Nathan earned your 5 star rating! We work very hard to make customers like you happy, so we are glad to hear that we met or exceeded your expectations!","reply_update_time":"2021-10-11T15:28:02.684Z"},{"create_time":"2021-08-17T15:38:40.655Z","update_time":"2021-08-17T15:38:40.655Z","review_id":"AbFvOqn65ubr4BVFYMSfsD2R1-POGnDXHvFHiNqWL1geswNqQQQe3I4UX89efWAk6ZG-iiBfMtwxqQ","reviewer_display_name":"Nate","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJz1vcserfbgSUEbHa2wqwk3gHREvs988K3sWRO0=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"The team at Titan construction was prompt and polite. They helped with a project for a family member and the salesman Nathan was excellent, besides having the same name he delivered on all promises for our Shorewood roofing project, we cannot recommend enough!","rating":"FIVE","review_reply":"Nate, thank you for choosing Titan! We are glad to hear that Nathan earned your high praises. Reach out to us for any of your future project needs!","reply_update_time":"2021-10-11T15:25:55.097Z"},{"create_time":"2021-08-16T14:17:10.545Z","update_time":"2021-08-16T14:17:10.545Z","review_id":"AbFvOqkOGQZXNhzmfX1IicJ6Sm_hT2gFNtEIVQgjuIojS-z53lsYU8kuPtL_lMJ-fr0lVL3v8OzBDg","reviewer_display_name":"Robert Jeropke","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJz87w0YwU5ZZfSeY5LdGHg9AfNqPLMdYVqpBpH6=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Titan Construction is a great company. They really worked with my insurance company. They were able to get my roof replaced were other companies could not. I had a very good representative from Titan Phil Carlton. He worked with us and followed up to be sure we got our project completed.  The installers were fantastic, they protected our whole house. They were very professional and smiled the whole time. My wife and I are very happy with this entire process from start to finish.","rating":"FIVE","review_reply":"Robert, we are ecstatic to hear that we earned your praise! Thank you for choosing Titan, and we hope to talk to you for any of your future project needs!","reply_update_time":"2021-10-11T15:23:34.279Z"},{"create_time":"2021-08-13T23:18:52.177Z","update_time":"2021-08-13T23:18:52.177Z","review_id":"AbFvOqkrQrTVUiWREPj6-e4Isu9SAXibHzcqR7F2WaZhpqNujpbNx1KrIwCcDXofofKmE4zzjae-","reviewer_display_name":"Ryan Little","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxj807EviU9rZ0TDlO93NY5URPos97ZJywFXRyw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"We originally went with a different roofer and after closing on a renovation loan (including a roof replacement), roofer asked for 25% more money to cover changes in material cost.  Luckily, I found Titan Construction on yelp and was able compare new quotes.  Phil was understanding and willing to work with us as we had to wait on funds to be returned and previous roofers contract terminated.  They were flexible with completing all the additional requirements needed for renovation loans.  It took a couple weeks for our lender to release funds and Titan's crew was onsite a couple weeks later.  I wish we'd gone with Titan from the beginning.  It would have saved us a lot of stress.  Thanks again Phil!","rating":"FIVE","review_reply":"Ryan, we are very happy to hear that Phil did a great job for your project! All of our team members work hard to keep the customer happy, so we are very glad to hear we earned your praise. Thank you for choosing Titan!","reply_update_time":"2021-10-11T15:22:01.906Z"},{"create_time":"2021-07-23T15:10:01.216Z","update_time":"2021-07-23T15:10:01.216Z","review_id":"AbFvOqmx_lWwzEim8vPNvAjMBrPXvMiXAN1XOHKCgD8PBdqpTWg6icVsQY5PtRP9uuCW9dc0WWX6","reviewer_display_name":"Dan L.","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzVn-HaFI_CoFybkbDa9DIR6xuKUK-VxNzunM9P=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Titan did an excellent job. The crew was on-time and professional. They were very organized and cleaned up daily after the job. I highly recommend their service.","rating":"FIVE","review_reply":"Dan, thank you for the praise! All of our team members work very hard to make the customer happy, so it is great to receive your praise.","reply_update_time":"2021-10-11T15:20:20.430Z"},{"create_time":"2021-07-21T14:06:38.428Z","update_time":"2021-07-21T14:06:38.428Z","review_id":"AbFvOqmz7Fp-YSL6RsXXs1PTIU0ihq2lkyN00PAFWdJr_LsXPMOyCdCUUdBg_x1g9SZSabN3UvPCAw","reviewer_display_name":"Andres Rincon","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GglTXhoRYwMMA4T1DSfAsxnoTReG1YXsCcm6HAYjQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Needed some repairs on my roof that were discovered during a home inspection and was turned down.  The reason I was given was because a realtor was involved.  Not sure why that matters it’s still my roof and I need it repaired.  The kicker….my realtor was the one that recommended them because they did the work on their home.","rating":"TWO","review_reply":"Andres, we apologize we are unable to help with your project, however, we politely provided an explanation as to why we can’t help. As we mentioned, we do not  get involved in home inspections. I apologize we do not provide this service, but a negative review is unnecessary. This is not a representation of our company, you simply wanted a service we don’t provide. Thank you","reply_update_time":"2021-07-22T11:56:10.628Z"},{"create_time":"2021-07-20T17:54:58.088Z","update_time":"2021-07-20T17:54:58.088Z","review_id":"AbFvOqnp8Z9Oqb52mSXrjVFfWv7znGCMoTY2iOapU2Qzn5xrRLS0vAZPwZ4GpdOSn652YJKrnKn5","reviewer_display_name":"Rob Schwarz Jr.","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJz9gGxV907REjRUuq3NyGuB9VrGx_wulNVsC9Ej=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"We had a unique situation where we originally were dealing with a different company to have our roof replaced. However, our insurance agency preferred we use a company they had already vetted and recommended Titan Construction.\n\nNathan came out to do our inspection and was very easy to work with. We live in a community with a Homeowners Association and while attempting to get approval for the new roof, our Association changed management companies.\n\nTitan Construction went above and beyond by contacting our Association on our behalf. I had abdominal surgery and was in the hospital for a few days and have been recovering at home. Titan Construction (Lysette and Nathan) made my life easy by keeping on the management company to ensure they approved the better materials with a longer warranty.\n\nThe roof itself looks great and the team was able to finish it within one day. Our neighbors had our original company replace their roof and the cleanup was awful. We had garbage all throughout our yard from their workers. Titan Construction on the other hand was very thorough and made sure to clean up everything. They missed a few roofing nails in the grass, but that's to be expected. Everything else was pristine. Including the gutter replacement, the project took about a day and a half. Everyone I spoke to was very professional and made sure we were satisfied with the work that was done.\n\nI would highly recommend Titan Construction for any roofing projects\/repairs. Five Stars!","rating":"FIVE","review_reply":"Thank you for the AWESOME review. You have been an customer as well. We hope to do more business with you in the future","reply_update_time":"2021-07-20T18:23:22.739Z"},{"create_time":"2021-07-13T00:37:32.034Z","update_time":"2021-07-13T00:37:32.034Z","review_id":"AbFvOqn140uiaUaw6FgkvT3G6tCIaEE_AfRaQx3ewbIHxDifTlK8skQORcovU-eUM05OyQLkckOn","reviewer_display_name":"John O’Donnell","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJww4RcRfGQh1ozb3hVD_ZayIACIv1GwXa-_BsBV=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"In April and May 2021,  I had a complete roof replacement on  my house.  The people from Titan did an excellent job;  they  arrived early, worked continuously all day and performed a excellent cleanup at the end of the day.  The recent storms we had in May and June showed the  professional quality of their material  and installation, as there were no leaks observed.   I would recommend Titan to anyone considering roofing or any construction  projects.","rating":"FIVE","review_reply":"John, we are very happy to hear we earned your praise! Keep Titan in mind for any future home projects, thank you for your business!","reply_update_time":"2021-10-11T15:19:26.272Z"},{"create_time":"2021-06-28T17:59:13.935Z","update_time":"2021-06-28T17:59:13.935Z","review_id":"AbFvOqmCDWqy2z3cft_tGukIuHv0noOEji7XbKe-b0r-izRespyIXVmFnc1Q98s5mGQjGR-FdfdAuw","reviewer_display_name":"Elaine Carraway","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzGjFHY3WTgIBTdRj8F3S8GJq2fbty6n73DRNnK=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I recently worked with Aaron VanDerMolen to have my siding project completed. The price was fair and the quality of work was excellent. Communication was great all the way through.  Would definitely recommend to anyone looking to have an exterior construction project done!","rating":"FIVE","review_reply":"Elaine, we are very happy to hear we earned your 5 star rating! We hope to speak to you again in the future for any of your home project needs","reply_update_time":"2021-10-11T15:18:29.496Z"},{"create_time":"2021-06-15T15:24:30.746Z","update_time":"2021-06-15T15:24:30.746Z","review_id":"AbFvOqmP80gsVCkakCIIHbF6VCyIzFxb--68DOFLmK5aywnlSe2rMZB_mzFm4fM3fq7u0mpDM4luRQ","reviewer_display_name":"Charles","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gh0KtIlNQBkfv8yqnxECnpfMl9BtmuhdzTC0FHnoA0=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Titan did an excellent job with our roof replacement!  We worked with Emmett.  He is awesome!  Very professional, responsive, and customer focused.  The roof looks great!  We are extremely happy with the work and the service we received from Titan.","rating":"FIVE","review_reply":"Thank you for the great review. It was a pleasure to work with you","reply_update_time":"2021-06-15T15:52:39.336Z"},{"create_time":"2021-06-11T21:28:31.740Z","update_time":"2021-06-11T21:28:31.740Z","review_id":"AbFvOqmmptpd2FahHsfxX7Eg0Ukdz6l3LIkiQLrBa6gRDATkNIcaE2AgYMcsCS0PENoipIpqtoFBew","reviewer_display_name":"Lukas Van Eck","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhigGmsYHVF3fG16hF26t4SGsnr_Hi9vJUikuY1jQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Called Titan to come out and look at my soffit and fascia. The representative, Rafe, came out on time and was very honest and up front. Will do more business with them in the future.","rating":"FIVE","review_reply":"Thank you for the great review","reply_update_time":"2021-06-15T15:53:00.375Z"},{"create_time":"2021-06-10T02:54:16.458Z","update_time":"2021-06-10T02:54:16.458Z","review_id":"AbFvOqlz5AaWue5DEnVTmNOta7OT13WNqVa1NxGKqJ8KgeUPhr2x7HqbsQ2wt0K1NHWfzjnDmF5tGA","reviewer_display_name":"Nancy Hughes","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxzZP9FewA5SnjSR7JBnW6Cj0uJHZP8XM9vqsTE=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Our experience with Titan Construction was outstanding!\nWhen contacting Titan Construction, we were connected to Aaron Vandermolen who explained the entire process of how the roof is installed.  From each layer to the shingles.  Before the crew began the tear-off, a dumpster was placed in our driveway, they took the necessary precautions to cover all windows.\nWhen the crew started tear-off they also informed us of other issues that were needed. IE:  making our garage roof level, skylight replacement.\nWith Titan Construction also handling gutters, we had them install new gutters with the ‘gutter goalies’ (no need to clean anymore)\nThe total process was 1 1\/2 days, for the things we wanted and needed.  After completion, Titan Construction made sure all materials were cleaned up. They even went around the home, with a large magnet, looking for nails, screws, etc.  All was spotless before asking us “if all was completed to our satisfaction”.\nAgain, along with Aaron Vandermolen, his assistant Joshua Skummer and the crew kept us informed as needed. Also answering any questions\/concerns we had.\nWe would definitely, without doubt, recommend Titan Construction for all your needs.  They were professional, knowledgeable, courteous, etc.  the way you would like to be treated.","rating":"FIVE","review_reply":"Thank you so much Nancy. It genuinely was a pleasure working with you.","reply_update_time":"2021-06-15T15:53:26.733Z"},{"create_time":"2021-06-09T02:47:58.214Z","update_time":"2021-06-09T02:47:58.214Z","review_id":"AbFvOqkHiD-TenmIu56SlbZjWL477EuqPy9SwFE1bcqQQwP9M1VKqqO-gp0t51yZbQZJkywiwSOV","reviewer_display_name":"Zach Browning","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxWpfg5z_47TejEUUy0cVxQOki41ST59Zm7eEsh=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Called Titan to take a look at a couple windows and my roof. Rafe came out on time and was very knowledgeable about products. Highly recommend","rating":"FIVE","review_reply":"Thank you","reply_update_time":"2021-06-15T15:53:34.286Z"},{"create_time":"2021-06-02T21:12:29.503Z","update_time":"2021-06-02T21:12:29.503Z","review_id":"AbFvOqkqqHiwco7sQnIJzSG1vvdHPpj3r-aVmcPWO9QSLDKBOv4V0jR_lt2ciW4_l1K4fSa1K2dfFw","reviewer_display_name":"Amber Moore","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxU5X3QeyBcZNMGGMG7sGLBsKETQnAEWzQFauCD=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Steve andabdbthe staff at Titan walked us through a new roof installation (our first ever).  They were punctual, professional and installed a good looking  roof.   I would hire them again for  additional work or recommend  them to friends or family.","rating":"FIVE","review_reply":"Thank you Amber. It was a pleasure to work with you as well. If you ever need us, you know where to find us","reply_update_time":"2021-06-02T21:53:22.837Z"},{"create_time":"2021-06-01T19:29:57.108Z","update_time":"2021-06-01T19:29:57.108Z","review_id":"AbFvOqk2zQxXDBk2aMHajYdextfTzWFCID4HPo29LzOHzRREzUKit6uOoMdjjfRE5eV1SOBB1whD","reviewer_display_name":"Eric Taylor","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJw5BcPhBrh0ygyoY9zKweNTxyHnVKaSWlQmRCA=s120-c-c0x00000000-cc-rp-mo-ba4-br100","is_anonymous":null,"comment":"Did great work on my roof and gutters and Phil was excellent to work with and quick to respond to any questions.","rating":"FIVE","review_reply":"Eric, we are glad to hear Phil provided you excellent service! We hope you keep Titan in mind with any home improvement projects you may need!","reply_update_time":"2021-10-11T16:48:18.935Z"},{"create_time":"2021-05-30T23:56:34.002Z","update_time":"2021-05-30T23:56:34.002Z","review_id":"AbFvOqkTnr_DM3hCt-YtPJhcgtWZbguMV1NzmRst-R6pcwNnsrp8uDTFE0P_VNluiOZIvNRTJ84","reviewer_display_name":"Brooke Karraker","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxD-iD8cuoK71hyNbxfjYvanHYnIR_ZM0XrpNPK=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Titan came to our home and installed New Lindsay windows. Our sales contact Rafe was always available and able to answer all my questions. Highly recommend if you are looking for new windows.","rating":"FIVE","review_reply":"Thank you Brooke. Enjoy those new windows","reply_update_time":"2021-06-02T21:56:25.997Z"},{"create_time":"2021-05-30T01:48:37.418Z","update_time":"2021-05-30T01:48:37.418Z","review_id":"AbFvOql38wAOpVN2SmlxoOCX7j8dAHierL4aBZWHYOII-O1QgN7yVANUKJIsWH1znofeui7xMfYL4w","reviewer_display_name":"Kristen Ward","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gh5vVeQDsPua6eTSB2yXkynnzEweE_gXxEnxM6t=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Titan did an excellent job on projects we had done around the house.  We had a new roof done in the Fall and everything was done perfectly.  From start to finish, we were extremely pleased with the entire process.  The following spring we re-hired the company to do a custom pergola and new windows.  We will continue to use them for all projects moving forward.","rating":"FIVE","review_reply":"Thank you Kristen, your house turned out amazing. Can't wait to do more projects in the future","reply_update_time":"2021-06-02T21:57:08.482Z"},{"create_time":"2021-05-17T15:49:11.293Z","update_time":"2021-05-17T15:49:11.293Z","review_id":"AbFvOqmOPu33ZjZ5-vRK_VTIQp4Qt6earPyhHd1qFOiTkU8Tv6ozk4xP1VbqnRlFNk2beXXDmPe-7g","reviewer_display_name":"Anna Sullivan","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GjkVF27A6-v5PybpfgXNBj76Z7KMWJAgNskCojZ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I can not say enough wonderful things about Titan Construction! We were in desperate need for new siding and after reaching out to Titan, we were connected with Mike Gill. He was an absolute pleasure to work with... Timely, professional and really took the time to listen to our concerns and ensure that the job was completed as soon as possible. When other companies were telling us the job would be scheduled months out, Titan was able to get our job in as soon as possible due to our circumstances. Our siding looks wonderful and it didn't break the bank. We've had many neighbors complimenting the work and asking who completed it. I would highly recommend Titan to anyone looking for new siding. Thank you so much Mike and team!!","rating":"FIVE","review_reply":"Anna, you are very welcome. It has always been a pleasure work with you. Thank you","reply_update_time":"2021-06-02T21:58:26.671Z"},{"create_time":"2021-04-23T23:45:24.805Z","update_time":"2021-04-23T23:45:24.805Z","review_id":"AbFvOqnStipjpw9eL5ACw4hy690d9O-8Z74hnK21a-aegfi7-1ZMT2TQh3HJts7Z02gUdJ5jAv295Q","reviewer_display_name":"Scott Karraker","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJy4qP2vJGKI7EnUGglPVFr7V6WBAtBtOhn76HGm=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Titan took care of putting a new roof on my home, great service and our sales contact, Rafe, took care of all our questions. Highly recommend.","rating":"FIVE","review_reply":"Scott, thank you for the 5 star review! We are glad to hear Rafe took care of you with excellent service. Thank you for choosing Titan!","reply_update_time":"2021-10-11T16:47:23.787Z"},{"create_time":"2021-04-01T20:20:49.683Z","update_time":"2021-04-01T20:20:49.683Z","review_id":"AbFvOqlNLluqxE16Ebk68uNxf7usdiqgDR5TtQsJv9x1IIJwK3UZYA8dsRtLk_bcVRdm1IzbW5J5HQ","reviewer_display_name":"Candice Stevenson","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJw0pHLeZFOcZoJfVmfl0jLigOAqlgYDVQm9JfNM=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Titan roofing is wonderful, they are on top of everything and very polite. They took care of the insurance parts for me and kept me up to date on everything. Even when we needed a new piece of siding placed on for a deck they got a hold of it and had it put on in a few days! Highly recommend them, everyone on the block has used them!","rating":"FIVE","review_reply":"Candice, thank you for your high praises! We are very happy to hear we provided you with excellent customer service, and we hope to hear from you in the future regarding any home improvement projects you may have!","reply_update_time":"2021-10-11T16:46:35.851Z"},{"create_time":"2020-12-11T22:32:52.047Z","update_time":"2020-12-11T22:32:52.047Z","review_id":"AbFvOqnJrwycfCgia8COyCnRajI7vfEBVZkDNrYm4iKKUK1tp9_0DmABHYGiiQ3EmgO5JR75-Jc7","reviewer_display_name":"Kyle Kozlowski","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GiiYOzLvqN-WFhKNz7jh4P_PJZPcNvkwQmQJoexEQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"It was a great pleasure working with Titan. I needed a new garage door for my mom's house and Titan came to the rescue! Not only did they do a superb job with the installation they also laid out a list of options with multiple styles and efficiency ratings. I went with the medium insulation garage door that was budget friendly and looks absolutely beautiful!\n\nHUGE thank you to Titan for helping me help my mom. The guys arrived on time and finished the job in only a few hours. You can tell they are very experienced. After they left it was so clean that it was like no one was even here! Overall fantastic job and I highly recommend Titan Construction Enterprises to anyone who needs work done to their home. Will definitely be reaching out when its time for a new roof, siding, and windows or maybe I will have them paint my interior next 🤔. If I could give these guys 10 stars I would!!! ⭐⭐⭐⭐⭐⭐⭐⭐⭐⭐","rating":"FIVE","review_reply":"Thank you Kyle. Its always a pleasure working with you sir.","reply_update_time":"2020-12-14T14:27:48.592Z"}]}