{"totalReviewCount":28,"review":[{"create_time":"2021-10-08T20:53:07.322Z","update_time":"2021-10-08T20:53:07.322Z","review_id":"AbFvOqlEJfCJC0evaHiV-1mGGNiwvnjMw5sc9XdSkjUCeHs5IbMTsQArxOyLOkwrT6H7y9oahUZDcg","reviewer_display_name":"Tammy Melnyk","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxJEk6v0ot0gO2Ib2rFzcbXafH1FTukbsUzvXbU=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Dr. Muradov and his team have been wonderful to work with.  I highly recommend seeing him for an alternative method or to compliment your traditional medicine approach.   He is extremely smart and thorough at finding solutions.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-07-22T18:01:30.269Z","update_time":"2021-07-22T18:01:30.269Z","review_id":"AbFvOqmUm7_vVWacyDaOLKmy4w698BMvWLgS155XiXR8D3iLNAIKi4BxOtcxlMlvv0eD-XjYp1Rqkw","reviewer_display_name":"Janice Murphy","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJx8wIX_Du3QG7eE_m73IHD5dSWv00abK2avL-58=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Dr. Kirti Deol has been super supportive of my journey with PCOS and infertility. She is very attentive to my issues of concern working with me to create a plan of action to support my body through the very strenuous process of IVF and in general management of PCOS. She is careful to not overload you with treatment plans, herbal therapeutics etc... but realistically recommends treatments to support your overall system that are manageable. She is caring and goes through every question I have had thoroughly. I would highly recommend her to anyone looking to find complimentary support through PCOS and\/or infertility\/women's health issues.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-04-25T04:37:49.342Z","update_time":"2021-04-25T04:37:49.342Z","review_id":"AbFvOqkDB1Ml7Qn16BXGHusvHyVe4r4dYw35O0itPufsGsXyxEBgLDZy8B5rkClmpgX7jZkLTVFPow","reviewer_display_name":"Samir Patel","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gg95zGrWyagkiwXrDyjVFS84q1rXlHMiArTp53eNp0=s120-c-c0x00000000-cc-rp-mo-ba4-br100","is_anonymous":null,"comment":"Very expensive to visit this place.\n\nDr Eric has good knowledge and he is good listener.\n\nA receipts not speaks clearly and keep moving and doing other thing while speaking with you. Dr Eric suggested me to buy some medicine from website, she didn't know which website I have to go. Assistance boy jumped our conversation and told me the website name. She is worsts receptionist ever meet.","rating":"TWO","review_reply":"","reply_update_time":""},{"create_time":"2021-01-07T17:58:01.731Z","update_time":"2021-01-07T17:58:01.731Z","review_id":"AbFvOql1gBAF4qQ6lXYmaBeI9MYeWyA8NrThWCUcsK_ZZ-j1_kxs2G1FP_VgjiqzMnR7GuHY7en8EA","reviewer_display_name":"MarK Horner","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzhhb7vH98wic2Cv3NxNeLHW8yphVh5-ZLMQCFR=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Dr. Nooreen Sumar has been incredibly helpful over the past year. Her expertise and attention to detail were apparent. She listened well and took everything I said into account. Without her guidance I would still be confused and suffering (traditional doctors were not help). Dr. Sumar always explained clearly what was going on and what needed to be done to move forward. I recommend her to everyone, she will not disappoint. Worth every penny!\n\nJackie at the front desk was very friendly and professional  and fostered a feeling of friendship and familiarity.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-12-31T18:58:54.320Z","update_time":"2020-12-31T18:58:54.320Z","review_id":"AbFvOqncspm0BSx1_eLffvvBGkWSsGOttG8Zh2TYvDBEZwXdRvw779D8fcLlVwSom-4huZnOHYiRJg","reviewer_display_name":"Lisa Cardinal","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxA7ciejwbBLpviGzoaKz4h7RuvxoUBTsu685ff=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I cannot believe my progress since coming to TruMed and seeing Dr. Muradov for IV glutathione\/nutrient therapy for my systemic inflammation. I have suffered for the last 8 years (I was diagnosed with fibromyalgia and was told I would never recover and I would only get sicker) and had started to rapidly deteriorate in the last 2 years. My cognitive function was getting to be at an all-time low and was on the verge of dropping out of university and closing my energy healing practice.\n\nI was on a video call with my uncle and I couldn’t help but be very distracted by how I looked during the call. I couldn’t believe it was me. I thought, “this MUST be the camera. I definitely don’t look that bad’”\n\nAfter the call, I took a photo. I actually looked that bad. While I felt horrible, I didn’t realize how significantly it was starting to show. This prompted me once again to look outside the scope of western medicine for a solution. My regular doctor has tried everything he can within the system that he can work in. He felt powerless watching me deteriorate so quickly. Anyway, after some research I found myself on the TruMed website looking at the available IV treatments.\n\nBased on what I know about the progression of my illness I knew I had to call and book in ASAP. They fit me in right away. I have to thank both Jackie and Dr. Muradov for fitting me in so quickly. They have no idea how it completely altered my life that week.\n\nI took the photo on a Sunday. I was in for my first treatment on the following Thursday. On Friday morning I got up and had a shower and looked in the mirror. I was very surprised. I couldn’t believe the difference in my face. At first I thought, “Oh this is just that thing where you think you look ok - good even and then you take a selfie and you’re like ‘OMG NO, I do NOT look as good as I thought’” So, I decided to get into the natural light and take a picture.\n\nI could not believe it. I looked 15 years younger. I felt better than I had in ages! I saw my dr the next day on Saturday and he was giddy when he saw the difference from the week before. He couldn’t believe it either!\n\nNow, my doctor sees me a couple of days after each treatment. He wants to monitor this closely. He is very excited at my progress in only a few weeks. I am so grateful for the thoughtful care I receive at TruMed and as much as I continue to temper my hope, I am often overcome with emotion when I think of how far I have come in three weeks. I went from failing four out of five classes to an average GPA this semester of 3.1 - all improvements made in my last week of classes with assignments and my final exams the week after. Having access to my brain again and seeing improvements every day in my ability to problem solve, short term memory and being able to commit things to long term memory, logic and reason, emotion regulation, to name a few - and being able to be hungry and EAT and feel thirst again has been amazing 💕 Thanks again Dr. Muradov and the awesome staff there for helping me to change my life. I have hope that I will be healthy again!\n\nHere are three photos I took (I am 46 years old) - the first three days before my first treatment, the second was the morning after my first treatment, and the third was the evening after my second treatment a week later. This span between these photos is 14 days. No makeup applied or filters on the camera. All were from my selfie camera on my cellphone.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-12-22T00:32:38.975Z","update_time":"2020-12-22T00:32:38.975Z","review_id":"AbFvOqnTwH5pqNnRQKpqXhnDUDCwIF8-6q6AB1sFKthpbHimNoHSAvEqQCc0CCkoIcAKWUOQleIy4g","reviewer_display_name":"E Hofmann","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GifhwW6nbjvtFF9ynUWz4HDbN2MOJemrmIMqKxL67g=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Highly recommend the services of Dr. Muradov! I have endured a chronic issue after a surgery well over five years ago --- after only one appointment and about a week of follow through, I started to have a huge change.  Actually LIFE CHANGING for me.  I wish I used a naturopath sooner because my surgeon sure wasn't a help afterwards.  I am continuing to work on other issues too and look forward to continuous positive results.\n\nThe clinic is easy to access, plenty of parking and I feel the fees are more than reasonable.  A portion was covered by my insurance.  If you have been considering seeing a naturopath, check out Dr. Muradov.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-12-12T20:39:34.373Z","update_time":"2020-12-12T20:39:34.373Z","review_id":"AbFvOql55roTqzyn4-bXdUnLbh7zg950uLachrB0iMthNboX_rXjr8MFEkjQglDYdV_CBj_AdRMBJg","reviewer_display_name":"marcela gomez vargas","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzTLIe455beCyzT-qACss_8XhZsePKHYkFxlhlL=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Bloodwork prices were ridiculous. Ended up paying upwards of $500, never received my results nor was contacted for follow up. Seriously disappointed...","rating":"ONE","review_reply":"","reply_update_time":""},{"create_time":"2020-12-03T19:00:37.839Z","update_time":"2020-12-03T19:00:37.839Z","review_id":"AbFvOql5L-BXxtw9IbH-1QNRe5wFIcDpVnvQfpL3kgmp6Au_C4mHAZpg4uq6lsMkL4HCN5M_5rovnA","reviewer_display_name":"Matt Weir","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxZIeyEXJAtOOmEWQT9qou_VWioQxgrZ1xMKsjI=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Been attending this clinic for a few months now. Always found the service to be professional and catered to my individual need. Dr. Muradov is very compassionate and always asks questions to ensure he understands the root cause of the issue. Would highly recommend for anyone not getting the result they are looking for via traditional healthcare practices","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-12-02T21:57:26.307Z","update_time":"2020-12-02T21:57:26.307Z","review_id":"AbFvOqkayEw647RHc6RqEjU4PrtSO3AAx9TYG19OGD7xP7M9qIWCqeMvPrwdEmeV2a9A2tuBJ57O","reviewer_display_name":"Rache Bishop","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzFq2EsECBCTPZN7GfW6GJrIlfc2To9mtSBH4Cx=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"This place will rip you off and only care about money, not your well-being or health. The owner is a fake and has not even truly studied naturopathy.","rating":"ONE","review_reply":"","reply_update_time":""},{"create_time":"2020-11-25T03:04:50.014Z","update_time":"2020-11-25T03:04:50.014Z","review_id":"AbFvOqlJNBMtIt7015JFmsK95OLyJLdZMq9xqXGl7sAQq_buCDl0rxwE4V41YYIp29k_qCrUeH53","reviewer_display_name":"Grace Lee","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJz4JpG_x7spDgf0SjduLzEqqye8qg_UAiSap9Zo=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Great clinic to get glutathione and vitamin c iv done. The staff have made the experience very simple and straightforward. I read another review saying that the receptionist was rude, but I think she's the type to get straight to the point...I personally love that lol","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-11-10T14:12:37.509Z","update_time":"2020-11-10T14:12:37.509Z","review_id":"AbFvOqncPkjtvlj6CC5gM3jlZpWZMql3IRIg6lkUQ2fNuiQ3AAKP3mr5_zsm_qTeDr9nXtaxVPsg8w","reviewer_display_name":"April Plourde","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gh9Sc7yrjAUrAdfvnG4hjSG_CfRZSfftrnomxRYog=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"Receptionist was quite rude, I did not enjoy speaking with her at all. The doctor on the other hand was nice and knowledgeable, but you better be rich to come here long term. The prices they charge for just blood work is ridiculous and they wouldn't let me get my blood work requested by my family doctor so it would be free (covered under Alberta health). $250 for blood work I can get done for free is crazy. I would have continued coming there if they were more affordable.","rating":"THREE","review_reply":"","reply_update_time":""},{"create_time":"2019-12-06T15:59:15.165Z","update_time":"2019-12-06T15:59:15.165Z","review_id":"AbFvOqlOoVXIfEdELRBZds8mIJR9cZJ0KT9xLljdDapO8mTfx7Zohi9xjWghloh2agznfE0OxGqM","reviewer_display_name":"Carlee Metchewais","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GjcQ2f6PjpOnRChAqE4kfuqhwXeEIeUYn6oy6whFg=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"I came to Dr. Murodov because I wanted to enter myself into a fitness competition but I knew how hard they could be on your body. I wanted to make sure my hormones and health were where they needed to be, first. Dr. Murodov took the time for my particular situation, with zero judgment, and recommended supplements after I did the hormone panel test. I am so glad I came to Dr. Murodov, I truly think the supplements helped make my rigorous training and diet routine for the competition much more attainable and I know my health after the competition was in a better place then it would have been if I didn't.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-10-30T04:08:41.564Z","update_time":"2019-10-30T04:08:41.564Z","review_id":"AbFvOqnF9FO3ON0v31LMfWthIdzkUYgNkp1Anui3oY4AvY5TFEyrE8TMDgWf_ApCtBS8N9pbW3_q6g","reviewer_display_name":"Janine Meldau","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJw_bBMsdE123fCWaywFcgejPv2xR7PBmeEJkVRC=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Great experience getting IV Therapy.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-10-16T22:35:36.485Z","update_time":"2019-10-16T22:35:36.485Z","review_id":"AbFvOqlfI9Si0GdNCn6TsF_u46yyZIVFsy9Zksdb1EkuSDDmyr-KVfp6iZsNDULa4uxo1hGalUrtBw","reviewer_display_name":"Thomas Bennett","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgAnpbFDugNfPXi0qoWR_OZqSaF5xed_WYJKP6OMA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Successfully treated an issue that was stumping traditional medicine avenues.  Highly recommend!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-10-14T23:22:24.926Z","update_time":"2019-10-14T23:22:24.926Z","review_id":"AbFvOqkiye9Ar2pk-fot8zsiPpx082rc27tC_QEPE-SAADyA_maXDq92SvOa2igQjZmQeVFy87xtlQ","reviewer_display_name":"Sylvia Thompson","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJw01Lo5BCovWsjY3dMr1lysDGiqIW_JDqI5jMFt=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I came here 1 and a half years ago to get help with a problem I've been having for 20 years. I had went to several doctors and specialists but I just keep getting sicker.It turned out I was allergic to server things plus to much histamine in my body plus a thyroid problem.I have been just tired out for so go ,I forgot what it’s like not to be tired.Now I can keep my eyes opened all day and feel fabulous.So after I went here for a couple month I ask if they had did any treatments on cirrhosis of the liver, and they said they had. I took my husband there right away, because he just sat in his chair all day long sleeping, didn’t do anything around the house. Dr. Eric put him a a iv therapy and he’s the man a married 48 years ago.   We go there every month for I V’s and we finally have our Quality of life back, thanks to Dr.Eric and his lovely right hand lady Jackie.The clinic is so welcoming and comfortable you feel like your in your own home.If you want to get you quality of life back, so you can enjoy life again, call the clinic right away.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-09-28T00:10:37.907Z","update_time":"2019-09-28T00:10:37.907Z","review_id":"AbFvOqm3_acga28z1PliHa9VeJYih8O8kNb1qTbHOGP_7jmFOG5EisEi9ecYekxhAkVSUJ1fSNn01w","reviewer_display_name":"Jason Lee","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwd4jUPGvY6jWgk-U07gGqaq-lIn_CTbHr7ckwI=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I am totally blown away by the amazing compassion, patience, and knowledge Dr. Eric Muradov and staff display every visit towards myself, and multiple other family, relatives, and friends I have referred to his clinic (and will continually refer). He gets it. How to treat disease, and how to \"treat\" patients.. because he is a patient himself and knows the other side. His approach is very balanced, reasonable, and effective. Absolutely the best ND I have had the pleasure to take me as a patient!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-09-05T20:54:56.441Z","update_time":"2019-09-05T20:54:56.441Z","review_id":"AbFvOqm3Boage7v382b7V6DbevHWZzFNREv1JvBonpKm_QMwP-mlSY8eJ-RIEaVWq2xtmweS8ht_bQ","reviewer_display_name":"Mary Traikovski Hampson","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhnKONfs-ZSnMvBFlE6cJsMtRpHudlWxFQCuKq8=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Dr Muradov is very knowledgeable and genuinely concerned about you. He takes his time to listen and then comes up with a detailed treatment plan that will work.   I would highly recommend Dr. Muradov and his staff!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-08-19T17:02:06.555Z","update_time":"2019-08-19T17:02:06.555Z","review_id":"AbFvOqlB6u4XiTO4m6udEd_NQZQ1qht0EXHu235Xi5ZL1a4tcQ0bAed-v16W18iyLIVrS6CpjP5amg","reviewer_display_name":"Nicole Di Rocco","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJx6hOSi-sd_8_VCzNKSXnMHLDeTi3Bxg8Daii8L=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I am only 34 And i have been tuning out my body in order to get through the days for decades. Traditional medicine was unable to help me beyond numbing my pain with pills failing to address the root of the problem. Eric gave me hope and relief are after suffering with chronic pain, fatigue and severe stomach issues got most of my life. I honestly thought I would have to live with the pain everyday for the rest of life. Now I have hope for a better life and future free of chronic pain. I am deeply grateful to have found help and would strong recommend TruMed to anyone who desires improved wholistic health.\n-Nicole Di Rocco","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-08-16T16:35:42.481Z","update_time":"2019-08-16T16:35:42.481Z","review_id":"AbFvOql4cmNGeQkha9A_S9PeZf61GWUgKlXfV3w3m-XxbrTsJi7fX6hWKSdQHONC2hT4iAV3vZ5uyg","reviewer_display_name":"Dana Tartal","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxGbbpniFy66vtShzqvBAXe9gb_1dzIc8mIws_w=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Dr. Deol has changed my life. In less than six months of working with her, she has helped me heal from over eight years of severe fatigue and a suite of other issues. My energy level is better than it has ever been since becoming a mother over a decade ago, and my kids comment that I'm more calm, present, engaged and fun than they can ever remember. My energy is back, the brain fog is gone, my persistent allergy symptoms have disappeared, my digestive issues are solved, I haven't had a migraine in 5 months, my mood is balanced, my long, heavy cycles are short and light now, and I don't need time to recover after a busy day\/week.\n\nAfter years of my MDs brushing off my health issues, and my exhaustive search for solutions, I am so grateful to have found Dr. Deol. She is deeply knowledgable in women's health, and is caring, friendly, and really, truly listens. She explains her approach, test results and treatments. She is always punctual and I never feel rushed. I can't recommend her enough!\n\nI am now bringing my children (ages 7 and 10) to see Dr. Deol for their chronic health issues as well. My son's persistent environmental allergy symptoms and his digestive complaints are gone. My daughter's allergy symptoms and chronic asthma cough have also resolved, and her digestive issues and asthma flare-ups issues are well-managed now and we are working towards resolution. It's clear to me she specializes in pediatric care, she has an amazing bedside manner with my kids and they enjoy seeing her (especially because they feel so much better now!). Thank you Dr. Deol! :)","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-08-06T00:04:41.132Z","update_time":"2019-08-06T00:04:41.132Z","review_id":"AbFvOqlAbtsiwPIwoEaGrp36GSXmn_CnDcwarYyJh_lyvkTPN_zvn4tSeTJ1gm78r9qYbmY_rvnl","reviewer_display_name":"Laura Levy","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxv1bPzC1KQRf2TZe4O5CVP6603aX-gPcaLKg6r=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Only had 2 visits and I feel amazing! Dr. Muradov is very knowledgeable and easy to talk to.  I have to say that Jackie is awesome as well.  Would highly recommend this clinic!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-01-08T22:25:31.778Z","update_time":"2019-01-08T22:25:31.778Z","review_id":"AbFvOqnFCVt_HIVGL_8--0BpGiQ6xHl9cOZ7R58airGv_VRI7mH2wiMugchBSxGdICQrHUtp_tQ_ZQ","reviewer_display_name":"Jeremy Mah","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GivsMWZ6zm6wed6LhohOlxzS6Rb1Ft8J9EyWYDXTg=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Dr. Kirti Deol is incredible at what she does. She truly cares and actively listens. Highly recommended.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-08-22T05:23:50.566Z","update_time":"2018-08-22T05:23:50.566Z","review_id":"AbFvOqnb-zNqGqsF26_wPEhpShawuwpanTr0TzRLNvVv-raLKkPbaI-6ZDBZ33FV5iNbwLRkJelifA","reviewer_display_name":"Maria Barbu","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyI2ALfNNm3psACrvGxOd2mO22yAUCiCx7bDnT_=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"Amazing, knowledgeable team who always goes above & beyond in treating their patients. Felt welcomed, understood and cared about. Highly recommend their services!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-06-11T18:41:30.294Z","update_time":"2018-06-11T18:41:30.294Z","review_id":"AbFvOqlh6XIxmUU-1Umq09B2dRt8ZTFFX5mlXN9a-DvAjZA5GG3nozgvcFeYeGY_pioprPOFcxXxAw","reviewer_display_name":"Faye Wyatt","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gipmvi6nSeB-1LxZd_Ajfb3nzfSwEXJzDWPRPq5ig=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I have had a wonderful experience with Dr. Muradov and his team. I really appreciate that Dr. Muradov takes the time to really listen to you and doesn't dismiss your symptoms and concerns as I have found with other doctors in the past. He is very kind and respectful, and for the first time in 6 years I feel well after following his recommended treatment plan. For anyone suffering with thyroid related issues I would go and see Dr. Muradov, he is an excellent Dr!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-05-25T04:51:41.279Z","update_time":"2018-05-25T04:51:41.279Z","review_id":"AbFvOqkidoMQVYvNRZx0HW_niCy1M8gQSMsEzfxW3FdwZZzb2k5LU2ze0BZxwbOH5yKOhS_t2zz1TQ","reviewer_display_name":"Emilie Bourbeau","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gjc--2Kv5TcEbg6JEgRoJmONtZbQ93Pn2r2OdiO8A=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"Amazing and friendly! I was not doing good mentally and physically for the last several months. I booked an appointment with Dr. Eric and explained my situation. He took time to listen to me. He shared his knowledge and expertise with me. He explained everything that he will be doing to try to solve my health issues. It has been over 4 months now and I can finally enjoy life again. I am truly thankful. I followed his plan and today I am here to share with you what Dr. Eric has done for me. I also have to add that the front staff is Amazing! Always making you feel welcome and at ease. Thank you guys!!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-05-24T15:46:40.008Z","update_time":"2018-05-24T15:46:40.008Z","review_id":"AbFvOqmQm3xWa1GMovypHZnhZCkQQnTb145ODAtje-x_180WXBVZrT_7jV9Vk0XPbYOrszXIJ5H2","reviewer_display_name":"Karmin Skromeda","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzH5tJRzEybfimDgEuXRqu79QZ919eug9NPpA-_=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Dr. Kirti was amazing.   I was a little nervous seeing a naturopathic doctor but she knew her stuff and informed more on my issues than my Family Physician ever did.  I couldn't recommend her enough!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-04-26T02:50:55.396Z","update_time":"2018-04-26T02:50:55.396Z","review_id":"AbFvOqk3rXa5Sf8QK4sqjUSIVScXVNWLE6J5cQ-lE_BG0toZKZgQvxLw4-BUKPwS7jursgaJ8JDsJQ","reviewer_display_name":"jolene cowan","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GjmBgSeo3fKkEaS5RAsHCe_mPaMkJUzI6y7IyU4eQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"It has been a very positive experience working with Dr. Muradov and his team. He has lots of time to hear my concerns and I have noticed a increase in my energy level. I would recommend him and his team to anyone. Thanks!!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-03-05T17:31:36.235Z","update_time":"2018-03-05T17:31:36.235Z","review_id":"AbFvOqkm2xPGoFTD4F_A-o31kEryodL7VuHNgm0AZ0bS6ZWVUmRoXeWIuDN4pg8z9ha9UtiyDnly","reviewer_display_name":"Danielle Holland","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxzjeDf1ljmcjaT6fRhAQoygz9fKC93SHACA8cY=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Jackie and Dr. Muradov are nothing short of amazing. My partner and I are both patients and have had multiple positive experiences. Dr. Muradov is knowledgeable, caring and insightful. We highly recommend this clinic!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-03-04T03:50:35.469Z","update_time":"2018-03-04T03:50:35.469Z","review_id":"AbFvOqkp0OVVvA7vN97bFXY1S6nbB7-DusengaPknE8vvPVcQfYSZPW5XZ-4O7_RmtYnFQbPNeXxXg","reviewer_display_name":"M G","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GiybmcXHy42Pq244FunlWQNG5SrVZvkgJ6w8ZFx=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Dr. Muradov is amazing! I was recommended to him by my wife because I was finding myself very tired half way through a normal day. Dr. Muradov had some blood work done and found my B12 was low as well and some other essential minerals. After my first treatment I was feeling like my old self again!\n\nHighly recommend TruMed Clinic!","rating":"FIVE","review_reply":"","reply_update_time":""}]}