{"totalReviewCount":24,"review":[{"create_time":"2022-02-26T20:49:55.409Z","update_time":"2022-02-26T20:49:55.409Z","review_id":"AbFvOql-p_K5Q4Rscu92CtqxJsrq0-zdvZKiH3mQzdc9k-xJEZ7HMZ8uJLI6QhgK6BrSjZJ20A_-vQ","reviewer_display_name":"Jeremy Wion","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Ggs4rszblHHv9Yfj4HyXgA0eLA-BHbLSvtcsaCA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Klein came and fixed our severe water problem in our basement. They did the best work we've ever seen. They were very hard working and our basement has never looked so good. They deserve more than five stars. We have never been happier.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-12-10T18:07:33.907Z","update_time":"2021-12-10T18:07:33.907Z","review_id":"AbFvOqmcsENMahfjAAjIuBlaq9Ts2_4cqY1xgKGlod3TRAhUDCTohn0-vh0itOJ0evl7WMuBmojgvw","reviewer_display_name":"Patti Larson","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwD7_ws8gwN816qz_yxI8xCMoL4fBkiY-99p89H=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Klein Home Solutions did a great job on my basement waterproofing project.  Zach and the guys were awesome - so professional, polite and friendly.  They came and were done when they said they would.  I would definitely recommend to anyone to hire Klein Home Solutions for waterproofing their basement.  They have a life time warranty, which is awesome.  My basement looks good and I don't need to worry anymore when it rains.   Patti Larson","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-12-03T19:55:25.446Z","update_time":"2021-12-03T19:55:25.446Z","review_id":"AbFvOqk5CAPeyBr05AAogR3hjuPWxx_wNt7tWRCHIJFqWIpTl_ZTHtMq5pSHwk2dbBN1vR6Use9MTw","reviewer_display_name":"Stacy Phillips","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwCiOJ0s7-brwLNrvEQdFuIkciSUBGjVaKYRRlQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Klein's recently completed work in my crawl space. I couldn't be more pleased with how professional and knowledgeable their workers were. The owner, Doug, also stopped out each day. Work was completed to the highest standard! I have already started working with them for additional projects in the spring due to how responsive and detail oriented they are.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-11-17T12:02:43.046Z","update_time":"2021-11-17T12:02:43.046Z","review_id":"AbFvOql0FJM3VfVm4zTz9KLUOKhTrfTU50U50Ih8nRViykUjgubyaTiyPXxxuDEwh__vSeDzoSF6","reviewer_display_name":"Lyndsey Torok","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhOsuiGAtDv4fjIP2NOwSOgwo8gvJBbFK3PB69i=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Absolutely stellar work and customer service! Klein just finished my basement and the workers were meticulous! Careful and communicative. And the owner stopped by to check on progress daily. So pleased to be able to rest assured that my new home and old basement won’t ever give me more water issues. Thank you so much!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-11-02T12:59:47.107Z","update_time":"2021-11-02T12:59:47.107Z","review_id":"AbFvOqkH5ob3e7XsHHC2knMXC9MmZcmuxCzvW7Zri9XW3L2vTQ5t3fF3nIZarheUhf9EG3GjfBV9","reviewer_display_name":"Bob Jenks","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzpptsxYaMh8OYD1bUhEljaR0XOvz2h5tNvrvon=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Another outstanding job from Klein Home systems!  My wife and i couldn't be more pleased.   After installing our basement system (please see 1st review)   Klein's crew installed a new basement door and completely rebuilt and reinforced our side retaining wall.   They even came up with a drain system that connected to our existing  catch drainage.   A job well done.\n\nWe trust Zach, Gary and Ben for our home needs and wont hesitate to call on future projects as well.   If you want peace of mind for your home improvements. Call Klein!!!!!!!1","rating":"FIVE","review_reply":"Bob, thanks so much for another great review, we truly appreciate it!","reply_update_time":"2021-11-09T17:27:02.095Z"},{"create_time":"2021-09-24T15:05:17.770Z","update_time":"2021-09-24T15:05:17.770Z","review_id":"AbFvOqk08bbhSs8lfl7LtFeTfUdagrDtA5YpaywkbFAQJaG7YdZmrSPWsSZNLUQo2Tm9G7yZRCD1","reviewer_display_name":"Donna Blessing","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhXx9YhiaBPNjyACVgZ1CzhXP5KFB_iLTW5Te2-GLQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Thank you for work we are extremely pleased with.","rating":"FIVE","review_reply":"Donna, it was a pleasure working for you. Thank you for the business and the great review!","reply_update_time":"2021-11-09T17:28:23.573Z"},{"create_time":"2021-08-27T14:59:13.125Z","update_time":"2021-08-27T14:59:13.125Z","review_id":"AbFvOqnUqd3cglrMW00-gJAeUE9ML9hGr64_BjH8e_AlpbXqqbLO0Pw3aRtWlOsKa4cUVuoDUZ0m","reviewer_display_name":"Tarun Latwal","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyznQ6jJtAxEJUomKRiTjSi-MKIVbon3296Q7Hf=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"Thanks for the review!","reply_update_time":"2021-11-09T17:28:41.675Z"},{"create_time":"2021-07-28T15:22:00.739Z","update_time":"2021-07-28T15:22:00.739Z","review_id":"AbFvOqleQ7F8L60MVQ3CmoorqGe5L5LZvH9mWFuLs0Qa6Y-mCzpaoDsGITsSkdt-Pvyu-sXRx70bog","reviewer_display_name":"Diane Schrader","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzZa2Q7uWIiC1ubdC_VLKxfdUyLuthz_c8XDn7Q=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"When you have water in your basement it's never a good thing, but from start to finish Klein's team was exceptional. Fast, hard working guys that got the job done! I couldn't have been happier with them. From my initial call with Brian to the workers, Zach's crew was awesome! They took a bad situation and turned it into a pleasant experience! Thank you so much for all your hard work and getting it taken care of so fast!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-07-20T15:08:17.242Z","update_time":"2021-07-20T15:08:17.242Z","review_id":"AbFvOqmM4C7V2Lzd9WZfO6DsLjnJIiKNXyvEVdrK4JBJDxK7YLppd2Jwpp6ka1HYmB5xJJFCzbwr","reviewer_display_name":"Lorraine Melms","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJx-jYa56V-P2vae1Ln_wXwhNGD2_7lwP1dN811upA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Klein painted and remodeled my basement.  What was an old, ugly outdated area is now a finished rec room and the unfinished part had the floor and walls painted.  Brian there salesman is excellent to work with and Austin the contractor was very knowledgeable and professional.  Klein is so easy to work with.  I give them 5 stars and beyond.  Call them today if you are looking to remodel.    They also did my Kitchen 2 years ago.  Perfect.","rating":"FIVE","review_reply":"Lorraine, you were wonderful to work for. Thank you for hiring our company to reface your kitchen cabinets and update your basement.","reply_update_time":"2021-11-09T17:34:19.600Z"},{"create_time":"2021-07-13T16:27:44.084Z","update_time":"2021-07-13T16:27:44.084Z","review_id":"AbFvOqmdwLr8ftQfP2WyqTjAVTUKVtbnSh9mxQD1YCDdDqf59_4TT1mCQxLNhIquYP-JBCFEWily","reviewer_display_name":"Bob Jenks","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJy0sgtYfKmthj70DQAxOrLvthmWRa5a9kVw-_VH=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"My wife and I wanted to address an ongoing water situation in our basement. We normally get a few quotes before we commit to extensive home improvement work.   We called Klein Basement Systems first.    Brian (sales manager) quickly came over for a request for quote.    Needless to say,  we looked no further.    Brian was very knowledgeable,  friendly and gave his best effort  for an affordable quote and solution that address our needs.\n\nKleins crew led by Zach,  were professional,  punctual and  most of all friendly.   They take great pride in their work.   They explained the job from beginning to end and made sure that all our questions were covered.   We were so glad that they worked on the project!\n\nDoug (owner) even came over a few times to follow up and ensured we were pleased with their craftsmanship.\n\nMy wife Kathy and I  highly recommend  Klein Basement Systems for outstanding service!  Look no further and call them today!\n\nBob and Kathy Jenks\nErie, Pa.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-06-24T22:59:16.994Z","update_time":"2021-06-24T22:59:16.994Z","review_id":"AbFvOqlXbWNa6gsW6D7pE5OOp9p_vJSCATAkwcVuf9Fqpi9mToUniWs3JVUHF9u4w0PKnHs2tmJy7A","reviewer_display_name":"Paula Frey","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyEA8061LXpAwA9hHY-jlQjXghs6dXQZyYo6MGF=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Jim did an excellent job reglazing tub, putting up surround around the tub, window and heating vent.  He was very professional and showed up on time.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-02-11T22:26:08.797Z","update_time":"2021-02-11T22:26:08.797Z","review_id":"AbFvOqmkJFzej79kQOlSwL27Bhbt6CjD0pjvPvCOho9bzZtxbEdoDfQv4JDrVJUR5twXGbV4KAnGbw","reviewer_display_name":"Bob Hammar","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwJ2_SesXGQ3taOzoDwMaiXJxII6B0Ves0K1tsQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Personable, knowledgeable and helpful.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-12-17T17:41:29.533Z","update_time":"2020-12-17T17:41:29.533Z","review_id":"AbFvOqlRx_MKUyx-YHhMcYrFkmIjNX2Z3Ge0DQXl5Cvw1emP448LEVHNxRm0nl9PH-NGfN3Zxq4UvA","reviewer_display_name":"Carrie Johnson","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJy5umFSJM4G9nBzsgq6Mw_rJ9Avq6CMXbuN1XUN=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Jim & Brad from Klein did excellent work replacing our shower pan with stone to match the existing tile work. They were professional, punctual, and left the work area very clean. They exceeded our expectations. I highly recommend Klein (in particular Jim & Brad) for any home projects.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-09-24T23:52:09.411Z","update_time":"2020-09-24T23:52:09.411Z","review_id":"AbFvOqnZ-10Yjw3kev2yk3YK2y8APhI_TxlkodJTcwtToJTLciY8qJAhBX_9vorueZJ93qbXAKEFFw","reviewer_display_name":"Sulo Suba Show","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgvAIzDPR_iwMTlSl7bR4bK04h6FU6tY_TZpyGw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"There works are very professional. I had my wet backyard. They installed french pipes all over my backyard. Now there is no wet anymore. My kids can play and enjoy at the backyard with no worries of wet. They also installed the white panels all around my basement which looks so bright and good. They also installed new sum pumps of 3 years manufactured warranty and new dehumidifier of 5 years of manufactured warranty. They also performed others miscellaneous repairing works. They did my work on June 15th 2020 and they took only 4 days to complete all assigned works. It is been 3 months and so far I am satisfied with their works. I will highly recommend Klein Home Solution.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-03-20T17:09:45.219Z","update_time":"2020-03-20T17:09:45.219Z","review_id":"AbFvOqks_e5qI1jSpcWbrXyFzeUI4L1Je5s8SPQoTF8SY5BRkQymNM_PbfzcHHjKxUMxuYahmbGa","reviewer_display_name":"Richard Moore","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhNKFy3xUoK8xXgeK4maWrjn9iHx7xlGZaInw9d=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"What an outstanding experience.  I contacted Klein Home Solutions at the Builders Association Home Expo about dampness in my basement.  Two days later Brian was at my house accessing my needs and giving me a quote.  The dehumidifier was ordered that day and installed days after delivery to the Store.  Jason and Willy did an outstanding job!  They arrived on time, introduced themselves, and proceeded to properly install the dehumidifier.  All cords and tubing were cleanly secured and the equipment wiped down.  Jason insured everything was operating and reviewed the systems with me.  Then they proceeded to install a replacement sump pump with the save professionalism as the was presented during the installation of the dehumidifier.  Pam from the office called the next day to secure payment.  She was very polite and professional also.  Overall, I am extremely happy with Klein Home Systems and highly recommend them.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-02-17T01:59:07.953Z","update_time":"2020-02-17T01:59:07.953Z","review_id":"AbFvOqk_hXNDqyU0gPx7BXVUa-zZTiLIWrjhThL-yDxIvX8fDwE4U_gdgxHeb1ew0UYMvGdTKUHayQ","reviewer_display_name":"Wendy Robertson","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxHSWaWg3yv1Ey26G6w6zSTOxwqF8FKWkkXcj6o=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Klein has done multiple jobs for me. I always call Klein when I have a bath or basement  problem that needs taken care of. The crews are always curtious and know how to get the job done and done right.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-11-01T22:38:47.731Z","update_time":"2019-11-01T22:38:47.731Z","review_id":"AbFvOqnZsrSC0yNM_uCfMw7Hi12GHKLyOW1KZCON6CY2ZYaA4dM9J6aR9XPLALb2VF6kQ-8NYJZm","reviewer_display_name":"Mary Ellen Magoc","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gi0UcSS9aDnevLuihHyMZjE3N-IGwpQzJ8FfhBI1Nc=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"Klein Bath and Basement completely transformed our 1970s-style master bathroom. They devised a creative solution to hide the plumbing along a wall, giving us a lovely corner shelf that extends up behind our new vanity sink and cabinet unit — creating a nice area for bathroom essentials and houseplants. Their expert carpenter and drywall team gutted the entire bathroom and then installed first-rate drywall, a new walk-in shower with Swanstone tile-pattern walls and sliding glass doors, vinyl flooring, wood molding\/casing, and overhead lighting — and then finished it all off with a perfect paint job.  Neat, professional, and personable, the Klein team cleaned up at day’s end throughout the project.\n\nWe absolutely LOVE our new, modern bathroom and can’t thank Doug Klein enough for the personal oversight of his team as they completed the remodeling job.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-06-17T20:38:37.431Z","update_time":"2019-06-17T20:38:37.431Z","review_id":"AbFvOqn_eYGpt4-GcK6FSYa0W3X36uNZyS9vCWboETz3LsN1qnBnCOhWDK2pt6xHzUwKIhbp00zC7Q","reviewer_display_name":"Wayne Mccartney","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwN--fmV_LhBn-mZH1rBRrwgQ1F7tPyfO-fXqWf=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"We recently had Kleins waterproof our wet basement.   Soon after we had 2 inches of rain on top of saturated ground from previous rain.   Our basement remained completely dry.   The salesman thoroughly explained what needed to be done.  The technicians also explained everything and did an excellent job.  After completion they cleaned the worksite.  Everyone we dealt with was very professional. Their price was competitive with other contractors.  Glad we chose them and would not hesitate to recommend them to others.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-03-21T15:36:00.214Z","update_time":"2019-03-21T15:36:00.214Z","review_id":"AbFvOqky2dTuqBYTb5e6YG35V-XtFR5xc9nob-1JAZ4L2Xef2GuycQPSQFEHrwPtIpDAV1OZ8Fqr","reviewer_display_name":"Felicia Hardy","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyrygGoAVWmOvw5RpoT6n10Q8z2c1JWxqyIgDFP=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"We heard a few positive reviews via word of mouth about Klein’s, but mainly from people who had work completed by them 10 years or more ago. We had them come in to install a new bath and shower and it was a disaster. They completed the work in 1 day, but unfortunately I was not able to be at the house and be present. When we got home we got to see:\n-that they installed the wrong color tub.\n-damaged the walls and the cabinets in the bathroom (from carrying the tub and acrylic for the walls) and did not repair anything, let alone say anything about it or even leave a note.\n-did not put anything down on the stairs so they were filthy.\n-they cut everything for size in our living room instead of doing it outside and didn’t clean anything up so it was littered with cut acrylic and dirt.\n-they installed the water pipe leading up to the shower head crooked so we got about 50% water pressure.\nWe explained this to the business owner, and he got ultra defensive about it with us. He had little sympathy and told us that if we wanted it fixed it would cost more money and it wouldn’t be able to take place for at least 6 weeks due to them needing to work at one of the local universities. That that was their priority as they had a big dormitory project going on with them.\nThen the icing on the cake was when a few days later the first floor ceiling started leaking because the contractors that Klein’s uses (oh, they say they have their own staff, but this is a lie as the business owner confirmed that they hire private contractors to do the work) didn’t tighten the intake pipe properly resulting in a major leak that damaged the ceiling and cabinets in our kitchen. The contractor at least came out to fix the leak, but we were on the hook for the ceiling repair.\n\nGood luck if you hire these guys, you have been warned.","rating":"ONE","review_reply":"","reply_update_time":""},{"create_time":"2019-03-12T22:33:45.306Z","update_time":"2019-03-12T22:33:45.306Z","review_id":"AbFvOqmZ69U6AYg2wAI4JES_F3KsrMpKH0QmkYj3fSqFpaiAgX0ILuID9fuwoNfcs0G3aox6RzCXrg","reviewer_display_name":"Pam Nolan","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GiJ66tga2OwdlS_Q3jflmtSTSRMPG3pVwGm59hIaZ8=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Call Klein first!\n\nWe had work done by another company that used scare tactics to sell us a water management system that we didn't need and that didn't fix our original problem. Plus they tore up our finished basement!\n\nBrian from Klein Basement Systems came out and assessed our problem. HE WAS HONEST WITH ME. He offered a couple of solutions, but in the end he suggested a way we could just hire a contractor to re-finish the walls the other company had torn up. He even described how that could be done to protect our basement from water, even though Klein doesn't do that kind of work.\n\nHe really knows his stuff about basement water and construction.\n\nI wish I had called Klein Basement Systems to begin with!!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-03-11T20:16:34.837Z","update_time":"2019-03-11T20:16:34.837Z","review_id":"AbFvOqlhHmrJwpSd_mYDguIe9PA0OPUBHFLJhZlOrbS9rLVHU6ydN4u3MlsFGCHY_Ce7kGYNFl8uHA","reviewer_display_name":"Theresa","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GicOSKdVSrePMQeZng3mblZcn2AwVVJEjTSbKka=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"They do not give free quotes as thier website states. Was told it would cost $75 to give me an estimate on a new French drain in the basement. No one else charges for estimaes. Seems off to me.","rating":"ONE","review_reply":"Theresa,\nWe're sorry you feel that way, there must have been a misunderstanding. We offer free estimates to all homeowners. Please contact our office with any questions or concerns. 814-456-5605","reply_update_time":"2021-07-29T14:02:04.889Z"},{"create_time":"2018-10-25T20:18:41.356Z","update_time":"2018-10-25T20:18:41.356Z","review_id":"AbFvOqkGgOw_iX4kedvfyGOxjgay38ajg8Sw5NCsZLyvWRTsM-os2jTKjXezoqxT4TJe0coQruzCAw","reviewer_display_name":"Dick Grieshaber","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxDNEzIHN4Iv-wizOT_Eisj_5qVXOPp_AFB2I4F=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-04-18T20:01:52.995Z","update_time":"2018-04-18T20:01:52.995Z","review_id":"AbFvOqntZ3haBHmgpjwjzPYyKDT0EdwzA25t9qMYvlvdyUqyQ15kvGFipS-hnMAEbX7W7PdyM38Ohg","reviewer_display_name":"B. Myers","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzqpW3fMA5AML1Bc7c79qASwWRFSf0JCV96TmKc=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Fantastic work, great crew, hard working in keeping worksite clean, not tracking debris.  Well organized from start to finish.  Very impressed with work, not an easy job for sure.  Thanks guys, great job.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-11-20T09:20:08.022Z","update_time":"2017-11-20T09:20:08.022Z","review_id":"AbFvOqm2VvolUHkH2hke55LE5h826IGXh3NbC9i_TzNNL99S3u6aCFhuSElFnJGKFbbCqu5YpBxaug","reviewer_display_name":"Jason Myers","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhZUS0vqR1KBTkbPek0NjjWHYyyt5c9KgRaGN8xsQ=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"We use Klein to fix some water problems. And after many heavy rains we have had zero problems.","rating":"FIVE","review_reply":"","reply_update_time":""}]}