{"totalReviewCount":8,"review":[{"create_time":"2022-07-27T10:35:47.250257Z","update_time":"2022-07-27T10:38:15.534173Z","review_id":"AbFvOqlJPedvVkte6-aHuZV0_oaXLmfZ6vDMGPH_MScCcBAwJ0d3FoHoJdEIwCdLA0NJ56gya4GJ","reviewer_display_name":"Jonny Sage","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnVdFyqwtLV9DZk-xUv4ISdrpARlsxVoJ_vD2VY=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"It was an amazing experience.  All the staff where just brilliant.  So professional and caring and so hard working. I can't explain the gratitude I feel. It's been a life saver. 😌","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-01-12T20:35:57.609764Z","update_time":"2021-01-12T20:35:57.609764Z","review_id":"AbFvOqk8JC2O1m36BpyXQz2jS6JCNQ1UT0CnD67pP0fx2oAEdvXcjY8P2sXuIz6GvTJOFYC-p5GtUg","reviewer_display_name":"Karen Hayes","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmn7ZomsFoF3SbylqzyFAvEWTYC5SB0RsYOKVj0=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"This facility didn’t offer the swim, gym, equine animal therapy that was offered in the brochure that was sent to me.  The pictures of the rooms didn’t show the toilet positioned next to the bed.  No 1:1 therapy had been offered by the second day.  There was nowhere to go to be quiet ie no garden.  It felt more like a prison than the pleasant facility portrayed in the brochure.  I wouldn’t recommend this place to anybody.","rating":"ONE","review_reply":"","reply_update_time":""},{"create_time":"2020-11-08T15:57:30.901020Z","update_time":"2020-11-08T15:57:30.901020Z","review_id":"AbFvOqn1dMn9mr4dHfKDOx-fnJS0nmUfE4F0HqiOIjZBFHcnxb_y8F7ETzFwB1-SD6g4KRcqHqH-Dw","reviewer_display_name":"Emma Murray","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnPsJ1oBz-0-in53aecwV1Dh9_5BW2Gg3uvD6ex=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-03-09T11:54:29.127899Z","update_time":"2020-03-09T11:54:29.127899Z","review_id":"AbFvOqmADjFmnjJGRQ-nCbfo4STQGjY5takI9DZnR4MwJWaOJ2RNkwJnIHN0P7EI5XwdSLiQz2Do","reviewer_display_name":"Heidi Tanner","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucre96geV0TW2J0taafTkhz-WZbwPq6i1Ji1tTmk=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I was recommended The Chestnuts by a family friend. I was completely unaware that my alcohol consumption was getting out of hand and the last person to realise I was suffering with alcoholism, hence my life had become unmanageable, again the last person to be aware of how chaotic my lifestyle had become. When my family approached me about accepting help from professionals in a residential capacity, I was furious and in complete denial of my conditions and conduct. After lots of persuasion, I arrived at The Chestnuts, weary, upset, heavy hearted and extremely scared, the fear was the worst alongside Step 1, admitting and realising my problem was alcohol and whilst consuming alcohol I was slowly but surely damaging everyone I loved, leaving a trail of destruction wherever I went and being completely unaware of my actions. I stayed for 2 weeks, 2 weeks that have truly changed my life, my thinking, my beliefs, attitudes, behaviours and allowed me to rebuild trust, bonds, relationships and create a brilliant, bright future where my goals are all within grasp.\nToday I am 50 days of total abstinence and would never have achieved this without the amazing, sensitive, warm, caring and very knowledgeable, professional team at The Chestnuts.. this includes the wonderful, happy, bright housekeepers and chefs, Chantelle running reception who always had a smile for you and an answer to every question, she was extremely helpful. Being a resident, completing Stepss 1-3 in the 2 weeks, learning how to meditate successfully and understanding mindfulness and most importantly connecting with my Higher Power have truly been the success behind my journey without alcohol.\nI just wanted to say thank you to the team for showing me how I can find my way, be successful on my journey, handle fear and never give up.\nI have continued with my local A.A group twice weekly, tomorrow will be my 8th meeting and I am in the process of finding a sponsor so I can work through steps 5 and 6 and continue all the 12 steps over time. A.A have truly taken me into their fellowship, I look forward to meetings each week and grow stronger daily.\nIf anyone reading my review is as terrified as I was I can only say ‘Don’t Be’, take the leap and have faith in   these wonderful people that are trained to help each and everyone of us that suffers with an addiction.\nWarmest regards to all at The Chestnuts.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-01-17T21:06:00.717948Z","update_time":"2020-01-17T21:06:00.717948Z","review_id":"AbFvOqnkaP49ppROIBwdght8Y4Qy2YWeTJDViTVGBkM9_n5CZbI-Neyhtj7Tbj5dVYjCqRPXacfWeA","reviewer_display_name":"Jennifer Lee","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmQQmA06wGEzOIsEefHEwvqkXQZ6gjiFrwg8k1r=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-10-28T10:59:42.714579Z","update_time":"2019-10-28T10:59:42.714579Z","review_id":"AbFvOqkqpmZN5cVCy_upwGFJ1U_3RhuH_WD-lUxAfOorKUWnPFoq6R4XHiwCN2KvFxczSgNw31TSoQ","reviewer_display_name":"It’s Bella gacha","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucq569qJGxOixOyfc3Vna4xG4cCQdgupqWxyN5fAjA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Well where do I start. After being very apprehensive about going into treatment it was not long until I felt at home as can be expected. The rooms, whilst mine was on the smaller size was completely adequate. Generally I spent most of my time in either sessions or with the rest of the guests which is always encouraged. Weekly activities are good with gym three times a week along with visits to the bowling alley, walks and AA\/NA meetings. The meeting themselves where amazing and this was my first time, again being made to feel right at home. We additionally had a yoga session off site which was fabulous however during my 14 day stay this only happened the once sadly. The catering was good enough, all cooked fresh and plenty of it, I guarantee you wont be left hungry ever. The team at The Chestnut where all mazing, I would like to give a special mention to, Amy, Marie, Rebecca, Tina ,Sally, Debbie(both), Chantelle(pay rise plz),Pete and James, well to be honest everyone played a massive part in starting my road to recovery.  All in all a great experience,not one I would like to repeat for obvious reasons. The only reason I didn't give five stairs would be only having a single one to one session per week and some of the treatments mentioned on the website where not available due to annual leave ect. This place and the people within it changed me forever and I will not be forgetting them anytime soon. I must also mention the Saturday aftercare for past clients whom share their experiences after leaving treatment where amazing and a great help, which I look forward to attending myself from time to time.\nthanks Again\nJamie","rating":"FOUR","review_reply":"","reply_update_time":""},{"create_time":"2019-04-10T20:21:47.611432Z","update_time":"2019-04-10T20:26:21.644505Z","review_id":"AbFvOqm2oLW7SnbfqudhBHtJj_qHN2unPGQ7cIBfCt4tzUwECf20pXHtQHLhWW1ylP2KPIUbrqeGKg","reviewer_display_name":"sean spibey","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmn8BAke6AO0CcgFenJypluM0hMRF5KqWoQuRcaS=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"The care and attention of the team go above and beyond,  nothing is too much trouble for them and this shows in every member of the staff .  This positive approach cascades to all the patients creating a fantastic atmosphere I really didn't want to leave they took me from near death to living again , the food was fantastic the accommodation  was good and the other patients were brilliant company this place I highly recommend\nSean spibey","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-04-09T06:26:51.499701Z","update_time":"2019-04-09T06:33:28.037778Z","review_id":"AbFvOqmAApL0rdXlAEMjRXCoMJUzt4tJbj19BWXYYch0JLWUVZ4FyKNbQYsLbpIGkPzmYHv-nZQLpA","reviewer_display_name":"Tracey Keeling","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkHMkrcQwWZNyuHNOemTiodOvfz31hseHtCYBzA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"This is my last day at this wonderful place. After a 28 day stay I’m leaving feeling that I have my life back. Each and every member of staff are amazing. The food is the best I have ever tasted and I have made some very precious friends for life. So glad I did it. A huge thank you to everyone at Chestnuts, you have given me and my family a chance to be happy again. Tracey Keeling","rating":"FIVE","review_reply":"","reply_update_time":""}]}