{"totalReviewCount":1,"review":[{"create_time":"2021-07-17T22:56:58.732Z","update_time":"2021-07-17T22:56:58.732Z","review_id":"AbFvOqkFNSgOG3bpWgn4PUhlyoAGgPow8_YPR5kpLHIEak9aKPvCkq5dhTN72zEik9WJa14OCwUKYw","reviewer_display_name":"Frank Futie","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GjFFcTZHBy7TkF9fh_OBmKAh_lhS7209QxhRi9NIQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I brought Michael Buzinski and his team at Buzzworthy to take over my search engine optimization and manage my content marketing interests. I worked very hard on my own after some very bad experiences with other digital marketing companies, so I was very cautious about pulling the trigger. But my trust in Buzzworthy grew every time I talked with Michael. He didn’t talk “at” me and he was honest about what his firm could and couldn’t do. He also set clear expectations for my first six months of working with his company.\n\nI hired Buzzworthy in February 2021 on a six month retainer agreement, which I definitely plan on extending. Within three months of our agreement, they were doing so well I added Google AdWords management to their scope of work. I am happy to say I am glad I did.\n\nResults:\n\nBuzzworthy started producing measurable results with my SEO within 60 days of hiring them, even though Buzz (Michael’s nickname) told me it could take three to six months. He and Victoria (my main SEO point of contact) reviewed reports with me about four months into our engagement. Some of the highlights included:\n12% increase in organic search visibility\n10 new keywords in the top three\n17 new keywords in the top 10\n18 new keywords in the top 20\nI have seen a lot of erroneous numbers thrown at me in the past by marketing folks so, in general, marketing stats usually don’t excite me. But I got really excited when they started showing me which keywords they were able to bolster in the first four months. Here are a couple that stood out to me.\n“Hire a driver” with about 2400 searches a month increased 9 places from the second page to #6 on the first page.\n“Uhaul moving help” with about 8100 searches per month bumped 77 places\n“Rent a moving truck” with 135,000 searches a month bumped 12 places\nThey have also improved 6 competitive keywords I already had in the top three to number one.\n\nAbout 90 days into my dealings with Buzzworthy, I decided to hand over my Google Ads account to them to manage. Their second level effort has not disappointed. Just 45 days in and they are already showing me results:\nClick-through rate has increased 300% from averaging around 2% to over 6%\nThey reduced my cost per click 33%.\nBest of all, they reduced my cost per conversion 75% from $28.84 to $7.30 IN 45 DAYS!\n\nMy results have been wonderful, but I also want to mention that Buzz and his team are very responsive. I always get my emails and any missed calls returned fast, usually within an hour or so and always within the business day. Buzz allows me to talk directly to my main SEO person, which really shows his trust in his team and shows me that American professionals are attending to my account.\n\nI want future potential clients to know that if they have been burned in the past by digital marketers or are hesitant to relinquish control of their hard work in fear of it all falling apart, they should give Buzzworthy a shot. They do what they say they are going to do and they do it very well.","rating":"FIVE","review_reply":"","reply_update_time":""}]}