{"totalReviewCount":107,"review":[{"create_time":"2022-08-19T21:30:32.262659Z","update_time":"2022-08-19T21:30:32.262659Z","review_id":"AbFvOqkwoyGyzclhXnmefsplFMhMjgYOtP05XO7ia7nQXo0U9Na0rhPSEah4lttMPzROSeUOkD_j","reviewer_display_name":"Pharos Pacific","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmk1QfLp7nh1EHNHeO5-RYN87jzYvrRHVMpsI8jv=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Got PPF on my M4 here. Excellent service and great people working at this place 🙌\nThank you 😊","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-08-18T03:16:04.932215Z","update_time":"2022-08-18T03:16:04.932215Z","review_id":"AbFvOqlei53JAbvXuxwBYws-Qb5D4g4snfBYTlPGvKidEAQbawVwdHWGQD6NK01Pet5_6d1sUphYnw","reviewer_display_name":"Christine Freeman","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnVdB6bhOOwygb5hB788STiC-OdLD826rF2Nl6Q=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Everyone was Amazing and Professional. They did an excellent job and you can tell they take pride in their work. The wrap protects the paint and makes it easy to clean. The temperature inside the car is noticeably cooler with the ceramic window tinting.  I drive a Tesla model X and you can tell they are very comfortable and knowledgeable about what works best for this car. Highly recommend.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-08-17T23:57:29.083828Z","update_time":"2022-08-17T23:57:29.083828Z","review_id":"AbFvOqkL1yx47h75XZORjkIch2V18_ucwOtcslDuDieDbKh_uUgMRpNg8D8L3I3GL8u_AEh-g8_C","reviewer_display_name":"Kyle Nolan","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpAWRCTH2bJmmAn6qhU2z0EIqVFoZlgxTJxOh7Qkw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Amazing experience with Auri and his talented team. Very cost effective and reasonable, great communicators, honest, and exceptional at their work! Will be coming back and recommending to all who listens!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-08-11T17:15:26.450710Z","update_time":"2022-08-11T17:15:26.450710Z","review_id":"AbFvOqmPSAEavLJdD9vKgoQt5ZrOugSBO8Zj4FUAN90xOWa7zuBblyeu4_G4Vdzk8KpjRH57zNUNvQ","reviewer_display_name":"Alexey Popoff","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucouSCO6osDOU5DdcUj1K5Fefu_f7P4egvGNqMDi=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I’ll tell you that, I’ve done PPF, tint and interior protection on my M4 Comp right here and I can say that this guys is #1 in the business🙌. The way they work and communicate with you it’s 10 starts 💫💛😁 Best of luck to you guys! 🫶 Thank you 🙏","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-08-06T04:06:11.118026Z","update_time":"2022-08-06T04:09:28.392462Z","review_id":"AbFvOqmkKKESuT-JjUehfr6WwFFr-LLL6Eh3xNVh_LjXcl0yU5XBW743d72H7LLrtooQ42fBXjVP","reviewer_display_name":"Jesse Fernandez","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucq6_Eb2HE_3OqmpBqWYGbEFryfA3APs0bZV9x94qw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I would like to Personally thank all employees at Diamond Auto Salon and special thanks to Auri, Noah and Michael. We brought our car for PPV. They were very helpful walking us through all the steps and answering all of our questions. Work was completed in a timely manner and the work was top notch. We love the new look and in the future we will bring all our cars to Diamond Auto Salon. I would highly recommend Diamond Auto Salon to anyone who needs any custom work done to their car. It’s worth the drive even 100 miles away. I guarantee you won’t get this kind of service anywhere, because I shopped around and did my homework. I am glad I choose Diamond Auto Salon. Thanks again!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-08-04T06:08:40.329504Z","update_time":"2022-08-04T06:08:40.329504Z","review_id":"AbFvOqksAbFWviekj8simeCPA7zPT0ZWaztXcoPsIPejCTp6EyFXC4NK_RxdPPCo5KP-vcPpYQfODw","reviewer_display_name":"Peter Molina","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrdbPjOS-_Ytz2bfBIDciNqV886mLgHKh4AJpqigA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I have taken 3 of my and my wife's cars to Diamond Auto Salon for window tints and ceramic paint protection and they always do outstanding work and stand behind their work. I will continue to take any future cars to them. I highly recommend them if you want quality work done on your vehicles. Their services may seem more expensive, but you are paying for quality products and quality workmanship. Having taken cars to \"cheaper\" places before, you will realize that this is a case of you get what you pay for. Not all window tint film is equal.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-08-01T21:57:26.765827Z","update_time":"2022-08-01T21:57:26.765827Z","review_id":"AbFvOqkypq1xvTbz4HOXGBk50EX_5UDWNmJGKIxJcSMLTlETcfBVclu1LHJLHru8DLdyf4CPXfHwrg","reviewer_display_name":"Joel Aquino","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucru7GYjFxDEx2svL1EVedv2qFrlfvEOHV4MflFarw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"As far as I’m concerned, these are the go to guys for your auto mod needs. I’ve tried at least 4 other tint shops (and 2 other PPF shops) and by far these guys have exceeded my expectations.\n\nDealing with these guys was a complete pleasure. Aurin was patient as I asked questions regarding service and warranty. Not just him though,  the other staff was professional and very prompt in delivering my vehicle.\n\nThey tout themselves as Tesla experts and I would have to agree. I’m completely satisfied with the job they did on my Model Y and would definitely use them.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-07-29T20:08:30.188755Z","update_time":"2022-07-29T20:08:30.188755Z","review_id":"AbFvOqn_N8_9TGJ9SsAvJ4BgMH8LJs8U4M7mjEeOp1_E7dCmme_Fg7TCpTG6ZIevTxY92Ry4JBRt","reviewer_display_name":"Josh Hodeda","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmdF5wm_nDO-E5yXaiyB21nxGLAwhX43aGTwAIz=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Diamond Auto Salon nailed it! Process was silky smooth and they were a pleasure to deal with. Auri and Noah were true to their word in terms of timing and quality. I found my spot. Couldn't be happier.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-07-29T18:53:20.266941Z","update_time":"2022-07-29T18:53:20.266941Z","review_id":"AbFvOqm2D9eDkwrQtMIzk0vKgFpzefdNIjU9zZSab02QDSgxnEsyegXIIyt0dSBiHP651DHAW1jd","reviewer_display_name":"Matthew Baker","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnk_ZtHAYTNdvhEooKOBJjN6blVCfnzC5JTWboQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I recently took delivery of my Model X Plaid and learned very quickly how terrible the paint was.  After doing some research, it was a must to get Tesla’s wrapped to prevent paint chips which I received one day after driving.  I reached out to a few different places before coming across Diamond Salon. Auri Responded to me within 10 minutes of reaching out and the rest was history.  He new exactly what I needed explained the options that would work best and delivered!  They had my car for a little over a week as I had dropped off the car with yet another deep paint chip.  The wrap was perfect, the chip was fixed and the window tint was exactly what I was going for.  Highly recommend using this company if you’re looking to have the work done right.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-07-26T01:54:20.772916Z","update_time":"2022-07-26T01:54:20.772916Z","review_id":"AbFvOqnZCbEOZysbbLQi79z2tksIGKtMdgUykLSMFCzBu1IvsDTAXrGCYDjouLfagVlRPOrkIPfUEA","reviewer_display_name":"Kenny Villavicencio","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkZPssocJsZXVV9jSfwu7wpxB4m3c0dOGScD9Ym=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Called based on a referral. Auri was super helpful and knowledgeable. When I turned my car in for the service. I accidentally parked in the opposite side of the building. Someone came up to me in the parking lot pointed me in the right direction, without me even asking. Got to the front desk we went over shades we went through the parking lot and inside the business for references of different shades again super helpful and assisted me with advice ( which if I went with my own opinion would have probably regretted it) . I went with ceramic tinting, the difference and quality is No Joke nothing short of ground breaking. Thank you DAS. Will come again and will send all that ever ask.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-07-25T19:05:59.721622Z","update_time":"2022-07-25T19:05:59.721622Z","review_id":"AbFvOqmvw2dxJ78CMNnuLpDnzkDeviL6qyaJ1SAXOP1WamtTuoyiCznsc4tLGzYzPOtzofMqZaVEEg","reviewer_display_name":"Phil Yee","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlB6tL3KZcyUfRMN9TbvaUozxX2VGSvLAkgRus-=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"When I received my 2022 Tesla Model X Plaid arrival notification, I immediately searched for a shop to do Paint Protection Film and Window Tint. That's where I found Diamond Auto Salon and they are one of the highest rated companies out there. After reading the reviews, noticing all the high end cars that they do, their lifetime warranty guarantee, and despite living 40 miles away, I knew I had to bring my car there. So, I emailed the store, and Aurian promptly replied back with a detailed explanation of his services and expectations for paint protection and tinting services. They are very experienced with all Tesla's as well for some added piece of mind.\n\nThe drop off was super easy. I didn't need a rental car but they offer one which is nice. The job took 5 days in total and the results exceeded my expectations. They help correct your paint before they begin the PPF work. I ended up going with the clear film and you can't even tell it's there! They wrap around the edges in key parts and not skip out on it like my past installer who used precut sheets. The film really keeps the car shinning like new and ceramic tint for each window which helps with UV and internal heat. They scheduled me a follow up visit to ensure all parts of the film settled in as expected. Otherwise, they will touch it up.\n\nThis is high quality work with amazing service. I have no hesitations recommending Diamond Auto Salon and I look forward to brining my future cars here. You simply can't go wrong with them.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-07-25T18:41:33.418177Z","update_time":"2022-07-25T18:41:33.418177Z","review_id":"AbFvOqmlj6QJ8PbKbyVe4QB_3AjFuMS30d-Jzjjmuw_7v9m1sjA92YIqTaj2X2E4iv12Y5LkNAuVug","reviewer_display_name":"Susie Hsiung","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvml2oJ8ivexTop6vC1z7OyRVuBo1Mg2SXmxGWuPp=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Diamond Auto Salon is the best! I called Auri about getting my new Tesla Model X Plaid windows tinted. He was gave me a few options and went over each option. I ended up going with the premium ceramic tint on all my windows including the front windshield. I also wanted the front and back Tesla emblems in black and they were able to make that happen as well. Great service and they did an absolutely fantastic job!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-07-07T03:04:58.244589Z","update_time":"2022-07-07T03:07:02.479721Z","review_id":"AbFvOqmBl0RCF_piFd-a1tEsb1vJB-e9EI7hBVoCyjA1FcggRNvdbrbtnQ-AQbG-hv124hikKIvH","reviewer_display_name":"Carlo","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucoGOQVwFAKGWo4JUEAjqQuSvm-NEZDWspN3AB2eHn4=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"As soon as I received my 2022 Telsa Model Y Performance, I took my car to Diamond Auto Salon in Westlake Village and got the full car STEK Dynomatt PPF, STEK Nex 35% tints on all sides including the back window, 45% roof glass, 70% windshield and matt black Tesla \"T\"s. I can't tell you how happy I am how my car turned out. STEK Dynomatt turned out so nice, specially on the grey, better than I had imagined. I have received so many compliments on the PPF and tints. I get many thumbs up at traffic lights, I even had a driver roll down their window to tell me how sweet my car looks. I already have referred many people to Diamond Auto, I even carry their business cards in my car for easy access.\n\nI recently took my wife's brand new Infiniti Q50 to Diamond to get STEK Nex window tints all the way around. She couldn't be happier.\n\nIf you're thinking about getting your car wrapped, ppf'd and\/or tinted, don't bother looking around, go straight to Diamond Auto and see Auri and Zach. You will not be disappointed!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-07-05T17:43:36.282004Z","update_time":"2022-07-05T17:43:36.282004Z","review_id":"AbFvOqn4Mk38qeyLce14BM9C7gb2fVO8I5SjasXfEesNCDBt2O9vXqcVWiSNBb72YwYcU0U0lBTbTw","reviewer_display_name":"Derek Kitagawa","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucobI7ZJMqI1aA6BBc8SNAQ9ouz05c0j9Pq5DKw3=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"We entrusted Diamond Auto Salon with our brand new 2022 GMC Yukon Denali for a complete black-out \/ chrome-delete (which is a lot of chrome!), tinting, new tires and new wheels -- and had an exceptional experience all around.  The team at Diamond are experts at what they do!  They were great partners in discussing different options and providing their creative opinions in a thoughtful (not forceful) way, e.g. helping select what to wrap with gloss vs. matte black, how to match certain parts that were being wrapped to the wheels, etc.  Perhaps most importantly, the execution was 100% flawless.  This was a complete cosmetic overhaul and a big job -- lots of individual pieces either being wrapped or removed and painted -- and no detail was unconsidered or looked over.  Highly recommend Diamond Auto Spa for what they do -- which for us, was everything we wanted!  Great to find experts that could take on all that we had in mind, vs. going to multiple different shops for wrap, tint, tires\/wheels, etc.  10\/10.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-06-26T18:55:53.624293Z","update_time":"2022-06-26T18:55:53.624293Z","review_id":"AbFvOqky7T8kV83p6-AqZyUDNA3b-2GP5P-aKmmMj2IdBAv7Xqj97MWD1kKUwkJseSVm6XAQE8YnYg","reviewer_display_name":"Colin Levenson","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnujUnc4XMcqSFe9txgu15_Qq2SF9ecZx4tHwKw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"These guys did some great work on my Tesla!! Awesome service as well!! Highly recommended and I will be coming back.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-06-02T16:47:19.763130Z","update_time":"2022-06-02T20:09:18.312632Z","review_id":"AbFvOqkQ1_x85sAU7k0SdWYhXhBSEconEbEsGnGiyvI29TE8PP-4mtw_1oFu17K3I0uiOtFtZaku8g","reviewer_display_name":"A POLO","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlrQBpXkfeKZL8PUSfrfVqSHd46Q-wcX1XaplWv=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Did a ton of homework before selecting the shop to do full PPF on a new Defender. Auri and his team went above and beyond to get me in, make sure the details were ironed out, and did a perfect job on the truck. I was so happy when they pulled it out. I looked for a shop that used STEK, and got PPF and the NEX ceramic window tint. We have another car coming this fall and Diamond already has my business. Thank you!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-06-02T01:36:29.021530Z","update_time":"2022-06-02T01:36:29.021530Z","review_id":"AbFvOqkSDVGqwmuKmXqU0IRuqO36BLlL3dr_ZNJMH-b-GCkckWLp2kTUbLe6DTNUsMO-Lz_UU0VW","reviewer_display_name":"Cary Kleinman","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucr6m8M6V5_42pOmLaGWrdnduUMklT-Cgwf4qKlv3gQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Diamond Auto Salon provided an outstanding customer experience.  After using a well-known business on the Westside for clear bra paint protection and getting below average results, I did an extensive search of businesses and came across Diamond Auto Salon.  I spoke with Ari, the business owner, and he gave me straightforward and honest advice.  He didn't try to up-sell me, and instead told me that I didn't need all the things I was asking for (ceramic coat plus clear bra).  He spent a lot of time discussing options, explaining what works and why, and accordingly he earned my business.\n\nI couldn't be happier with my decision.  After hiring Ari for my new SUV, I called a month later to advise that I won't be making my scheduled appointment because the shipment of my vehicle was delayed due to supply chain issues.  Ari worked with me every step of the way, and even after delivery of my vehicle, he let me store the car on his lot to avoid driving it unprotected back to Beverly Hills.  There may be folks who can do this job for less, but I haven't found anyone in Los Angeles who operates at this level of professionalism and integrity while also delivering a flawless result.   While I wish it was closer to me, it is well worth the long drive to Diamond Auto Salon.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-05-25T02:18:00.484336Z","update_time":"2022-05-25T04:17:27.738220Z","review_id":"AbFvOqlUnH8KQPTwVzje7joR4UVcmGvBunB_xpqD-D2tzboME1GX1ES6RzS4YYIQrkA8REPsXhsavg","reviewer_display_name":"Darren Claypool","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlIW_umJPVXyj-k8fOMkBI21Ra8BPagdItal6-6=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Zach, Noah, Auri, and the entire team at Diamond Auto Salon totally transformed my Tesla into a head turning custom ride. The level of detail and quality from (DAS) is unmatched. If you care about your vehicle as much as I do, call them now.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-05-23T21:20:46.203636Z","update_time":"2022-05-23T22:50:01.963732Z","review_id":"AbFvOql1FVSFSQHWKp2N5dHIvcMrPicWHTtoVMB_R-_2VKLSRlNYdz6gft5EkQ8zfh53L5Dfw90s","reviewer_display_name":"Roy Villanueva","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucq8aJfBuYU6n8GKTeR2qYubi-mR5xeKRfAHUWD1Tw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I have a Tesla model Y.  From start to finish, Aurian and his team are fantastic. I am still in disbelief that this is my car.   Perfection at its finest.  The care and attention to detail Aurian and his team displays is impeccable.   I got the dynotek paint protection film and the ceramic tint.   It took a total of 7 days, well worth the wait.  If you are looking around, look no more.  You found the company that will take you car to the next level.  You’re welcome.  They did such an awesome job,  im doing my Tesla model S when it arrives in September.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-04-28T19:05:16.240659Z","update_time":"2022-04-28T19:05:16.240659Z","review_id":"AbFvOql4vH4qlB8gDfQ2KYRUr7yIYfB435rrjA8HRdbGsV6FsyiQQl1AqrQc4l4T1xztKlQbufSG","reviewer_display_name":"Jen Koh","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZuco2Z5gO0WvAj8O3kyBTxyrjwvzkjbvpyv7h_PTchg=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-04-28T17:24:21.095962Z","update_time":"2022-04-28T17:24:21.095962Z","review_id":"AbFvOqlkPbDrSOrSs0RYsMRCAJGqoTY6AKvYdXLHad2FakCRsvF3vnGMe00V23ctV6wGmfSxGmot","reviewer_display_name":"Hyung Kim","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnzw9Ghp6FxvwvHbMgMiT7zGVyD6T4zi6T1dnKI=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Excellent service and professional work. Hands down, the best you can expect from auto detailing industry. I had my Aventador detailed and ceramic coated by Diamond, and it was born again at this shop. Truly amazing work. I will make sure to bring my second and future third car to Diamond. Keep up the good work, Zach and Auri.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-04-28T17:07:19.864168Z","update_time":"2022-04-28T17:19:15.195005Z","review_id":"AbFvOqktqDOCx42plWN-rG2FycVLPIQtSwMSfddmevWRNS3k31ICbLxXie0wPxrg7dU_29BhIUVLQw","reviewer_display_name":"Porter Ranch Exotics","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmwRGs-M_SoQzl1x1_5BnjyDhjkpI1PuKHLWLC5=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I recommend Diamond Auto Salon for many reasons but the most important, to me, is how they actually take the time to listen to you and learn about your vision and compliment it with their own ideas, experience and wherewithal. I personally don’t want a “yes man \/ yes ma’am” sort of automotive shop. I want a place that will share their opinions and the whys. These guys do just that and if they don’t know the answer, they find the answer. I trust them with my cars and recommend them to friends and family all the time. They do an excellent job with the wraps and paint protection but they also take really good care of your car while the car is at the shop. My latest project with them was a full body Stek Paint Protection Film and I just placed my order on new Vossen wheels for my new ride. Not so long ago I did another set of 21\/20 staggered Vossen wheels on another one of my cars along with H&R suspension upgrades and more. I lien on them for bringing my vision to life and they’ve never let me down.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-04-20T15:58:37.180523Z","update_time":"2022-04-20T15:58:37.180523Z","review_id":"AbFvOqnPcQ_AT3qdDLqOAnNNjSQlKOn2B_gvYv1olqDCoeWHqEWvC5akBXWalFjZhDeEBzB7pf6K","reviewer_display_name":"Nicholas Frangos","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucr6ua_LfLxoqrR5Q-ezqwXE2RTmq78T-WlEsZbmZA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I have zero complaints and only the highest regards for Auri and Zach and the rest of the team at Diamond Auto Salon. They fixed my car up and got it looking brand new. It is the best it looks since the day I bought about 9 years ago now.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-04-13T03:05:34.056716Z","update_time":"2022-04-13T17:26:41.039529Z","review_id":"AbFvOqmnSDQhHZfqRzXdTR9ZgoJe6jK48g2umrhsbUAowSV1pFqRKAckSZe7dWG9tp7qMsJgbKWT","reviewer_display_name":"Tim M","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmn4FL_2CPB7xBabS4PtfunBDcBJj8-8xmrp-wFt=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Highly recommended! I want to share my experience with anyone considering Diamond Auto Salon for their vehicle. Aurian, Noah and the entire crew are pros! I was extremely impressed with their expertise, the way they run their shop, and the exceptional work they do! Check out their Instagram page to see the results on a daily basis! My Range Rover had been taken by the previous owner to an inferior shop to correct paint and unfortunately it was in desperate need of a “redo” to remove swirls and other imperfections. I trust the Diamond Auto Salon crew. They performed paint correction and applied ceramic coating to protect the entire vehicle from the elements. When they were finished I was extremely happy with the results! My car was restored to factory like-new condition. I am now in the process of having the team do work on another car of mine. I recommend you check them out if you’re looking for professionals to work on your vehicle!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-03-30T02:14:01.549977Z","update_time":"2022-03-30T02:14:01.549977Z","review_id":"AbFvOql_mtHjjwkWe8OfIslHM7oDM9wQDIAtSS0set_nPsxXKh3WmtGXENGPTXpe-Yd_bQorGlPosA","reviewer_display_name":"Talia Emery","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmm2vZYIBxPbHnYUQ8GkC5q6haDOU-CWUq3FVG4V=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I went to Aurian and his team at Diamond Auto Salon only knowing that I wanted to give my 6 year-old Tesla a new, fresh look. Aurian walked me through all the possibilities and all my options, and we came up with an exciting plan for a vinyl wrap, ceramic coating, window tinting, chrome delete, and new wheels. His whole team was knowledgeable and professional throughout the process, and when they finished andI picked up my car…it was PERFECT! Just what I was looking for. I’d recommend them to anyone who wants high quality wrapping and protection services.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-03-27T18:04:30.917095Z","update_time":"2022-03-27T18:04:30.917095Z","review_id":"AbFvOqnY4NvZrChqVa89gELDguNk8t55hR_MfMxy4a_Zdv17sdERLn9CF7fkhkadRrbi2MkEoeiyVA","reviewer_display_name":"Jason Boschetti","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpKkdhBaz0AXdLAgngFspAJGpzYqgX7nC5DYXk=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Such an excellent team! Got all the windows, windshield, rooftop tinted on my new Porsche Taycan 4s and omg it looks incredible. They did a perfect job, I'm so happy. Noah and Aurian were super helpful and polite as well. They also installed a digital license plate for me, which looks soooo sick!! Wasn't planning on it but they had them displayed in their office. In & out in one day, will be taking my cars back here in the future. Thank ya'll so much.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-10-31T00:20:47.148934Z","update_time":"2022-03-24T16:34:19.817897Z","review_id":"AbFvOqmpr_7bqI6OWBSMYSfH6w9ILZvuGNQS0-3Z4ZwaQCiF9OEI9Gms6JZksSAA74EP4REJM7Xm","reviewer_display_name":"Nicholas Johanson","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmn049PMlpCyHQIuIaY7bkkm_GnPXcK2PU6vPaYS=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-03-23T17:19:30.695861Z","update_time":"2022-03-23T17:19:30.695861Z","review_id":"AbFvOqmGBKCg1CX4drVTh6p0bLWbFTXYuKhmPHmyNWuaYV2NLRO4VOKAVv2LIMRSC1kASc8hJ2vYVw","reviewer_display_name":"Ryan Edwards","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlp-dTaEijLIn6IIFUcTzUYRBcUbmBDkzydyCcP=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Great Service, Great Team and love their work. I own several cars and am new to the LA area.. I was looking for a quality team to provide paint protection and window tinting to a new vehicle.  After considering my options I chose Diamond Auto Salon!  I highly recommend this team and will be bringing other vehicles to them for wrapping, tinting and more!! Just Fantastic!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-03-22T20:32:44.854929Z","update_time":"2022-03-22T20:32:44.854929Z","review_id":"AbFvOqnYugnD0XJRKdlX_tY3a4IGcXwv2GO7AC1ObU8SgOrjFAXkt9icsnfKGOJbVj7Itnaicky2mg","reviewer_display_name":"jessie daniels","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmk-PK1CN_7Plx5YEqxSQPhouoXrz-F-9yIho98m=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"The best in the business! Only company I will let work on my car. Blacked out everything A-Z. Super prompt on timing and very reasonably priced. All around 10\/10 experience","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-03-21T20:48:48.779975Z","update_time":"2022-03-21T20:48:48.779975Z","review_id":"AbFvOqke3zj77Snj_Wfrkso2lNxujEarhxB7AYiKhUzIQwvd4onHMkhiC6Hd-TF62-URFgXIPanwuw","reviewer_display_name":"Felipe Anguiano","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpPO2sucB106NGLY8d4GsxgQW5SOb4BwG19qiNR=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Purchased a brand new 2022 Corvette and was looking to get major modifications done however with anything was very skeptical as to where to take my car. I wanted to ensure wherever I went they would take good care of my car as I waited almost a year for delivery. While doing research I found Diamond Auto Salon online and spoke to Auri and immediately felt comfortable. He provided various suggestions I liked this not only reassured me of their excellent customer service but also of their knowledge and experience. If you are looking for modifications this is the place to go to they did the following:\n-Full body satin paint protection film\n-Vossen Wheels\n-Michelin Tires\n-Ceramic Coated Wheels\n-Ceramic Window Tint all around including windshield\n-Gloss Black Roof Wrap\n-Reviver Electronic License Plates\n-installation of front splitter, spoiler and side skirts also with paint protection film as well.\n\nThroughout the entire process they stayed in contact with me and provided pictures and updates every step of the way. Upon my pick up date I was blown away at how Diamond Auto Salon transformed my car exceeding my expectations. Loved the service so much my sister will be dropping off her car as well. Diamond Auto Salon has gained a lifetime customer!\n-","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-03-19T02:18:11.450808Z","update_time":"2022-03-19T02:18:11.450808Z","review_id":"AbFvOqmFVyjtJsRzZbFli3qUlyWYkVSutoCmlqaDjhZM1Kzgi_un-ebYYMkb1EMiRJyjnyIEXuCW-Q","reviewer_display_name":"Yeghia Nercessian","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpZd5pk60y82j24c5q0aBqQhY2ErJfPSvYSsSOW=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Literally the greatest body shop experience. The owner himself Aurian responded to my yelp inquiry 10 minutes after I sent it at like 12 at night! They will take good care of you, answer all your questions and give you good pricing as well. I got paint protection film for my challenger and they recommended stek which later after research found out was the best ppf option especially vs xpel which was my original choice. These guys give you good advice and take care of you. I felt like a real valued customer. After getting the car back today they did an amazing job and I have no complaints.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-03-19T00:54:22.960499Z","update_time":"2022-03-19T00:54:22.960499Z","review_id":"AbFvOqlEBut9DQTmka98onEiWdzHxs2dqBQxTCkJYbUj5Y8MGtLyvZXs9EdDkZColD-nCtD6nVPy8Q","reviewer_display_name":"Drew Jayhan","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlcgb4wDnxVeppfthWAhSJ1fBzRw062s6jYNBC1=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Great service and competitive prices.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-03-18T16:38:01.054893Z","update_time":"2022-03-18T16:38:01.054893Z","review_id":"AbFvOqnf6hiAB0k-tiQ3cmfLYF3b4b-VI1sX5sFnN0ISaO6MFwXe_E79hy2duGVxNDgF9WNPDixm","reviewer_display_name":"wilson trieu","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkI41Rg8cjyAWjE1md4APwUIV8RlMV1SddiDT3G=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-03-17T19:54:57.833865Z","update_time":"2022-03-17T19:54:57.833865Z","review_id":"AbFvOqngbSL1gMs3Sy2C_gnSFQA8O8ybYJmQb5mgEZe_RgSQd-0yr7EVzz8PWuf7hmiVe0sY-nparQ","reviewer_display_name":"Marcos Suriel","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnKLnEZJdKhlPo_-2Ipt2IKsuxLv9_eA2_10A-4=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"All I have to say is that these guys are the very best in their craft. I was blown away by their Instagram pictures of the many cars they have worked on.\n\nI was even more blown away when I saw my own 2021 Tesla Model Y completely wrapped and calipers painted. Totally different looking and gorgeous car.\n\nI got rid of my Tesla recently and got a new 2022 BMW 430i Gran Coupe. I took it to Diamond Auto Salon for installation of window tints. Best tint job I've ever had in any of my cars!\n\nThese guys are the best in the business, very friendly and professional. They even gave me a brand new BMW loaner for the week while they were working on my car.\n\nSimply the best. They earned a lifetime customer.\n\nThank you Diamond Auto Salon","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-03-16T23:01:33.431834Z","update_time":"2022-03-16T23:01:33.431834Z","review_id":"AbFvOqmFWFy3MKS4MB2rC7uVkwmA3q3Xonrk0adt7yIeC9WnZnWB-VVowerdJRvalVS8233GE1Zg-g","reviewer_display_name":"Stephen Oduntan","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucqGkXvQNRm6YxygKqiVhiJ-sFqlYXty22kc6a2H=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I just wanted to give a huge personal thank you to Noah, Zack, Auri, and everyone at Diamond Auto Salon for giving my vehicle renewed life. You guys are incredibly genuine and passionate about your work. I brought you a Black Audi A5, and you took it to the next level. I love the new color: satin metallic black rock grey with ceramic-infused windows. The Vossen 20-inch hf-5 wheels and red calipers blend perfectly with the Reviver digital license plates. Fantastic! Thanks again guys. I am thrilled with the result.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-02-09T22:33:15.816574Z","update_time":"2022-03-09T22:46:20.911842Z","review_id":"AbFvOqltcV95Z8AMsx5cIlKBG3XK7nq0CNT6mQjGSStiJwrC0nkNgd7vMZLDYpewFwOdFIUDvzkXlw","reviewer_display_name":"Wesley Boatman","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlFP-51y20RrG4-FmjECwKYPv1N2lOhFJIr--FT=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Great place! Super friendly and professional. Got the ceramic PPF on my Tesla Model 3 looks amazing.\n\nHad an issue with my tint (was a manufacturer issue, not Diamond Auto Salon). They took care of it immediately! Appreciate you them greatly!\n\nThank you!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-12-03T07:49:20.136418Z","update_time":"2022-03-08T03:59:49.166876Z","review_id":"AbFvOqnASOuqF54rkY1yK7icdcOArCgl8xj9i1Ze8M7zSmNTZiPTbHbRgwRmHNwM6qXkzMFZGsA_","reviewer_display_name":"Jonathan Navarro","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucoAuURQ_2ALfJaSakYVhH81-Mz1rXGV2D_6nTIGWlE=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"They will scratch your vehicle then make false promises. My new car was not scratched when i took it, clearly those marks were left by a knife, and they did admit it. You guys agreed it was your mistake. I didn’t want a full refund and never asked for one and (I have proof because i saved the messages) you promised me 300 dollars back, but didn’t get a penny back, just lies from your part, avoid this place at all cost. Its not really worth it.","rating":"ONE","review_reply":"Jonathan, it is unfortunate that we have to come across clients who constantly take advantage of a situation in order to get a full refund. Our team did not scratch your used vehicle. We performed a paint protection film installation on your vehicles painted red surfaces. We walked around the vehicle during drop off and mentioned your vehicles black plastic trims have swirls & scratches (every gloss black vehicle trim tends to swirl up from car washes) and you approved to continue the work. Once completed, you tried to blame scratches in the same spot on us to get a full refund... This is unfair and we will not allow it. Several days later I was able to request new parts from BMW to replace these trims under warranty for you as a courtesy. I got the trims for you and set up an appointment to replace them FREE OF CHARGE to you. You responded \"No I want a refund and I will handle it myself. You guys can't touch my car again. I am paying BMW $1800 to repair it next week.”\n\nFor our audience, the piece he is talking about is a gloss black trim that sits next to the fog lights of a vehicle. Aka, a $120 part from BMW we were willing to pay and replace without admitting fault to make him happy.\n\nIn the end, the client negotiated himself from a full refund to $300 after realizing the part will never cost so much to replace and he inflated it to “$1800” as that was the exact cost of his protection film install. Clients like this are only out for one thing and that is to get free or discounted work, not solve the issue. We are a professional business and if something were to happen to a vehicle under our roof, we will replace and fix it no questions asked! If scratching vehicles were our normal practice, we would not be a highly rated 5 star business! We will not tolerate doing a service and being demanded money back for things that can be solved in under 10 minutes. A warranty is in place for such reasons and ours is LIFETIME as we pride ourselves behind quality service and constant customer support like all our REAL reviews mention.","reply_update_time":"2022-03-01T18:26:22.892339Z"},{"create_time":"2022-03-07T23:51:51.102611Z","update_time":"2022-03-07T23:51:51.102611Z","review_id":"AbFvOqkYSs-ka-QBqpG_YQTKhcrUwkPiMJn1Dd1EywA3owD6bDoljv4mecP-WQmj73T2_TQJ2cuC","reviewer_display_name":"Andres Barahona","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnSkUuaWwyUrhMJ8fdCuRFpGt0Pn_75Gg5FpdEN=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"EXELENT SERVICE!\nMy car looks like brand new one after a 3 stage color correction, wheels powder coating, caliper restoration and interior protection. They always on time and exceed all my expectation!\nalmost forget they provide a luxury loan with out extra cost","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-03-06T03:40:59.988616Z","update_time":"2022-03-06T03:40:59.988616Z","review_id":"AbFvOqlIqqQHTBswWvTVqo6LqEAt6EOoqe4CseAXMUeYWsvr8fYD83UFPaKXB7mem3zyE4XVj-ivfA","reviewer_display_name":"Maximilian Walter","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrOMVl8hnHIi5TgxuTTe_4ypYznUXWp_wfVq6cdKg=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Don’t even bother shopping around.\n\nWhen you go in for surgery, do you care more about getting a discount or getting the best? You only wrap your car once (hopefully), so don’t shop for a discount job: shop for the BEST job. And, needless to say, DAS is the best.\n\nFrom the get-go communication with Auri is absolutely incredible. He is reachable 24\/7 and gets back to you QUICKLY. A consultation with him is professional and he lays out the prices up front. With a 12-month payment plan with 0% interest, even the most expensive jobs are financially doable.\n\nI just got my Land Rover Velar wrapped in Auri’s recommended black wrap, my windows and windshield tinted, and RPlate (digital license plate) put on - and it’s all flawless.\n\nThe guys at the shop were all very courteous and always professional. They even re-did a section because they could see a small area where Auri could see my paint showing - this is the attention to detail I was hoping for.\n\nI would go back to DAS again and again. If you live in the Ventura County \/ Los Angeles County area, this is your place to go.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-03-04T17:31:47.147873Z","update_time":"2022-03-04T17:53:57.690274Z","review_id":"AbFvOqmoiguffNR27thg-KkzzPj4Ls055JVJaR8BuU9cRt9Ra3N88-3jdOre3DrpwFF6E_yUehMR","reviewer_display_name":"Carlos Gomez","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrzrbMveVYId6vZxmOJ5mYGVtS6MboEanENui7M=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I have a 2022 x7 m50i and got my whole vehicle wrapped in vinyl. Rims powder coated and also got my diffuser painted to match my trim. Cleared bra some of the piano black finished trim to protect from scratching.Great service, great turnover time and the best work ive seen to date. Highly recommend these guys","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-03-01T06:01:43.891968Z","update_time":"2022-03-01T06:01:43.891968Z","review_id":"AbFvOqnH2g8HgZwA2vouPafGdC5HwnqG6tjlCNDtqqVrmDlnh5lqA79z7BOWmSjYxGvwkbI9ML8M7A","reviewer_display_name":"kyle valero","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmM_atSU0ebAIO_zwuifzQv21YwfN8GMd1QYgUS=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Spoke with Auri and Zach and immediately knew  they were the ones for the job. Even Noah and the whole team made the process easy from start to finish. They put their own personal touch on it and the car came out exactly how I wanted. Full wrap, ceramic coating,vossen wheels, full tint, etc. they even gave me a dope loaner for 2 weeks! Give them a call. Hands down the best!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-02-26T19:38:22.113581Z","update_time":"2022-02-26T19:38:22.113581Z","review_id":"AbFvOqk5ENCrHl36K8hLjP6JaLvxLxT7XGI73xf9Urbo-C0HTtqV0Xx2lBPL35o0TIPiXAp1LcKU","reviewer_display_name":"Joseph Daniels","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmBZH_sXTy6PjkMODuzFn2cg1RqtoM-NPkXrOcC=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"When it comes to trusting someone with your car these are your guys. Ari , Zach and the team have been helping me for years and there is not a single other shop I would trust. Impeccable work that they stand by. Thanks guys!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-02-24T21:29:14.432173Z","update_time":"2022-02-24T21:29:14.432173Z","review_id":"AbFvOqmjNQTDb3VZ1ncJ4Ip-2-Tpc-V0yZq_Z3YstYQZgbi0m31hdGtez2cEbnnq0Aoxm25j9rpV9Q","reviewer_display_name":"Rick Cabral","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrh_w9DKHkgaWuaSUacz9ZmD05-cYbpdFQjs9q6=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I have used Diamond Auto Salon on 5 of my cars, from window tinting to total black out and custom wheels. Simply put, they do a perfect job every time!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-02-22T14:19:55.884304Z","update_time":"2022-02-22T14:22:25.381141Z","review_id":"AbFvOqnKjd-elOCyV9_uXugMufOk3mYZbbsF8rY2q7OPwN7EtBo7a0ZomDYrGVASMFsEnH48vlJFHA","reviewer_display_name":"Kathleen Mallory","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucr1weisf8Qb7pyqnQiZUCLB5njbmVCi1iTu6oRzZ_U=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Auri and his team were wonderful.  Had PPF applied to by 2022 Tesla 3.  Responsiveness was great, follow up and check in after service performed was also timely and professional. Business went out their way to make sure that I was happy and work performed exactly as expected. Will definitely use again","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-02-20T21:37:30.054248Z","update_time":"2022-02-20T21:51:05.033122Z","review_id":"AbFvOqlWF7I_W2-bkvfFmNJWJ8wIAp06WOHOSg0KaF-nK2k8AOH8pkO6fWHLcF2Apf3AI27gG2OZ","reviewer_display_name":"Ortiz Jesus","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlfH3bQKIqB7KV5wSUwbSrmbgln9zxxD_noKOn8=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"100 percent satisfied with their service and 100 percent recommended to friends, family, and anyone looking for expertise, great quality work and service. Their precision and high detail shows through their quality work. These guys are very attentive to detail and make sure their clients are satisfied no matter what type of work or vehicle they are working with. Hats off to Diamond Auto Salon team!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-02-20T02:46:35.819277Z","update_time":"2022-02-20T02:46:35.819277Z","review_id":"AbFvOqmcXGqRCJBedWu2lgZy806Ctgjl-i3h0PEmT4ElPv-mpvMEatVLsb7_qptZTp2D8ube6jTUFg","reviewer_display_name":"Krishna Kuppa","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpQMUDXTYU14TbxbSB3BwQyeAaZQQCGShmhf6nP2w=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I had Paint Protection Film (PPF), Ceramic window tinting, custom Tesla logo's in red and digital license plate done on my brand new 2022 Tesla Model-S. Auri, Noah and team are simply outstanding at their craft and have great understanding of PPF & tinting. Auri is super responsive to all the queries and is very friendly to interact with. This shop cares about the details of the work done on the vehicle... they go above and beyond to ensure the quality of work is great. We noticed a small wrinkle in the windshield film and Auri said that is not acceptable and redid that film installation for perfection. I am very impressed by their approach... Auri and team are awesome!!!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-02-19T23:36:20.625128Z","update_time":"2022-02-19T23:37:13.640355Z","review_id":"AbFvOqnydISd1Uw4STYcXlA1oH5p9gTnXxll41zxquqOe7FVOY2SAfzpUAKaPmvFftN2O4yoPnal1A","reviewer_display_name":"Kyle Vincent","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpA0D6JGhDJhNihqdnVwv9ggQyDQXaxlgEiNnEv=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Had a 10\/10 experience at Diamond Auto Salon, dropped off my 2018 M3 for a Paint correction, Full car PPF, and ceramic tints all the way around. Cannot even express how happy I am with the outcome. Car looks brand new off of the showroom floor!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-02-17T06:24:26.804513Z","update_time":"2022-02-17T06:28:30.262548Z","review_id":"AbFvOqnMQCv3Z0lpV3Pdm7nZzQ8nZT_-v-cr7EkQJwYKBhzahoPuQ1sgfAFVNiYuM0xe8hKX8kC6CQ","reviewer_display_name":"Caleb League","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmylFdpmkPiwIR9k-EXD343QvB4J2CwjQhsrUZR=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Absolutely amazing work and incredibly professional! The work they did was flawless and I have received several compliments in how the car turned out. I will definitely come back to them in the future!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-02-16T06:44:23.792092Z","update_time":"2022-02-16T06:44:23.792092Z","review_id":"AbFvOqldS5WRk5BDIMUKQ8-c1dtcp9YIP2tgY7CoSg9uzbApczGEG_5bf39s6kobKEzMskLBE8eNQg","reviewer_display_name":"Eric Bollar","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrnsPuxgPfm0tXv4-uQ9v-qX4_R4-IzTzmfyq9wzXE=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I had Paint Protection film (PPF) as well as wheels and tires added to my 2015 Tesla Model S which was all done by the great staff at Diamond Auto Salon. They are simply outstanding at what they do. Auri, Zack and staff are very friendly and most of all care about you and your vehicle and the quality of work they put into it. I am so impressed how my vehicle turned out. I have gotten so many compliments of how good my car looks and everybody wants to know “where did you get the work done “ And I probably tell them Diamond Auto Salon. You guys are simply awesome!!!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-02-15T23:05:31.154439Z","update_time":"2022-02-15T23:05:31.154439Z","review_id":"AbFvOql6j41wDA72fdV-LsmjZ-sJkNelgokGR6sWSQZjfEgBNyL2zqHMrP7siTcgjGmIYu8YqU0-","reviewer_display_name":"Sean Mcdermott.LA","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnkeQO6pTn6n5EgEdXZ6BBKdo2qMH0vxH8BTKin=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"This is the second time I have used Diamond auto salon and they do such quality work. We did window tinting, blackout kit and painted trim and wheels. It turned out better then we could have imagined. Will continue to use them for all our future cars.","rating":"FIVE","review_reply":"","reply_update_time":""}]}