{"totalReviewCount":4,"review":[{"create_time":"2022-04-29T02:33:13.102323Z","update_time":"2022-04-29T02:36:13.085133Z","review_id":"AbFvOqlHZ9f2EYW3V0h8shYldAFKzKVtTQovh7_2uN84OxIAQLf7NlkmMXonFgDYwunWP-L6Cya-","reviewer_display_name":"Katie Gaide","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucotJvBrRQcELielwByDMCT-5mMhdavBGcL4ynbHwA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Traction Dog Training’s help and advice has been invaluable in leash training our highly energetic German shorthaired pointers. Our walks used to consist of me being pulled through the neighborhood and ending up with a sore back. Working with Will has helped me gain control of the dogs on our walks, and now I can even go for runs with them (mostly) by my side, not out in front pulling. Highly recommend their training approach!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-04-14T01:53:21.108115Z","update_time":"2022-04-14T01:53:21.108115Z","review_id":"AbFvOqkuKIqrneWMjYgjmasTl8X_Uomm_ArjybFM3-4SaOV95IK6azIy3AQmNvwlZnflV2gG-zBI","reviewer_display_name":"Kensie Benoit","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucqA-PQ1PciOEjl44YAa0Il-X-CyihKGZd92xoMYpA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"We can't say enough great things about Will and Traction Dog Training! We took our rescue pup, Gus, to Will, and we are so glad we did. We went from being scared to take Gus in public due to his fear-based aggression to then having the confidence to do anything with him.\n\nWe see a night-and-day difference from when we dropped Gus off. And we are so grateful for the tips Will shared with us. We will continue implementing these tips at home to maintain Gus's forward progress!","rating":"FIVE","review_reply":"Fear based aggression can be the most difficult behavior for trainers to address.  We love sending Will into those situations - he's the guy for the job! Thank you for the review. :-)","reply_update_time":"2022-04-17T16:00:03.279579Z"},{"create_time":"2022-04-14T01:40:25.286314Z","update_time":"2022-04-14T01:40:25.286314Z","review_id":"AbFvOqkb7gmxGjrQWjy7CrXjvD55CcxBfPmgsl-3DGlVnjT_avguPpi1HgNgLobF7Uh5Ni85qSaS9w","reviewer_display_name":"Caroline Coggins","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZuconiAfJoNwXkJgiLZfxnIvJrayDfgFAV3Iv_5x_gQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Highly recommend Traction Dog Training Club! One of the trainers, Will, did an excellent job with my 6 year old pitbull mix, Marley. I let Will know that Marley had severe aggression towards other dogs, he had a lot of energy and didn’t listen to commands, and overall needed more obedience. With his many years of experience working with dogs, Will was the perfect person to help with these concerns. He was optimistic from the very beginning, and was fully confident he could help with Marley’s needs. Will trained Marley for a couple of weeks and I truly feel like I have a different dog now! His overall love for dogs was very apparent in the way he interacted with him and the techniques he worked on with Marley were practical and easy to maintain outside of training. If you are looking for a dog trainer, I highly recommend Will with Traction Dog Training Club!","rating":"FIVE","review_reply":"Thanks for the great review, Caroline! Will can truly transform aggressive, reactive, and disobedient dogs into happy, healthy team mates!","reply_update_time":"2022-04-17T15:59:00.074834Z"},{"create_time":"2022-03-31T00:36:43.803931Z","update_time":"2022-03-31T00:36:43.803931Z","review_id":"AbFvOqny8w7kdSwVpCYFkib7BiOMEf53PrmYGynwXZVsjZhZ6lVqvPZyiDFWxMzhaj1TXcIYn5Tcig","reviewer_display_name":"Jordan Henry (Welcome2m0es)","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZuco6n7cGpre564uTypqB8vo2eD6Ko1bTAFB_Nsf7-g=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I have family in Colorado who trained their dogs through Traction, so I signed up as soon as I saw they were in Texas. My 6 year old Lab, even in his middle age, pulled his leash and didn’t come when called even for his favorite treats if there was any level of distraction. Mara did a Homeschool program for us and by the end had Jax heeling on and off leash, coming when called even at the dog park, and he learned a bunch of useful tools we didn’t even know we were lacking. We are so glad Traction came to Texas!!!!","rating":"FIVE","review_reply":"Thanks Jordan - we love Jax, and we are happy to be in TX too!","reply_update_time":"2022-03-31T01:00:45.957150Z"}]}