{"totalReviewCount":10,"review":[{"create_time":"2022-08-17T18:03:45.630917Z","update_time":"2022-08-17T18:03:45.630917Z","review_id":"AbFvOqmfImeUYr3vjvA4dGtwGTP9ps1HCq3T8DZ8hYfE0bD8_IcpNDBy4BIXbb_pF5eTx_oF-LiRkg","reviewer_display_name":"Julian Exposito Bader","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkpQDu1c29Ig_pHEXdahuu24jYnS8MpSLRuX4nJ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"From the moment we step a foot in the centre, we felt so welcomed. There was classic music in the background, aromatherapy scent, comfy sofa,\nplenty of dog toys around and things for them to explore! I was amazed how Camacho, who usually gets nervous in a new environment and barks at stranger, was so happy and relaxed throughout the assessment. We just couldn't believe it!\n\nAntonella’s knowledge is impressive and her way of explaining everything in such a clear way made it so easy for us to follow her advice.\n\nThe whole experience was just so enjoyable and professional! Thank you Simon and Antonella!","rating":"FIVE","review_reply":"Thanks Julian for such a lovely review! It was a pleasure to meet you and being able to help you with Camacho.","reply_update_time":"2022-08-19T09:46:44.465243Z"},{"create_time":"2022-08-17T08:44:17.440169Z","update_time":"2022-08-17T08:44:17.440169Z","review_id":"AbFvOqkfOPBYfXZIjV96tqNiN-FAIbE2UWC_u42prTBA4vzfQn_iHy8vBpB8FLcA4CIcI3wyXZvMCg","reviewer_display_name":"Sharon Bierer","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmliQmTRNcI-snn-rieMd4AynDaF6EmAdWxIv3tp=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Very happy with the information we learnt during our two sessions. Rectified some misconceptions we had, taught us different ways of dealing with our dogs and we feel much more confident now.  Recommended.","rating":"FIVE","review_reply":"Thank you Sharon! I’m pleased I was able to help you and your two beautiful dogs.","reply_update_time":"2022-08-19T09:49:23.560716Z"},{"create_time":"2022-08-03T13:40:21.703482Z","update_time":"2022-08-03T13:40:21.703482Z","review_id":"AbFvOqnGsAnEq4u5pEHurF-J7_k_6VhhFUeAtZ2bs9jvRzkRQGjIHzD-qd9Bp0jiAcweim8IJdEFkw","reviewer_display_name":"Tara PJ","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlka5m_R003sR7gCZOAfFA1X8ziZzZ_b5f7wHx2Wg=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I had an extremely valuable consultation with Antonella regarding my anxious rescue. She equipped me with great knowledge on the root causes of problems and how to manage these. I would definitely recommend this to anyone who is struggling with their dogs behaviour","rating":"FIVE","review_reply":"Thanks Tara for such a sweet review. I’m so glad that you found the assessment helpful. Bodhi is such a lovely dog!","reply_update_time":"2022-08-03T20:13:12.663661Z"},{"create_time":"2022-07-23T17:36:15.876922Z","update_time":"2022-07-23T17:52:50.411916Z","review_id":"AbFvOqkvcw0br-Yf33qQrQQgDgy8njOHnHxQkXJIvLEtOQyhtInAmTkqqxzhMUFO3rEQ-wgO7Q0SJQ","reviewer_display_name":"Cece F","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZuconKNLjPp2NAm6MBmemRdi-5wYBrsWCDhDMXNdX=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I was so excited to find a center had opened up close to us! Antonella is a brilliant, caring, very skilled trainer and behaviourist! Simon has been brilliant with comms and support during our puppy class! I have my cockapoo puppy enrolled in her puppy classes which have been so great for my little Milo! We are also working on the dynamic between my 18 month old Dog and the new puppy and I am learning so much! Antonella has a wealth of knowledge and just simply knows her stuff! After our assessment I was able to go home and apply some of what we had discussed pre starting the behaviour training sessions- just from this, there has been a massive improvement in 24h. i have also sent her a friend who is also very happy with how well her training has been going with her reactive maltipoo. The center is also beautiful and so clean! It is full of engaging areas. Just brilliant. thank you for all your help with us!! We always look forward to our sessions with  you!!","rating":"FIVE","review_reply":"Thank you so much Cece for such a lovely review! Can’t wait to see you guys again 🐶","reply_update_time":"2022-07-23T18:37:00.525515Z"},{"create_time":"2022-07-16T07:37:27.902910Z","update_time":"2022-07-16T07:37:27.902910Z","review_id":"AbFvOqkxJTIssgbbzaE-nEEAKtB22fDssNlGf67GUnoAWvtJCfVLXY0zuUB11DHmjWI8kzs86NrCzw","reviewer_display_name":"Duncan Chorley","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucoFrToHAB4-0YfGaJDIMFzZ7bB7SvE4C6oM_Qxybw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Before I bought my English Bulldog (Sir Michael Rocket!), Antonella advised me that even though cannot walk your new puppy outside for two weeks, I should carry him around introducing him to everything you want him to become comfortable with including buses and noisy traffic, children, crowds etc which turned out to be invaluable advice.  Antonella is pictured here training my dog with recall in Battersea Park.\n\nSir Michael is now 7, and Antonella in her wonderful new premises is teaching him to leave me alone when we dine (I used to feed him scraps and cannot break this learned-behaviour without help!). We are having success.\n\nI am thankful for and highly recommend the Animal Wellbeing Centre under Antonella's direction.","rating":"FIVE","review_reply":"Thanks so much for sharing such great pictures 😊 It was lovely to see you and Sir Michael Rocket again.","reply_update_time":"2022-07-22T13:42:20.567169Z"},{"create_time":"2022-07-14T09:17:04.419412Z","update_time":"2022-07-14T09:17:04.419412Z","review_id":"AbFvOqkQ1bmAKMUIDFPZdRLJ_Eq5kIX6LVs17tUJsOOdFmm6qEpeTTJrM2rw2uQkTrA7735ltnuufQ","reviewer_display_name":"Doug Eastman","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmxLx7-54YusLVgHFUPZCxuyqpJD_isgjjk68AW=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"We have been working with Antonella for a few months now to help with post lock-down separation anxiety with our poodle.  She has been a pleasure to work with and is ready to stay the course - to get us through this.  We would highly recommend her!","rating":"FIVE","review_reply":"Thank you so much for such a lovely review! The pleasure is all mine 😊","reply_update_time":"2022-07-14T21:15:00.529108Z"},{"create_time":"2022-07-14T08:44:04.380747Z","update_time":"2022-07-14T08:44:04.380747Z","review_id":"AbFvOqmjlLipiT4XeAuczv0HLyvPd3MihKHk6abUsOodRZa9ZCb_tHygzotvJAM6B5z5h7nJOJJ5hg","reviewer_display_name":"danousia brown","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZuco3AQzCsVuX6gpadxuIa0qgxZJTmWxamKF5nGfse1I=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Professional from start to finish. Communication was prompt. Great service. Amazing facilities. Friendly and knowledgeable. Thorough consultation and follow up. Would definitely recommend and will reuse again should we have a need.","rating":"FIVE","review_reply":"Thank you so much for such a lovely review! 😊","reply_update_time":"2022-07-14T21:13:21.738202Z"},{"create_time":"2022-07-11T15:30:47.804343Z","update_time":"2022-07-11T15:30:47.804343Z","review_id":"AbFvOqlrQaMOeBEl9cOS4gSQoKNYFXZXyhXQMLjje8SSRJMgD9RfeoBKHcwghI1dgQnuH91R2qb-cQ","reviewer_display_name":"Fiona Mackillop","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmWuPfJDH9eScdn792mFGmGu-iCrxZPvOonQVrS=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"we had a new puppy and whilst owning a previous dog for 16years ; a bit like childbirth we seemed to have forgotten everything about getting a new puppy from toilet training to puppy socialising. Antonella was recommended by Amwell Vet Practice and quite plainly knows her stuff. She  managed to ease us into the journey of owning our little doggy , whilst avoiding or digging us out of some of the pitfalls. The centre is spacious and allowed our puppy some freedom to explore and gain confidence safely. Her knowledge with a common sense approach  gave us the  ability to put it into practice. Would 100% recommend","rating":"FIVE","review_reply":"Thanks so much for your review. It was an absolute pleasure meeting you and lovely Georgie 🐶","reply_update_time":"2022-07-12T17:55:18.631400Z"},{"create_time":"2022-07-06T13:20:57.276821Z","update_time":"2022-07-06T13:20:57.276821Z","review_id":"AbFvOqkSs5AJjeJIF6ud_UxJfkw-5Zig8YHZpmyu_DUPpoK97p-ZrJVv2hZZtKxO-fLAWiBJpmcbsA","reviewer_display_name":"Ben Mayers","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpQM-rLqylHd4raw4xtU9JrhAZ9QTBHf4lEH_y44g=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Animal Wellbeing Centre identified the problem quickly and presented appropriate solutions and ongoing support","rating":"FIVE","review_reply":"Thank you Ben! We hope to see you and Scout again soon.","reply_update_time":"2022-07-08T06:39:35.379052Z"},{"create_time":"2022-07-05T11:20:28.630875Z","update_time":"2022-07-05T11:23:01.877687Z","review_id":"AbFvOqktAzUWB5AzZ0PEFk9m2R8fWPplKgGZSDVeZGq43ofvJeAHAkoMHjdpSHAEHazAg1R3uxGIag","reviewer_display_name":"Gustavo Hinestrosa","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpcfiKQTmTRqtK30cMzycb-w7RipO5V4Zvn08VRTw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Antonella recently helped us with some puppy training for our furry Choco and we couldn't have landed in better hands! Professional, knowledgeable and with an infinite love for animals. Her practice in Labroke Grove is really cool with tons of equipment!","rating":"FIVE","review_reply":"Thank you so much for such a lovely review. It was a real pleasure to welcome you and lovely Choco in our centre. We hope to see you again soon. 🐶","reply_update_time":"2022-07-05T17:48:45.488500Z"}]}