{"20220905":{"recommendation":"negative","review_text":"They just take your money and do nothing at all. Will not recommend to anyone.","rating":0,"date":"20220905","reviewer":"Yonal Joseph"},"20220822":{"recommendation":"positive","review_text":"I am speechless to extended how grateful i am to have you Immigration Consltancies New Zealand work on my behalf eversince i landed in the beautiful land of Aotearoa you have walked the extra miles for me and im sure not only myself but so many people and you have changed  their life. Thanknyou for your heart of service and thank you for not giving up on us. \n\nMrs. Nirmala K Murthy what else can I say? You are an amazing and honest lady. Thank you so much for everything i do thank the Lord for you and for your service, may the Good Lord grant you with more of the abundace of His blessings and give you more strenght so that you may be able to keep up with your good work. \n\nPraise be to God!\n\nAnyway need of Immigration Advisor and Support\nImmigration Consultancies New Zealand is the best place for you💯🔥","rating":0,"date":"20220822","reviewer":"Toli FaOnelua Unufe"},"20220808":{"recommendation":"positive","review_text":"I am very pleased to have immigration Consultancies to work on my Visa. They were very efficient. I highly recommend them for any immigration application or advice. Thank you Team.","rating":0,"date":"20220808","reviewer":"Bassist Mark"},"20220712":{"recommendation":"positive","review_text":"What a relief after 2.5 years thanks Nirmala you did a great job for me . You are absolutely awesome. God bless upon you ☺️","rating":0,"date":"20220712","reviewer":"Bayazid Hossen"},"20220423":{"recommendation":"positive","review_text":"I would like to thanks ICL team and especially Nirmala mam for the guidance and support for our NZ residency approval.","rating":0,"date":"20220423","reviewer":"Sunitha Dinesh"},"20220309":{"recommendation":"positive","review_text":"Thank you so much for the hard working yous did on my husband Visa malo aupito ❤","rating":0,"date":"20220309","reviewer":"Valenilua Tupa"},"20220215":{"recommendation":"positive","review_text":"I would like to thank icl  staffs for  my husbands resident  visa  approval  .Thanks for your guys  support  from Arti Roshik kumaran","rating":0,"date":"20220215","reviewer":"Arti Roshik Kumaran"},"20211129":{"recommendation":"negative","review_text":"they dont even help they just take your money and the results always come back decline because of there poor effort I wouldn't recommend this agency ever it's the worst","rating":0,"date":"20211129","reviewer":"Malar Ballat"},"20210924":{"recommendation":"positive","review_text":"I would say that they are efficient. They collect all the documents and do the application. I don't have to think about my application since I know that am in good hand and that's what I can say with the outcome...🙂🙂🙂","rating":0,"date":"20210924","reviewer":"Praveel Goundan"},"20210919":{"recommendation":"negative","review_text":"Can’t recommend ICL services to anyone.\nCompletely useless and probably the most expensive adviser around.\nBecause of their incompetence I ended up on the Interim visa extension without rights to work in NZ!\nI have been their client for a while. Recently I applied for Essential Work visa and sent them all the documents in advance as requested, all they had to do is to submit them to the Immigration..\nOne month later I was following up because my visa was expiring, then ICL asked me to provide the police reference check (I sent them a month ago).\nThey missed the email from the Immigration asking for my police reference document they forgot to submit and didn’t get back to me at all, until my visa has expired! \nThey explained it as “we got confused” and didn’t get back to me until later I was following up myself.\nI have closed my account with them (with no refund provided).\nAlso misleading information regarding my residency application and really poor communication in general.\nShocking experience! I only wish I was doing everything myself without their help. Stay away from them.","rating":0,"date":"20210919","reviewer":"Alex JesusKut"},"20210818":{"recommendation":"positive","review_text":"I want to say big thank you to nirmala mam.. She helped me alot.. really excellent service..I would  like Recommend Nirmala mam to all my friends ..thank u once again😊😊","rating":0,"date":"20210818","reviewer":"Surender Singh Bains"},"20210728":{"recommendation":"positive","review_text":"I had a very warm welcome from ICL and it was a nice feeling. When I met Mrs Nirmala.... she is a lovely lady with a nice smile 😊 The service was excellent. On every step of my visa process,  ICL was there with me. I would like to recommend ICL for your next visa.... Thank you so much ICL","rating":0,"date":"20210728","reviewer":"Asiri Dulip Madhasekara"},"20210520":{"recommendation":"positive","review_text":"Extremely happy that ICL got residence visa approval in just five months. Thanks to Nirmala Murthy and the ICL team.  They are efficient and work positively to get the approvals.","rating":0,"date":"20210520","reviewer":"Moreen Sami"},"20210503":{"recommendation":"positive","review_text":"I am extremely happy to recommend ICL and Nirmala K Murthy \nThey have helped me to get three visas successfully and so I am here with them again to get my work visa processed\nThey are amazing and i would recommend them to all","rating":0,"date":"20210503","reviewer":"Jesse John"},"20210420":{"recommendation":"positive","review_text":"To all my Samoan people, I highly recommend ICL to cater for your need or help in any Visa application. Thank you soo much Miss Nirmala nd team for your help. God Bless","rating":0,"date":"20210420","reviewer":"Kolopa Tuivanu"},"20210419":{"recommendation":"positive","review_text":"We would like to thank ICL Immigration for successfully handling our resident visa process for our entire family!\n\nThe process was easy and stress free and we are recommending them to all our friends. 5 stars!!","rating":0,"date":"20210419","reviewer":"Jishamol Francy"},"20210416":{"recommendation":"positive","review_text":"I am thankful to ICL and Nirmala Madam for getting me three years work visa \nThey are amazing and I recommend them to everyone who need a visa assistance","rating":0,"date":"20210416","reviewer":"Periya Ravi"},"20210412":{"recommendation":"positive","review_text":"Iam so thankful to ICL team and especially to Nirmala madam for helping me with my work to residence visa. I will recommend ICL for any visa application. Thank you","rating":0,"date":"20210412","reviewer":"Ritam Kumar"},"20210327":{"recommendation":"positive","review_text":"I like to thank ICL Immigration from the bottom of my heart for helping me with my essential skills work visa. Immigration NZ had many concerns and kept raising concerns and was refusing to approve.  Nirmala Madam worked very hard to convince them to grant me a work visa under special consideration. Nirmala Murthy and ICL immigration were very supportive, helpful, and available at all times.  I have to appreciate Nirmala Madam as I use to get desperate and call her after hours, she answered my calls even during the late hours and weekends – I will trust ICL with all my future visas and recommend them to everyone who needs any help with a visa or other immigration matters.","rating":0,"date":"20210327","reviewer":"Harpreet Kaur"},"20210324":{"recommendation":"positive","review_text":"I am extremely happy to get our residence visas approved.  Thanks to ICL team and Nirmala for working with us patiently to get us our residence visas under the skilled migrant visa","rating":0,"date":"20210324","reviewer":"Mobin Mohanan"},"20210319":{"recommendation":"positive","review_text":"I am extremely happy and thankful to ICL.  They got me a visa under s61 and helped me to get a lawful status in New Zealand\n\nNirmala madam worked very hard to get this approval.  They worked very patiently with me to get this approval.\n\nWhat I appreciate about ICL and Nirmala madam is that they are always available to us at whatever time I call.  Very friendly team\n\nI recommend ICL to everyone who has a difficult situation in getting their visa approval","rating":0,"date":"20210319","reviewer":"Varun Jarial"},"20210316":{"recommendation":"positive","review_text":"I am so thankful to ICL and team for getting me the three year essential skills work visa.  Though there were many concerns raised by INZ, Nirmala K Murthy responded to everything to get me the visa approval \nNirmala is very patient and was available to me during late hours and also during the weekends\nOnce again a big thanks to ICL\nI will recommend ICL to anyone who need any type of visa assistance","rating":0,"date":"20210316","reviewer":"Mihir Modi"},"20210311":{"recommendation":"positive","review_text":"I am extremely happy with ICL especially Nirmala mam.... Thank you so much for assisting me to get visa exemption for my husband and baby...I strongly recommend ICL for future immigration processes...","rating":0,"date":"20210311","reviewer":"Ticy Thomas"}}