{"totalReviewCount":58,"review":[{"create_time":"2021-03-27T06:36:22.305Z","update_time":"2021-03-27T06:36:22.305Z","review_id":"AbFvOqn8gN-Tb6B_Ywf6cBIA25aKiiO3QKLeyNekfqunR4NbPSGVldxvUE_Agsy1_L3dhISsVWheow","reviewer_display_name":"aggrey moseti","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJw7uIgbDXAnX10xHOV1GJBrd3s1CLCuL3A-Udpe=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"This company is so amazing. I can't even count the number of times I applied for jobs to no success in landing any interview. Everything  changed after they did my resume, I started getting job  interviews and eventually landed my dream job. My success in landing this job is attributed to the work they did on my resume. I would recommend this company to anyone in need of help on resume writing services. They are prompt, attending and offer best services. Consider contacting do my resume for efficient services and success in landing a job.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-03-27T06:07:24.323Z","update_time":"2021-03-27T06:07:24.323Z","review_id":"AbFvOqmp0wb9Fe3x30iY8LcvKq7-rJu3N5Jr_OeedOfgsee0bCG3tfI4atqaizf1jLsF-e4c5jvY2w","reviewer_display_name":"Nelson Masinde","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhdXJ-Te21GlRCYsY17IG-X7dR7L1zIZrB8SgV82g=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Excellent experience with do my resume. Since I graduated from college,  I have written over 10 resumes and none of them returned feedback. Since the last time I wrote a resume I lost hope for job application until I came across do my resume. Immediately after getting my resume from do my resume,  my resume currently looks very appealing and I have already secured a job with the resume from do my resume. I will recommend you to try it today and secure yourself a job kindly get start thank you.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-03-27T06:02:07.808Z","update_time":"2021-03-27T06:02:07.808Z","review_id":"AbFvOqmNxJSKNBJhfS2ZgSo99uNNV5HjFRu94-Zv8wZy_YZM64lh_wbSzyn4JzZIMKvRwufLXDhvYQ","reviewer_display_name":"brian koskei","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJynfSuhe3pkg1vS6FCeSBlVdOuwwBUWS3IYDbVf=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Excellent services provided by Do My Resume proved invaluable in my job search. Previously I had trouble landing worthwhile interviews despite trying so hard by sending out numerous applications. The few that bothered to get back were quick to dismiss me in favor of other candidates. I could not understand why I was so unlucky when I was qualified for the positions I was applying for. A friend of mine took one look at my resume and immediately told me that it was poorly written. He suggested that I rewrite it using a template he provided, which I did. However, my luck did not improve much. In frustration, I scoured the internet for professional resume writing services and came across Do My Resume. I just had to provide some details regarding my qualifications and experience and they wrote an impeccable resume from scratch. My fortune changed overnight. Most of the applications I sent out went through and I was invited to interviews. Within two months, I had landed a good job, thanks to the excellent services of Do My Resume.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-09-02T16:45:36.008Z","update_time":"2020-09-02T16:45:36.008Z","review_id":"AbFvOqnJooWbFHAmOitPAO7Q8_TtvPiUc-RKUq9XdyfIpOuDIwpDBB1IjIPmNXX4jVqKRPw6dDh3","reviewer_display_name":"Erik Preston","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gip9rVwk0a9U1Dl0QcHGNBi0SETsVrElz3WDV_1=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Do My Resume.Net is an outstanding company that provides a resume, LinkedIn, and Cover writing services. Shouts out to Angela C. for rewriting my resume so that it is more detailed and reads it straight to point without too much fluff.\n\nOverall great company!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-07-25T01:55:46.941Z","update_time":"2020-07-25T01:55:46.941Z","review_id":"AbFvOqmwM-0hUzRrY6GZA9_6cgbqv-s88YIAqZPmn4P3X51J-pNVUByzDRjkixMy-JHX-jrp6SpJ","reviewer_display_name":"Scott Williams","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxfd6tThF4LOqQGpYYcGeFaUjhAn-jKUN1ZUhR8=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I submitted my resume for two positions and the HR representative commented on how well my resume looked.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-03-04T20:40:02.723Z","update_time":"2020-03-04T20:40:02.723Z","review_id":"AbFvOqls-dZWFrV8FykBA4Mz5cilz3FNhStIKCabdciICXkpkmhXcAXgspAexMFZEN1ta0CAHoQ_Lw","reviewer_display_name":"Brittany W","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgB1CvvB3-p00N470w_O7eE5m2bKmTf09L7UgNdDQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"My experience was a very simple process. My resume and cover letter are way better than they used to be. I'm eager to start using them in my applications.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-01-29T18:14:29.060Z","update_time":"2020-01-29T18:14:29.060Z","review_id":"AbFvOqnTN3jLL1XVh7e9pXBR2iu4wR5oBGb1LDj9YCLK5IoA36GasFJ37kP39I-aVG4cO2pEgkbwkQ","reviewer_display_name":"Inside Edge LLC","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhdjlgdMsgmSr_dGu4PE88NQKDa2Eh2BMTKWZ9f=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"As a professional writer I felt as if I did not need any assistance in that that area. However, I discovered that countless resumes that I sent out just were not getting the attention I thought it deserved. I decided to give Do My Resume a try and I can tell you that the difference was night and day. They revised my resume in ways I had never thought of, highlighted what employees are looking for, and organized it to make it look professional. I went from waiting for responses to receiving more that I could have ever imagined. I learned that you have to leave some things to the professionals and no one does it better than these guys. They are fast, efficient, knowledgeable and getting them to write my resume was the best decision I could have ever made to jump start my career.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-12-19T20:19:02.593Z","update_time":"2019-12-19T20:19:02.593Z","review_id":"AbFvOql_CKZ_U4zDzJUOz1JnITZd4p85znrFV68THioJuApeCz8wR3ZbKiGYC_KoBxFTGMJzyg0euw","reviewer_display_name":"Rosalinda Martinez","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwwZoB451HggHu6hhdkBDz1SVcljFxv31SXyuvD=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"These professional resume writers created a very impressive and interview winning resume, cover letter, and LinkedIn profile for me. On the first day I was already receiving multiple offers and interview request I couldn't believe it... Now I'm working for a company that I truly love and they appreciate my work more than any other company I've worked for! Thank you so much for your services and putting an end to my job search now that I'm with the company I was meant for. I appreciate it! Highly recommend this company!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-12-19T14:52:00.573Z","update_time":"2019-12-19T14:52:00.573Z","review_id":"AbFvOqm0vOa8oYFb11cfkLlKJ3QIVAb10R-KPgGzhSrA02s9u5MLGKosp3GETiCGpz5Glkpf2iljqA","reviewer_display_name":"Elizabeth Hayes","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwBE8_Xla4-xYQenp_PHmHare8deRkuPcOyNhvb=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I was in the process of changing careers and needed to have my resume revamped quickly. The professional writers at Do My Resume made some stellar updates to my resume and got it back to me in record time. I'm not sure I could have made the changes myself that quickly, and they definitely wouldn't have sounded as good. I will let Do My Resume be in charge of my resume from now on. They are great!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-12-18T19:18:15.969Z","update_time":"2019-12-18T19:18:15.969Z","review_id":"AbFvOqkociiyf795bd_x2-4snknKC91FC_TZueW2W4T2Lx04gJHoSo748EkoN1f_tD_pLbq7AEr11w","reviewer_display_name":"Ramirez Mattern","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJy3JqRf-P1YwmT6OzxNxsgEp0iouNnWs04f3CvT=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I made the right decision by hiring Do my Resume to write me an impressive resume!  I always had a hard time writing my own resume and they made my experience easy. They were able to list all my past work history and skills just as I told them, but they made it look very professional.\nThey even wrote me a cover letter  and  made me a really good LinkedIn profile. The LinkedIn profile was perfect, it was so good that i landed a couple job interview offers and even landed a job. I am beyond thankful for this company they are reliable and professional","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-12-17T16:16:18.192Z","update_time":"2019-12-17T16:16:18.192Z","review_id":"AbFvOqnfD79cxhdK0MfQiEi1NwBxYVFWudLo1h0-qotGHTECp_Ez6fnORW6Vp3E3ID37Y2dnYqtI","reviewer_display_name":"Matthew Fisher","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzgC8QfvH8m5P46vhxx4v49OLCT2NfbkwL2R2W8=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I could not be happier with the service I received from this company. The professional resume writers created a top notch resume, multiple cover letters and an awesome LinkedIn profile that really amped up my job search. Since using their service I have had many interviews scheduled and will land my dream job in no time I'm sure.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-12-15T23:32:54.340Z","update_time":"2019-12-15T23:32:54.340Z","review_id":"AbFvOqlQBL71uBybwBvvMGW_l4DCTuAuHhT__tPNu9mTYROjme9FA6sQX9R4NiBKHpRRbwtmxnxSfQ","reviewer_display_name":"Hannah","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwT0w8LGNjHdITmL5kY2w1H6XSsU7JAGpP8Vgzo=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I have been a Senior Fiance Director for over 23 years and never needed a resume until last month when I was laid off due to a corporate restructuring. I turned to DoMyResume for assistance. After I paid for my resume package online, my writer, Tiffany, contact me within 3 hours. She did an interview with me and really knew what questions to ask. Upon my resume and cover letter being completed, I am very happy I choose this company. I could never have imagined writing such a cohesive and powerful resume like the one she created for me. Really am impressed and pleased with all my services here.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-12-13T22:39:44.144Z","update_time":"2019-12-13T22:39:44.144Z","review_id":"AbFvOqlmBCbH50a-tSl_dKmcn__cdcp77XZQlpnyDylWDSWqTpRn24gZqMIiL9kgRd2ChZ6jbQ_J","reviewer_display_name":"denise haze","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhCG4cerF97FaH0AmIZX3RDBqoNHXaSIaONNFlL=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"I hired this skilled, experienced company to write my resume and I'm  satisfied with my experience.  They correctly listed my skills and past work history on my resume without any problems.\nDo my resume  made everything easy for me,  not only did They write me the best elite resume, they were able to set  me up  an  outstanding  LinkedIn profile and cover letter  they made everything look professional and neat,   I started to receive job interview offers fast. Thanks Do my Resume I definitely recommend you give them a try they really make sure their customers are happy.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-12-12T17:11:14.052Z","update_time":"2019-12-12T17:11:14.052Z","review_id":"AbFvOqk-u4ES_eQOJ8ccfMSuvC2xxlruRiFqvkkSMp8dFgu18x7iofvC12umaD8SA5GdD3BGLkpvAQ","reviewer_display_name":"Britty Alice","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwMYpJ373m3TA1oire4IQFJUFcWguhl_RHm6_uI=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"My experience with Do My Resume was amazing! I was  highly impressed with my writers ability to write a powerful and impressive resume that captured my career background and achievements! This company literally changed my life! I had been applying for jobs desperately but I had not landed any interviews. I did research on this company and saw all their reviews. Once I saw they had the highest positive customer reviews, were rated best in AZ, and were the largest here in AZ, I decided to give them a shot. It did not take long before I landed two job interviews! I really thank this company for changing my life.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-09-29T20:13:17.037Z","update_time":"2019-09-29T20:13:17.037Z","review_id":"AbFvOqn-gH0tEL_pZyauCoSKsV-z25cZ6kMgu4cAyUpEY2_4Uf_DYtnIzZDILaaH6afxGA3OzIIo","reviewer_display_name":"Karen Miklofsky","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyd9llv_-rdCHdzir8USwWkm4rKvPsNIVi2ch6h3Q=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-09-18T15:55:46.262Z","update_time":"2019-09-18T15:55:46.262Z","review_id":"AbFvOqnsLxUFZFVxPccxhHcEHLc-2RvbGlknf8piFeZjLjzdDY9G-5B-gjeYp-L9zc_BUQHG3NT_","reviewer_display_name":"Suzanne Lee","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhvjeRBYcdL_l0loo9DwvkqrJ6PZzulOIb4gTRCRA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Just wanted to drop by and leave a word of praise and gratitude for the awesome folks at Do My Resume! I had been out of work for four months despite numerous applications and couldn't think of what else to do when a friend referred me here after having success with them too, so I decided to give it go since they came so highly recommended. In the end they set me up with a very impressive cover letter, and I'm glad to finally say, a job winning resume!\n\nI'd also never understood the importance of professional networking, so never bothered with having a LinkedIn page either, but it was actually through that new connection that an old co-worker reached out to me shortly after my Do My Resume professional set up my account, and let me know about a wonderful opportunity at her new job. In combination with a succinct cover letter elegantly stating my skills and goals, my revamped resume landed me a tremendous new role several bumps above my regular pay grade.\n\nI'm confident I wouldn't have got this job without the services provided by them because I wouldn't have had that LinkedIn profile which ended up being the key to landing my new job, so I'm sure when I say it was thanks to them and their services that I'm back in the office today.\n\nThe best way I can express my thanks as well as pay it forward to others seeking the same leg up is by sharing my story and own thumbs up to anyone struggling with their own job search.\n\n10\/10 definitely recommend, would use again!\n\nThank you for everything Do My Resume!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-09-18T14:17:40.009Z","update_time":"2019-09-18T14:17:40.009Z","review_id":"AbFvOqmUCoSu9q3PBGcyZXBDzjGCJIP7qdVD2IORIuRW4pwKFLHY4NRvSxMsGNTgGaS1u73CEApc","reviewer_display_name":"Ralph","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gj6viIYLiCm0Yh3g20t6mKvmedYI77bBv5w93DOH8g=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"Do My Resume are the best! I found them couple of days after I lost my job as a Junior software developer. Decided to have them run a whole package of rewriting my resume, editing my LinkedIn profile as well as drafting cover letters. The delivery was timely and extremely professional. I got offers from three companies on LinkedIn and got selected attended a couple of interview few weeks later. Reckon the least I can do is at least show some gratitude. Thank you Do My Resume.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-09-18T00:41:21.650Z","update_time":"2019-09-18T00:41:21.650Z","review_id":"AbFvOql-NhwxunCArYCitnlac8IyS59-m_SeBP-U4jt_Av2vIqR1tBNwjDPYcBVozlgck79OIEu_Sg","reviewer_display_name":"Michael D.","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyRvThLgiBRsJ_nrh9oMI8IgV6yFGPzpYN1UfHy9Q=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"I have been exceptionally pleased with Do My Resume and their team of professional resume writers. I was quite lost when it came to understanding what to include in a resume and how to organize everything, but Do My Resume knew exactly what to do. I always thought resumes were all the same and there wasn't a strategy to writing a good one, but they definitely proved me wrong! They also helped me craft a professional cover letter and a top-tier LinkedIn profile! I used to be embarrassed to have people ask for my LinkedIn profile, which was poorly done. Now, I invite acquaintances to connect with me on a daily basis! I didn't have much luck with landing interviews in the past, but that's all changed thanks to their help. I've had more call backs and interviews in the last month than I did in many months prior. I'm very happy with their work.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-12-20T14:07:13.586Z","update_time":"2018-12-20T14:07:13.586Z","review_id":"AbFvOqmte_4HqCe86z4qfeNXTEOh4Q8efgPkR93obq19VQXVMgWmi4rYXs17JNG9fSq6Px5xVhU1","reviewer_display_name":"Paul Peterz","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzwL9UQt_8GAHn_mYZNNaP5rPOCBDN77ozkECTO=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I am so grateful of this company.I was not employed for almost 2 years and I thought my resume was best and the employers were just bias on hiring. That was my mentality until I got to know about this company. they are just the best. I communicated with them and they  agreed to write me a resume .it took them a short time and the end product was awesome. The resume was the best and it took me a few weeks and I was being called for interviews and landed a job I'd been eyeing for years.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-12-20T04:04:05.519Z","update_time":"2018-12-20T04:04:05.519Z","review_id":"AbFvOqkd9CqCIB4Dfg7_zNxKf_-zQkMFx5bdB4g0zm2H7F3J1U_XrAtU2iEywFbkdwmx1kAwK62z","reviewer_display_name":"Jeff Harl","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyH744ES2kZY0wvj83mZ1yxmBtLekzyuM6JsHf_=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I highly recommend this company.Their  professional resume writers created a very impressive and interview winning resume for me. I am very happy.if it were not for this company, I'd be still unemployed. But after I was introduced to them and they wrote me a good resume many companies are seeking my service .thanks a lot guys.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-12-20T00:33:22.795Z","update_time":"2018-12-20T00:33:22.795Z","review_id":"AbFvOqnanvlX-86w4Es71uH0QPUgOjFFQp-KyYvhJYkZ_qcciOpKqweIA4eXLOcTtzmQr3hIWxw4iA","reviewer_display_name":"Brittany Wintch","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyqAlqjTV47XGEMnBiXeFF2zmBfE6mkAPhJ9a4=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I needed a whole resume\/cover\/LinkedIn for a company I wanted to apply for, and the whole idea was overwhelming. Hadn't done a resume in years. They did a really impressive job! A lot of time I didn't have to spend.  I thought I was going to have to add my own touch, but I didn't have to do a thing. It looked great and I have an interview next week and I can't thank you enough! I know where to go next time and every time. Make sure to give them as much information as possible. They can do a lot with it. Well worth the price.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-12-19T19:18:07.833Z","update_time":"2018-12-19T19:18:07.833Z","review_id":"AbFvOqlBfNMgcbOBv5bJha8j3_lGjWj1bmhSb10DMqFg37iPqt3ZJFNlSTFYRckLI5P7ITMGt2Jg","reviewer_display_name":"Amin","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzAw5SmCEmKw39SD19eyk1dLk8Zd9WrMpP2wZj-=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"Do My Resume helped me with my resume and that's how I landed my dream job! They not only did they do the resume, which looks more professional than it EVER, but they did my cover letter for me just as good as the resume. I was also informed that most businesses notice your LinkedIn profile. It is really a good thing that I hired this company because they also have the ability to make any LinkedIn profile look very professional and interesting. There is no doubt about it that they are the reason why I'm still getting calls and emails to try to schedule an interview. I do have my dream job like I said, but if something comes along better I'll take it and I would not have been able to say that if I didn't hire them. Thank you one million times!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-12-14T19:28:07.102Z","update_time":"2018-12-14T19:28:07.102Z","review_id":"AbFvOqk-o92R0jLDqHL4eBW6pSrwt2H2X1x0eyA3INLgVi5mishsrbY80KcHosvARu5bGIG3Z21nQw","reviewer_display_name":"Sara Casillas","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gj4NVaikVlNtg6OzvlVKbw6DgVuz2kljtR8rPmCluw=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"They did my original resume, it was excellent. Now I need a resume update, the whole experience has been terrible! Even more disappointed with their minimal effort to make it right. I will use another service to complete my update. If you have any problems, don’t complain because they won’t do much.","rating":"TWO","review_reply":"","reply_update_time":""},{"create_time":"2018-09-04T19:44:12.721Z","update_time":"2018-09-04T19:44:12.721Z","review_id":"AbFvOqmSFi3W31rchnQ-zfPJV4yZ77x4wfon2BC6qkAXwgUvgq4ruGIXFYYIOiOY3SlZBKuwYazLPQ","reviewer_display_name":"Chelsea Leppard","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyVEel3mA0A63AlLU-wrtjdGonjRz9OaQlgzvOs=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"I chose Do My Resume because I am just out of school looking for my first career job and, while I like to think I’m great at writing, why not invest in a professional. The whole process was real quick and easy. They call, get to know you and the position you’re looking for and then get to work. It takes a lot of the headache out of the process and the cover letter, in my opinion, is the biggest headache so that alone was worth it.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2018-07-16T17:48:56.579Z","update_time":"2018-07-16T17:48:56.579Z","review_id":"AbFvOqlX5O4iNRXq2d8MXQUd277s2eciW_U3Fo5t8RKxW4Y2fFLj0D1TPuthqSqSA4xZkoybTJdGYQ","reviewer_display_name":"Paul DiStefano","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GibVafys4onCazcOOb_KEEynGK4AsTDZuMz0Db9Bw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Best resume I have ever had.  I wasnt getting any calls on my prior resume but now have 3 job offers this week.  Great service and money well spent","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-12-01T21:08:46.900Z","update_time":"2017-12-01T21:08:46.900Z","review_id":"AbFvOqnLvKwiNrnXJYqsv0JAwj77T2fReOKOIoN02Ou63eepqgiPRr5J-0UdOv8jGqELBZCvQVrd5Q","reviewer_display_name":"King Doda","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxSOUSXWxF39DclCkwCj_MZunSv6d39wGwWZXJa=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Best resume place this is my second time using their services and once again I am very pleased and it didn't cost me to much!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-12-01T21:07:51.092Z","update_time":"2017-12-01T21:07:51.092Z","review_id":"AbFvOqnupy5oXBAvJZDsK1xX56aecjh1K3fBbFP5fL1wPWSb4qPXd_ak3bLc530zhj2TfXQyHGKMkA","reviewer_display_name":"Amoir Fallon","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwNUghwhMhbngQyQ8L0Uclbzzs7G5yRjPIREolL=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Great selection of resumes and matching cover letters. When you calm in, wait time to talk to person is very short if any, and person on other end is pleasant, professional and very effecient. Thank you","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-11-21T22:14:25.496Z","update_time":"2017-11-21T22:14:25.496Z","review_id":"AbFvOqlRH7Eitl4Ru8ciR1B1F9NLgZ4-q35QSRCtm6-brqsQURPzhOmbKRTe1oGQ9K9XT4nO3F4GDA","reviewer_display_name":"puma Smiles","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzgeuuqULKtTH4MrkpmEsHUt0MXyj4p4-VxUsyB=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"POWERFUL WRITERS! I found Do MY Resume on Google when I was in need of a better resume. I went online, called them, and they actually answered the phone. I then paid. Once I paid, my writer at the office emailed me to schedule an actual interview with her. Jason was my writer. Jason extract so much valuable information and then worded it in such as way I could have never done myself. My resume was powerful, detailed, incredible, and spoke about me better than I could have. Landing 2 interviews within 3 weeks of submitting. Wow, LOVE THIS COMPANY!\"","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-11-21T18:29:37.332Z","update_time":"2017-11-21T18:29:37.332Z","review_id":"AbFvOqmlDyl6sau5SZfAx1ytd-Iri57SWxhQGPbzoZ4LAjtccbgXzE0U2S5fLKRUtOKnZwl9ESuORQ","reviewer_display_name":"Troy sco","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzNXFFEZY0Mm9uAk4CA9XMQJ3-X9hWgqTla43th=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"This was my second time using these service's once again they came threw with the best formats for my resume and they dont charge an arm and a leg like most resume places!!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-11-18T17:25:14.726Z","update_time":"2017-11-18T17:25:14.726Z","review_id":"AbFvOqm9Mv00jLrLj3AruH8Gr7HNAtZEFcwxH4tGbf-sY7PzATIi3e79Cvx0TBbMC5uP9Yx6obCoHg","reviewer_display_name":"Susana S.","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhwrPcAA4y127BS9bTyd86Axpna9U3b50NyVm1_=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"I want to sincerely thank \"Do My Resume\" for assisting me in creating an Interview Winning Resume that has assisted me in landing more than several VP positions! To date I have  accepted one job  that will be making over $320K a year thanks to the INCREDIBLE and professional resume writers at Do My Resume! Thank you all very much for your assistance in this major career change!!\n\nHad it not been for this incredible resume, cover letter as well as LinkedIn  writing services that I received from Do My Resume...I can honestly say that I would not have this amazing position right now!\n\nSincerely Grateful!\nSusana","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-08-17T21:28:21.491Z","update_time":"2017-08-17T21:28:21.491Z","review_id":"AbFvOqlIa4D2UfOzkSJ_60rSZIxGLfhiU4BkDVk4HhseMIjHPUMuPZQUuQUsaC8tY6euIfdkPKNL9w","reviewer_display_name":"allyson griffith","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxkuoBZKuVJV6vNfnJy5mxgCHaZVPVUOb_ByoZK=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"This website really helped me with polishing up my resume. They were extremely helpful and made the process very easy. I really enjoyed using them and I would for sure highly recommend them and I also would actually use them again.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-08-14T22:33:13.880Z","update_time":"2017-08-14T22:33:13.880Z","review_id":"AbFvOqlgxMj6ttW5vYE1qVcmKbHdNKo17l4dZIg3f9WSLRDniMNG8zD1lmyVDx8p_3yeIDF0nU9cYg","reviewer_display_name":"J Washington","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgQgVg250Wuzp5DFlumwTHF350bUTWrWoML9lp1tA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Searching for employment is easy but getting responses\/replies in a reasonable amount of time is the challenging part. I'm glad I found this company to help me improve my resume and feel confident. Before I would maybe get one callback, yet after Do My Resume made the adjustments, I received responses the next day and was able to choose the position I wanted. Yes, you definitely get what you pay for. Well, I did! The part that I love is that they are open after normal business hours.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-08-14T22:02:46.570Z","update_time":"2017-08-14T22:02:46.570Z","review_id":"AbFvOqn4szFE0K1o0KoI3-MRSc1of0NQi3Gxry8f3i2aEDIqxLhHQAdKthmAaWZwXJXmh0_IdLWuBQ","reviewer_display_name":"Amal Rodriguez","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzKmJ1Zp-zk6zBTgK6oiUH04K4P5njHugfxBB_e=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"Throughout college I thought I had a well written cover letter and resume, but how wrong was I. After college it was hard to get interviews in the management positions interviews applied for, despite the experience I had. I sought the professional experience with Do My Resume and I started getting calls soon after. I even landed a second interview with a highly competitice management position in the company i wanted. They explain ways to improve your resume, know what skills are the most marketable and help you fix your resume to make your accomplishments stand out. I highly recommend them because they are professional, attentive to your needs, and supportive.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-08-14T21:23:33.081Z","update_time":"2017-08-14T21:23:33.081Z","review_id":"AbFvOqlv--nuHGWgqXPgW4bnxeVkqJTSgQgrF7Xyt7qIKqKK7BGzllKEuzvIy5TKO_E7na3p0DUL","reviewer_display_name":"Thomas Lee","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gh_HP3aNZ7nbBsW6IZlfrvX-PzlQVWI99Jq6z8b_g=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"After working in marketing for more than 8 years, I thought I was ready for a high level position as a Marketing Director. However, no matter how many resumes I sent out, I either received radio silence or a polite rejection email. I thought, what the heck am I doing wrong? It turns out, ironically enough, that I was good at marketing businesses, but not myself. I turned to Do My Resume for help and they helped me craft a stellar resume that got me a call back within 48 hours! If you're looking for someone to make your resume shine, I highly recommend these people!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-08-14T20:32:55.734Z","update_time":"2017-08-14T20:32:55.734Z","review_id":"AbFvOqm8-MhfYOFnac9wFEZcHckf6NI1hy6YzbbBDLVIn1OQGlblW5zWleyyu2HikLpfTj8kmiUgCA","reviewer_display_name":"Super Worker","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhaaUpwQCybnYIuEUXUbRgertlo3FuwDfH3ZZw3=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I had been sending resumes without getting any responses from prospective employers until someone referred me to Do My Resume. After they did my resume, I got so many interview appointments for high level management positions, I was actually spoilt for choice. Finally I landed a job with a multinational company as a management director. These guys are professional, efficient and above all they are experts when it comes to resume writing. They are able to make your qualifications and best attributes stand out so well, propective employers can't resist to invite you for an interveiw for further discussions. Try them today, I promise you will never regret.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-07-29T00:14:25.022Z","update_time":"2017-07-29T00:14:25.022Z","review_id":"AbFvOqlsZAjeVSMGF-32tDq2cunhIU2SUqbvN9Da6tUn1jV8WRP-K3DEb7AqF-eL8SktciQ5_RJ7","reviewer_display_name":"Treijon Johnson","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgcmNYrEw0Ll9aLU_v9rvUatshVXRpMHPl0tSQAcw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"One of the best resume services. I have no doubt that I would have had a lesser shot at the director level position I was able to obtain through these services. The number of interviews and returned calls I was getting nearly doubled after this service. Sometimes you might think its your experience holding you back, when actually it’s the way you are presenting that experience. These guys really just think outside of the box when it comes to formatting and putting key attributes at the forefront. Since using this successfully, I have recommended it to many of my friends, young and old. Give it a try. The worst that could happen is that you have a resume that is suited perfectly for a particular niche.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-07-28T20:00:58.967Z","update_time":"2017-07-28T20:00:58.967Z","review_id":"AbFvOqkylSfhuZHkY5gOqLXdrOURIMurkDc8Dw8qYARA626mAljsqxUoAXA-sV2I6C3ugzNRyBvOZg","reviewer_display_name":"Jasmine Speller","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GjwIxDEZK0kG1GlPkk_0E31yl4oPtSjbMVmVYUW=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Asking for help when looking for a job is easy but when my resume wasn't getting any responses I knew I needed to find professional help. This company made designing and building a resume that fit the job market I wanted to attract easy, simple and fun. After speaking with a representative, my resume was ready very quickly. I began sending my resume or and received responses very quickly. During my interview I received great compliments on the professional look of my resume. The professional style helped me land a position as a Senior Supervisor in a Fortune 500 company. I wouldn't go to any other company to build a resume for me in the future, I know this company cares.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-07-25T20:29:39.004Z","update_time":"2017-07-25T20:29:39.004Z","review_id":"AbFvOqn1sTRVrvfTiohdWtRRer6bkIXaePKMHq_hNpdyEPy9c7NAshAdeaOL2R4jUkqvMfFnyPhD","reviewer_display_name":"Annice Kent","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwpo1uMyqviQ2uFhsslK7pI4YEyHd6NQpkSAPmy=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I recently​ gotten my resume and cover letter looked over and completely updated. Do my resume toke my resume and cover letter to the next level. With one on  one help I never felt like I was just another paying customer like pervious company's made me feel. They where understanding and did exactly what I wanted. Since working with them I have landed a career in Mangment. I give this company five stars and recommend them to anyone.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-07-25T19:53:18.122Z","update_time":"2017-07-25T19:53:18.122Z","review_id":"AbFvOqlTgTOkcxx3kcxwfZaEE5md_okLjWcTeajYECwJGXIBvF-SEw9KoYgNxHwgUigypLAkuIA2","reviewer_display_name":"Randy Dicker, Jr","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJx1nHOhrs2q8Kh28EssdWAKlslQKfkyMDB1y56I=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Do My Resume is top notch helping people with resumes and interviews of all levels.  The cover letter is what gets the attention of the employer first.  I was nervous about this aspect the most, but Do My Resume helped me identify key strengths and put them into words.  Because of this cover letter I received executive level director and management interviews and used what I learned from Do My Resume to land a great job.  Don't hesitate, reach out to Do My Resume and be working in no time.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-07-25T17:14:58.685Z","update_time":"2017-07-25T17:14:58.685Z","review_id":"AbFvOqmqugqD0nYzb_4q8E8OgYa76VNEwKjEA-0d3P3JJIvNA3KixblZ9dXM5DFSNFRVy9fpt9FV1Q","reviewer_display_name":"Forrest Cohen","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgRMR9IZ3GG2v3WvvkWZHFfRt5S36N8ssfWRP3sRw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Recently got my resume fully worked on by these guys. They did it all the way from scratch and it made it the most professional resume I have presented yet! Very happy with my resume as it helped me land interviews with all different high level directors and managements until I found the right position. If you ever need your resume doctored up definitely go to these guys, very reasonable - you get what you pay for!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-07-19T00:54:49.566Z","update_time":"2017-07-19T00:54:49.566Z","review_id":"AbFvOqkXMVV_IwlmhgTOWtvg2i29m2yd1MXArWZ_KZqBdpTMfyUg96NjWhcEGHu2ROHWHYj0S0z63w","reviewer_display_name":"Derek Hansen","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJza4bpTcq3xiBPKpT8_vHqgLfMaqpM0l94Dxirg=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"The assistance provided by Do My Resume without question assisted in my multiple interviews for management positions. Their expedite assistance and careful critiques were more than I expected when I initially signed up. Unlike most help-with-your-Resume companies, Do My Resume really took the time to understand who I was and how to highlight my best attributes. I cannot thank this company enough for putting my resume and my career on the right path.\n\nThank you so much.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-07-18T14:52:19.563Z","update_time":"2017-07-18T14:52:19.563Z","review_id":"AbFvOqmdpXPJUeE1smQz49fYP8t7EeY9BLOt3lg1Bujw5mBS32xZqcFWFgSzDCu9-uyMhA2CpDvuVA","reviewer_display_name":"Adrianna Easton","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxtg6XmL-wrUV7mWuDgZm8AObH9Mu0F1CK-Bj85=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I had no idea that there was a place that would help you create a professional resume that would help you get good jobs to pursue careers. The resume I had created by myself had been clarical errors and spelling mistakes that needed to be fixed in order for others to take me seriously. Do My Resume helped fix these errors and allowed me to have more opportunities for better jobs. Better jobs means a better future. A better future means that I can provide a better life not only for myself but for my child as well. I can provide a stable and steady income to provide my family with what they need.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-07-18T00:07:45.611Z","update_time":"2017-07-18T00:07:45.611Z","review_id":"AbFvOqlcuWkIaxf3mXDOxnIkSwYWX2SxwaX6UD9k6_y2qhPckFtxz0RUMxJkNWIakOk1jGs33PQGDA","reviewer_display_name":"Coco M","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJx25MLqZGtsC_y_jS29jIcON7EuXIcOzi2wb_QN=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"Gosh where to begin my resume was a mess I had no idea where to begin or even what to do or say I needed help and bad and Do my resume helped me get a head start and even helped reword some things to sound more professional i ended up with some awesome interveiws in management positions and even got an interview with3 a high level a high level director i was confident going into the interview and felt like I nailed the position soon I will find out thx to Do my resume","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-07-17T22:39:38.669Z","update_time":"2017-07-17T22:39:38.669Z","review_id":"AbFvOqn188c6RUowSYJinUTL_HJwvtO8cOTrtISddb5jQzvtS941U7UEYRsNtABeWCyrnadFCCuD2w","reviewer_display_name":"Brooke Boddy","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgzQBTmutDYYHmAyDclGXNX1dJ-L19UicqYSPAwKg=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Do My Resume helped me immensely with my resume and cover letter. After using their help, I received a multitude of interviews for high level director and management positions. I’ve struggled in the past determining what exactly needs to be in a resume and how it should be presented. After working with Do My Resume, I have a much greater understanding of the resume and cover page process. I’ve learned skills through their website that I will continue to use in my professional life. I couldn’t have received these high level interviews without their help! I would recommend this company to anyone!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-07-16T00:09:41.368Z","update_time":"2017-07-16T00:09:41.368Z","review_id":"AbFvOqna2Rtq3heyCIjW-TOl1l5ZS6EW53vTzQOE1NzzY44b3v7OwH1xmbceOCSbYDG2N_N50YiYDg","reviewer_display_name":"Sean Haveron","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgyDMKtOWGjTm672z4JRO3Paf2jmAfuIbBDZvDx=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"In the competitive work field, it is compulsatory to provide a presentable resume and cover letter. Fresh out of college, I'm grateful that I took the time to schedule a resume review with Do My Resume. They were extremely professional and meticulous with my resume. They went above and beyond to correct any mistakes and gave it that extra \"pizzazz\" employers are looking for. If you want to stand out, take the extra step and hire a company you can trust to review your resume. Do My Resume's team possess the expertise to ensure your future. Why not give them a chance?","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-07-11T16:56:57.454Z","update_time":"2017-07-11T16:56:57.454Z","review_id":"AbFvOqkw8bCS7VVWT_vA-7cI81Su_2-YsJ4MJgP6eUomSDp0cJa1fR33WgeV5jxzpG6HnEs13SzthA","reviewer_display_name":"Christina Solus","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwwMQZoNfbmPgFlpNilLQlJAjfisiWilY4fTJR6=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"This people did great on my resume! They had helped me critique my resumes to the max. I had major issues with my grammatical errors, my spelling and how to correctly show me where to place things. It looked so professionally well done that I would recommend this resume building site to anyone and it was really affordable!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-07-06T15:48:10.425Z","update_time":"2017-07-06T15:48:10.425Z","review_id":"AbFvOqmqby3zGovWmGI-lWx6r7edMpFsaPUm0243jmSkQ3JaQjABcVYXWEq1tZ_SUHRj1QeMZ1qB8w","reviewer_display_name":"Ashley Hazelnut","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Ghp9mQBbq0eS0j04MAaDAXnChH1YYs6NCb-SkIx=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I was completely frustrated with my resume that didn't appeal at all, and without a resume, I couldn't do what I wished to do. Then I found Do My Resume. I didn’t really trust online services that I don’t hear about often, so I researched and asked my friends about it. Some who used it before recommended it, saying that it was the “best resume-writing service ever”! Without further hesitation, I asked for help from the professionals there. In less than 72 hours, they helped me to push me a step closer to my final goal! I never regretted asking for their service.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-07-06T15:18:02.055Z","update_time":"2017-07-06T15:18:02.055Z","review_id":"AbFvOqkDllSf0c0ifUTbzZ-v1IOLjGyEjY-alyQ91Z8iuX521-IZKDjahQLBaXPFVTZpvLojJhga","reviewer_display_name":"Carmaletta Street","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GjqwbMl9ZDgFEhGBqD15dPPr34DZtri6gwYwOqx2A=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"I've been searching for a great company to have my resume  cv, cover letter done on my linkedIn profile thanks to them it made a difference. I can see it by measuring how many companies used to contact me before and after I had my linkedIn profile done.\nAlso the calls for interviews increased much more since I got my cv developed by this company.\n\nI recommend everyone try this service,This is a very good company.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-06-27T23:43:53.408Z","update_time":"2017-06-27T23:43:53.408Z","review_id":"AbFvOqnOe-EC-s9zQxAPPwZACQ7DV7ppl2jyrbycLNnUjlblPYCW-bsw1y6VJNhp00-gpb8uglcQ1g","reviewer_display_name":"Agnes Musee","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GjBZ8RFtmOrd_WCQsh0LniPbza6LgGzqb9Hjwkrwg=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"In the competitive work field, it is compulsatory to provide a presentable resume and cover letter. Fresh out of college, I'm grateful that I took the time to schedule a resume review with Do My Resume. They were extremely professional and meticulous with my resume. They went above and beyond to correct any mistakes and gave it that extra \"pizzazz\" employers are looking for. If you want to stand out, take the extra step and hire a company you can trust to review your resume. Do My Resume's team possess the expertise to ensure your future. Why not give them a chance?","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2017-06-19T16:11:40.132Z","update_time":"2017-06-19T16:11:40.132Z","review_id":"AbFvOqmJxakQtsK_EGGEdtPxQpteLHWAcgKYYfhi8xzeugWmwI3MvjUfGAuZOXO2rvYd3S8GCtyO","reviewer_display_name":"Bre Reed","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgohgTuZOJhDgZysKQKzs_glycMXXi0yWkWOEKo1A=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I had no idea on where to start when building my resume. I only had some retail and customer service experience, but they assured me that that was all I needed. I wanted something that would look professional and neat and Do My Resume did just what I asked for. I didn't feel out of place or misjudged at all. I had also recently just moved and they made me feel right at home with such hospitality. They were extremely friendly and professional with me. I learned so much from them from my tone to proper work etiquette. They really care about your future and want to help you guys as much as possible .","rating":"FIVE","review_reply":"","reply_update_time":""}]}