{"totalReviewCount":93,"review":[{"create_time":"2022-03-30T17:42:02.284Z","update_time":"2022-03-30T17:42:02.284Z","review_id":"AbFvOqnbI0WN7oJx6E2B8L1Rp-tkLGMV71nAy_-ZONvdlz8uveGKuOFSZ702_nV3fuP2HACHV-3GkQ","reviewer_display_name":"Cam Choiniere","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gjfb-D71rdiVLpTLEN3yNUj6eir3JHeLj7ID3FE=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Transou's has done excellent work for us on our septic system. Very responsive, super nice, good follow-up--great experience in all areas. We highly recommend them.","rating":"FIVE","review_reply":"Cam, thank you for taking the time to share your experience with us. We greatly appreciate it and look forward to our continual relationship. Welcome to the Transou's family!","reply_update_time":"2022-03-30T18:41:37.217Z"},{"create_time":"2022-03-27T19:33:43.337Z","update_time":"2022-03-27T19:33:43.337Z","review_id":"AbFvOqnVqmB1ncvfsHICh6dr12mO3TbxqmWaG2Yl4k0OjZPxalVffzzfDQVXSXSZNMVNi0VH1c-6mw","reviewer_display_name":"larrie grocholski","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJz16A1-WHwohpEwQV0e1ZhZRbG3WyauZZWvXBta=s120-c-c0x00000000-cc-rp-mo-ba4-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"Thank you Larrie for taking the time to leave us a rating. Welcome the the Transou's family! Remember to always call the truck with the duck!","reply_update_time":"2022-03-27T22:36:32.655Z"},{"create_time":"2022-02-03T20:37:31.646Z","update_time":"2022-02-03T20:37:31.646Z","review_id":"AbFvOqnL5Cbrz0SycwLpaJwd0Gy4-MDniCunI3UeM-NfU5lk5wZAmWS9kv3zcmzz0a-cYhgsiMMg5g","reviewer_display_name":"Denita L","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJySSiILBHwEId9I8aFXP0T0FQDSDNvfZQeh-R7w=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"These guys are AWESOME! I had just purchased a home with a nightmare plumbing issues. I called another plumbing company first, and they just turned and walked out - said they couldn't find anything! Transou's came right out, didn't leave until they found the problem, fixed it, and when yet ANOTHER problem happened that they couldn't have foreseen occurred, they came out again at 10 PM and once again, my problem was repaired. I can't say enough about these guys! Just absolutely AMAZING AND AWESOME!","rating":"FIVE","review_reply":"Hey Lynch family,  we appreciate your awesome review! Although we hate to hear all the bad news about your newly purchased home, we are glad you chose us as your plumbing company. We are always just a phone call away. Welcome to the Transou's family.","reply_update_time":"2019-10-31T00:33:35.233Z"},{"create_time":"2022-02-03T18:51:11.298Z","update_time":"2022-02-03T18:51:11.298Z","review_id":"AbFvOqmdKXT1p6d8DfqcAEJqwLZTyLpwd-xri2ngFA-FQBfz8Eezdu4RIHn6TXv27DWpmPod0Vzh4g","reviewer_display_name":"Paul Ouellette","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwmdUVoLjhnVM3rcnYbuwIBgzpsrI8-QmunJBQH=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Knowledgeable,pleasant service.\nShould have called Transou before spending over$700 with Roto Rooter.","rating":"FIVE","review_reply":"Paul, thank you for taking the time to review us and for sharing details about your experience. We are sorry that things didn't work out with another company but we are happy that we could step in and provide you with world class service! Welcome to the Transou's family!","reply_update_time":"2022-02-03T19:07:38.441Z"},{"create_time":"2022-02-03T11:11:00.122Z","update_time":"2022-02-03T11:11:00.122Z","review_id":"AbFvOqlaffFLXzb2MWRV3OJC-YwoJY4hTxpNKNW_UKb5hI3Hu_M-BJyvcYR8JNpi78cMBgc_h2MAbw","reviewer_display_name":"Bob Merritt","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzJCpEakjPZEuaOtP-dfez25HGxmfbZudMdTtG6=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"Bob, thank you for taking the time to rate us. It was a pleasure serving you! Welcome to the Transou's family!","reply_update_time":"2022-02-03T12:37:13.239Z"},{"create_time":"2022-01-31T21:40:06.420Z","update_time":"2022-01-31T21:40:06.420Z","review_id":"AbFvOqmqVQ4WIN3HCPkkau9V5OI_DhQV6cJ_fEXRrY6HbTKU3h0kU5TMXzgJ522PKxx6beTzx4EcOw","reviewer_display_name":"Corey White","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgN18eJa149BVcUVrPc9JZrhNCwoXGxkTxXu2YC=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"10 stars if it was possible!!! Every single person I have dealt with at Transou has been fantastic. However, special shout-out to Andrew (service tech) and Megan in customer service. Megan has been friendly, prompt, and knowledgeable. She worked hard to coordinate multiple teams since we needed risers installed and the system to be pumped. I just bought a new home, and never have owned one with a septic system before so this is all new to me. Andrew while he was out here pumping the tank went out of his way to educate me on ins and outs of the system and how it operates, upkeep recommendations and things to look out for since the system wasn't mainted properly before I purchased the home. I won't use anyone else in the future, it will always be Transou. Thanks to everyone!","rating":"FIVE","review_reply":"Corey, thank you so much for taking the time to share your experience! We are happy to hear that you were taken care of from beginning to end and that our team of super heroes went above and beyond. We are ecstatic and count it a blessing to have you as a customer for life. Welcome to the Transou's family!","reply_update_time":"2022-02-01T00:52:01.257Z"},{"create_time":"2021-12-28T19:39:46.554Z","update_time":"2021-12-28T19:39:46.554Z","review_id":"AbFvOqnI6nJKRcHxrofNAzkhu1dAaibOrnRvd5FJkZjpPl-lWLYgN8ivMJuL4GPWoyVaDmIfHTPrCw","reviewer_display_name":"Candice Chacon","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyaSFCPfF7dP00pxjhIxFSbjRTcwEj5kyUaBDpi=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Customer service on the phone was very friendly and helpful, she made sure we received service the same day. Joshua was professional and incredibly detailed and informative on the issues and options. 10\/10 recommend.","rating":"FIVE","review_reply":"Candice, thank you so much for taking the time to leave a review. We really appreciate it and it means a lot to us. We're so happy that you had a great experience and received exceptional service from beginning to end. Welcome to the Transou's family!","reply_update_time":"2021-12-30T11:27:19.431Z"},{"create_time":"2021-12-07T18:29:23.915Z","update_time":"2021-12-07T18:29:23.915Z","review_id":"AbFvOqlxvdYSSwTfxK2m_P-6UdZ4GkdD78rOOX8wDViHjLK31abW5nsKn3MdlDDRIW5FSlTnOsYjeA","reviewer_display_name":"Brenda Dancy","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJy02aJ9xqLW0_60gMZxvhcKd3D1a_EwXRVTfQ8X=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Exceptional in all lines of service.\nQuick responses and scheduling by Brandy, Emily and Megan. Kept me updated.\nService technicians were all knowledgeable. Friendly and courteous. Excellent work.\nOn time. Made sure I was informed and satisfied with all services performed.\nEstimates on target. Reasonable cost for all services. Excellent overall services by\nChris. Austen, Gary, Gary. Lee and Michael.","rating":"FIVE","review_reply":"Brenda, thank you so much for the kind words and for taking the time to leave your feedback. We greatly appreciate it and are happy that you had a wonderful experience. Welcome to the Transou's family!","reply_update_time":"2021-12-09T16:17:16.334Z"},{"create_time":"2021-11-29T22:40:22.423Z","update_time":"2021-11-29T22:40:22.423Z","review_id":"AbFvOqnsrRGWp_f00rAOA2YPcmZAKoQZKrYehEaM7gcF0zKGczfiHLGoCdZtWvOqdo6c7jhZMTn42A","reviewer_display_name":"Golf Lover","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyLkF0LEmX0FLvVM0VcN-JSqKXvyNVb1qt1qcl2=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I would like to share what a great experience I had with Josh H and the team from Transou plumbing today.. We had 2 prior quotes from local plumbing companies and was getting conflicting information and need someone we could trust and we got that today with Transou plumbing.. They called and sent a text before they arrived and showed up right on time.. Josh quickly diagnosed the problem and showed and explained exactly what was wrong in terms that I could understand...he took extra care to not bad mouth the other companies but instead focused on finding us the most cost effective solution to our problem..the only reason I didn't have them come first was because they were busy with other companies but got to just as soon as they could...For all our future plumbing needs not only will they be our first call, they will be our only call.","rating":"FIVE","review_reply":"We are so happy to hear about your amazing experience. These are the type of reviews that we love to hear! Josh demonstrated all of our core values in action. We are here to always put service FIRST. Welcome to the Transou's family!","reply_update_time":"2021-12-03T17:14:46.305Z"},{"create_time":"2021-09-26T01:58:14.166Z","update_time":"2021-09-26T01:58:14.166Z","review_id":"AbFvOqnMpnoHAOPXs-UV9YvF6sRgGTLR_BAa8PbGvKBhIVtw2A45rTd-201AMxfgFeR2CnQwgb-m","reviewer_display_name":"Lane Foster’s","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgXNxRgg5_jFjnX6u2QKM9nuYr701HnxeMTinr8Yw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"Thanks for your 5 star review! Welcome to the Transou's family!","reply_update_time":"2021-12-03T16:34:58.878Z"},{"create_time":"2021-09-21T18:12:02.499Z","update_time":"2021-09-21T18:12:02.499Z","review_id":"AbFvOqmgoCpP3V_nHwGWb29IaIRgLvMLG07HuNW14-6MIzJRMfCdGS1FcwQtvfHiR0dkfDuk5HaOww","reviewer_display_name":"Lancaster Zachary","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwsViwV3IONobZL1KG-v4ruXH9-Ofv7Z0U8VxOT=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Wonderful  and prompt service. Emily his true asset to their company.","rating":"FIVE","review_reply":"We appreciate your kind words and we believe that Emily is a ROCKSTAR! Welcome to the Transou's family!","reply_update_time":"2021-12-03T16:34:35.808Z"},{"create_time":"2021-09-20T17:17:27.316Z","update_time":"2021-09-20T17:17:27.316Z","review_id":"AbFvOqk9sCa5kduXGOLoYlXDRJMaKGTWcPe8MpasR3uojQwDxQgKTJWI-kEJJr-oXGUUdtmsiknEOw","reviewer_display_name":"Howard Taylor","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzyOXLbYlB_SAq3S78M-lR4WQaKoheVdk0v7d00=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Excellent service from the whole staff, to include office, leadership, and plumbing staff. Effective, on-time, and with accurate estimates.  Strongly recommend and will personally use in the future.","rating":"FIVE","review_reply":"Thank you Howard for taking the time to leave your feedback! We're very happy that you had a great experience and that's what we strive for with every customer every time. Welcome to the Transou's family!","reply_update_time":"2021-09-20T18:44:59.995Z"},{"create_time":"2021-09-10T01:30:18.962Z","update_time":"2021-09-10T01:30:18.962Z","review_id":"AbFvOqnSjXph-MEYHw1pYxiPGGGsHc40Ju5CKed3tirEndG_RHASWhc6_XqPUabIkVjLV7fDZh_uWQ","reviewer_display_name":"Lee Everidge","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzVsrC-d__HZk8qmmNtKCijsKSIufWICNGxpGIn=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"$345 an hour. They helped me by installing a washing machine connection. Guys did a great job and in a fair timely manner. Gave me a price upfront and I felt it was really high but I thought it was going to be a lengthy job. Only took 7 hours and I ended up paying $345 an hour. Go figure.","rating":"FOUR","review_reply":"Hi Lee. I'm glad to hear we offered you great service. However, there seems to be some confusion about price per hour. We are an upfront fixed price book. In other words we do not charge an hourly labor rate, as we feel that could fluctuate too much and give an unfair disadvantage for the customer. In other words, many trade individuals are time plus material. They will give a quote of what they think it will take, but if someone who is not as experienced prices the same job it could take them much longer, thus making the same job cost twice as much for the customer. We pride ourselves in giving upfront pricing for our customers that doesn't change by end of the job. If you have any questions about the service you received we'd be happy to discuss further. You can reach us by calling the office and asking to speak with our Plumbing GM.","reply_update_time":"2021-09-10T22:02:45.972Z"},{"create_time":"2021-08-10T17:52:47.271Z","update_time":"2021-08-10T17:52:47.271Z","review_id":"AbFvOqlSos_51gi6PaqJvfWExqiJDzQ9OaNwSIAKY3QQBIkUDg6HQikvkmYpqnZGF50YlPmc5hKnsQ","reviewer_display_name":"Daniel Chipman","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gj3GoxaMhmw6cyC9aRxIppm3mcqP8ewaJfMY3JF=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"We bought a house sight unseen from the far side of the Rocky Mountains and when we got here, we found our home came with a bunch of problems! Transou's helped us get the septic tank fixed and recomended against some things that I thought I needed. They took extra time to educate me and reduce their bill. How AWESOME is that!!!\nI will definitely be using them for the projects I have coming up.\nA HUGE thanks to Wonder Woman and Bat Man, and the rest of the Transou league!","rating":"FIVE","review_reply":"Daniel, thank you so much for the kind words and for taking the time to leave the feedback of your experience! It was our pleasure being there for you and we look forward to continuing our relationship in the future. Welcome to the Transou's family!","reply_update_time":"2021-08-10T19:14:27.875Z"},{"create_time":"2021-04-29T19:10:49.823Z","update_time":"2021-04-29T19:10:49.823Z","review_id":"AbFvOqk9NVWyiosNqKuD1XgJwd8wzvJyIpM4riwXEaPGHoADc72rWKvA9BlWp9V_K47rIVenzY0KEQ","reviewer_display_name":"Jerri Irby","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzj8mCFkVNlp81DnVuByo0Hr9kPZIzcsEnKnLw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Chris and Anthony were fantastic - thank you!","rating":"FIVE","review_reply":"Jerri, thank you for choosing us and for taking the time to leave us a review! Welcome to the Transou's family!","reply_update_time":"2021-04-29T23:39:22.068Z"},{"create_time":"2021-03-30T15:04:56.385Z","update_time":"2021-03-30T15:04:56.385Z","review_id":"AbFvOqnbrxsv4zj2WMFgFAhz0fhYh0FZita2f1FW_7mn6Kq2AROba8H7WCt9AAyF4YYRVWWjnwP1Ew","reviewer_display_name":"kim Duncan","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GjWJNAo1G7NvvPOdAsIWjRvVtI2T-j9TYqEDdfx=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"Kim, thank you for taking the time to leave us a review! Welcome to the Transou's family!","reply_update_time":"2021-03-30T15:36:03.264Z"},{"create_time":"2021-03-16T17:12:51.033Z","update_time":"2021-03-16T17:12:51.033Z","review_id":"AbFvOqllNY4zG-PIHUWo3B2ZFjylbaMork4OVHPUVqV3AfLyI_fiRX4EKdKFmFOp31GdMQa2ZExf","reviewer_display_name":"Karen Stevens","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GiOkGWTqF0PkIgOayN5allgEIGJEw0jW5yz4W2rNg=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"I was highly satisfied with my overall experience with Transou Plumbing. Everything from the Call operator, scheduling, estimate, and installation was handled with professionalism. They treated me and my property with respect and even cleaned up! All the employees I dealt with were friendly, professional, and knowledgeable. I was thankful they were not dirty and dragging dirt into my house like I have had happen with other companies. I loved having the option of a courtesy text when the technicians were on the way.\n\nI will be recommending Transou's to every one I know from this point forward. Thank you for making this such a wonderful experience.","rating":"FIVE","review_reply":"Karen, thank you so much for taking the time to share your experience and we greatly appreciate the feedback!\n\nWe are happy that you received world class customer service from beginning to end and that's what we strive for with every customer, every time. Thank you in advance for future referrals and welcome to the Transou's family!","reply_update_time":"2021-03-16T18:04:17.192Z"},{"create_time":"2021-03-16T00:03:19.834Z","update_time":"2021-03-16T00:03:19.834Z","review_id":"AbFvOqkhxLT024z_MZrOSEv5ovehAs_qWJ1tANPSXPDyP_6Ifx7H6T4T3_iiRzdRM7LpszhGmKlaAQ","reviewer_display_name":"DJ Snow","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhgrKez1bcCZFe-RHaJCrR1mMe7TuppNSHF3KvLCw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Cameron and Austin did a good job clearing the drain and we’re very nice!","rating":"FIVE","review_reply":"Thank you DJ Snow! We appreciate your feedback and for choosing us! Welcome to the Transou's family.","reply_update_time":"2021-03-16T01:02:44.404Z"},{"create_time":"2021-02-26T10:08:54.266Z","update_time":"2021-02-26T10:08:54.266Z","review_id":"AbFvOqkUuPkk86QjkISaPsnZRaHoJnItRKf2gbMtr9A0b3edCbbY_MQ4bV0Auht07IQuxMwhaUkI","reviewer_display_name":"Ella Duplechin","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzl6VpyKKNd09RRpQHo7Ht3QMFEHP371SfAwOAy=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"It started with a small drip from a shower I was removing but that small leak wasn’t the only issue. Anthony and Austen came out a week later and repaired the leak and other issues my plumbing had. They did an excellent job and I no longer have dripping pipes and constantly running toilets. I also no longer have water filling up my tub when I shower. Awesome job you guys! Thanks!","rating":"FIVE","review_reply":"Ella, thank you for taking the time to leave a review and we are happy that we could resolve your plumbing issues! Welcome to the Transou's family!","reply_update_time":"2021-02-26T17:31:40.705Z"},{"create_time":"2021-02-24T18:58:26.372Z","update_time":"2021-02-24T18:58:26.372Z","review_id":"AbFvOqlVYQIUgIC2rJWO5dbvVbPOWw4CqM9r440w5J9ueu9nZ-kcH7YmINSxeDAJs_WE8JgjZmCPXw","reviewer_display_name":"Banner Real Estate","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GiMkcPVGL4m80Zh9Nr8JJjB5KmDy6yVtUn3IErCdg=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"What can I say! Cameron and Austin are phenomenal in what they do for Transou's Rooter & Plumbing, LLC. This is a top tier plumbing company that answers to the call of the consumer that most plumbing companies fail at. You will have a great experience and not question whether something will be done right because they will ensure its done correct.\n\nI contacted Transou's plumbing for a toilet installation. I had questions and wanted to get the best options available. Cameron and Austin effortlessly set me up with the right product and I'm in heaven :D As for turnaround time, I blinked and everything was done. Maybe 1.5 hours total that included them ordering toilet from warehouse, retrieving, removing old toilet, and replacing new toilet with new supply lines. I am beyond happy with the experience and they even assisted me with an additional issue I was having with a garbage disposal at no additional cost so... What are you waiting for? Contact Transou's Plumbing. You'll be glad you did ;)","rating":"FIVE","review_reply":"Thank you so much for the kind words and for taking the time to leave a detailed review. We are happy that you had a great experience and that's what we strive for every time! Welcome to the Transou's family!","reply_update_time":"2021-02-26T17:30:08.429Z"},{"create_time":"2021-02-05T21:03:10.784Z","update_time":"2021-02-05T21:03:10.784Z","review_id":"AbFvOqnKs3qyNPI2zvvAn3ccWROMcx_ikILqDKmfjNzNgSNtGtlYnOtJKA1sQTtdeR_L1Ltvq06MIA","reviewer_display_name":"Jeff Orcutt","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJw-Pzu8Ka1usnfswrWdQn9SW3Mbbn6ya8mbHgfp=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Michael and Mega were great. Megan kept me informed and Mike had the job done in about 30 minutes. Will call again when needed.","rating":"FIVE","review_reply":"Jeff, thank you for taking the time to leave us feedback. We are happy that you enjoyed the service we provided and that you will use us again in the future. Welcome to the Transou's family!","reply_update_time":"2021-02-06T00:49:20.123Z"},{"create_time":"2021-01-30T02:35:14.807Z","update_time":"2021-01-30T02:35:14.807Z","review_id":"AbFvOqlw1Akpad0_ERF1c-JYlXPp-Y4ImOkCgx1vMsR2lSrcg4M1M0s3687zKOavISDwQ53CgX2b6w","reviewer_display_name":"Sierra Thompson","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Ghq4_SM4Mi5CeiyVI-faBOv5ncxkGyO29t_lj-Z=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Tristian, Michael, & Tim were very friendly & knowledgeable. Didn’t leave until they got the job done. Would highly recommend for anyone looking for reliable plumbing service.","rating":"FIVE","review_reply":"Sierra, we love to hear from our customers! Thank you for the review and we are happy that Tristan, Michael and Tim took great care of you. Welcome to the Transou's family.","reply_update_time":"2021-01-30T12:41:58.517Z"},{"create_time":"2021-01-18T15:55:16.806Z","update_time":"2021-01-18T15:55:16.806Z","review_id":"AbFvOqk595eT8C8vT6m5RaOl9wXCkyN49EcRG1SHBXHjrXDRm6nb5IO1pmPD8UUChaXB_xx_oD4f","reviewer_display_name":"CS Carpenter","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJz6wqgfMQKdqE-f8O6OkRF5XFkeyNFBqDxMJJqo=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Austin and Cameron are great! Quick arrival, knowledgeable, and just great personalities! Had my kitchen sink drain unclogged in no time. Highly recommend 👍👍👍","rating":"FIVE","review_reply":"Thank you so much for taking the time to leave us a review! We appreciate your business and we are happy that you were pleased with Austen and Cameron. Welcome to the Transou's family!","reply_update_time":"2021-01-29T19:26:29.327Z"},{"create_time":"2021-01-07T19:52:13.936Z","update_time":"2021-01-07T19:52:13.936Z","review_id":"AbFvOqmX9Za5AOXDdTSnC24b-M1H0f_4jVbJxjcf_IsPuA2wdvd8f11cxXr8Es7Uec25O5nPdEt6og","reviewer_display_name":"Carolyn Tesko","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJx-BpUcXWzXcVSM1aVxjiigVXUb5cRrCajobS9m=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"We now have a favorite plumbing service! This company is great! When I called for help Megan was such a delight to talk with and she even made me laugh in the middle of a not so desirable situation! Anthony and Pete came out first to diagnose the problem. Tristan and Chris followed with the repair process. Everyone was so polite, informative, prompt, and helpful throughout the entire process. We won’t call anyone else for our plumbing needs and have already recommended you! Thanks guys for being so prompt and there for us! You’re the best!\nRob and Becky Tesko","rating":"FIVE","review_reply":"Rob and Becky, thank you so much for the kind words and for taking the time to leave us a review. We really appreciate it and helps our team and organization to grow and improve. Thank you for choosing and recommending us and welcome to the Transou's family!","reply_update_time":"2021-01-07T22:46:19.015Z"},{"create_time":"2021-01-02T02:51:58.525Z","update_time":"2021-01-02T02:51:58.525Z","review_id":"AbFvOqkCYnwddbtDMsLMr5ltfYkFbeiUOXSe3QITspi47wK51iBi0uOMLxSVzCKt5zqAzMddLs6YXA","reviewer_display_name":"Keith Holjencin","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GiR3BYE5Dc0gkh_66lntIc0uP-6BAA9SeCCwbLPBA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"We’re new to the area, and it is a relief to know that we found our go-to plumbers at Transou’s. Cameron was outstanding! He did a wonderful job at explaining what was going on and offering a few clear options on how to fix it. He knows his stuff, put in the work to get it done right, and was excited to walk me through it when he was done. Thank you!\n\nOur plumbing situation not only got fixed, it got upgraded.\nI understand my house and plumbing better because Cameron was here to fix it and help me learn along the way.\n\nAlso, shoutout to Megan who was awesome to chat with when I scheduled an appointment (so fast!) as well as in our follow-up calls.","rating":"FIVE","review_reply":"Keith, we appreciate your review and are so glad that Cameron and Megan took great care of you! We like to \"wear our customers like a backpack\". Which means, to walk them around and educate them on their plumbing system. We love to hear that Cameron put this in action and was able to upgrade your system so you have peace of mind moving forward. We are happy to welcome you to the Transou's family!","reply_update_time":"2021-01-06T19:31:54.145Z"},{"create_time":"2021-01-01T17:29:18.496Z","update_time":"2021-01-01T17:29:18.496Z","review_id":"AbFvOqk6XYmJxGqcrB-WlVZY42a3jjEfGpqXgVGF6GYQtb2kFxAIfIm05OXwZdnSHCfbKNqYyK7BQw","reviewer_display_name":"Rachel Breedlove","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJy0WCmLujK5NkF8Uwd6Uq3V-goPl3XT_745jscF=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I was very impressed with the level of professionalism and efficiency this company has. Once our needs were addressed, they quickly took action to schedule our repair. Without a doubt, this will be the only plumbing service we use.","rating":"FIVE","review_reply":"Rachel, we are so happy we could help with your plumbing issues. We take pride in giving 5 star service from the moment we answer the phone to the moment the job is complete. Welcome to the Transou's family.","reply_update_time":"2021-01-01T20:45:26.551Z"},{"create_time":"2020-12-19T01:43:39.894Z","update_time":"2020-12-19T01:43:39.894Z","review_id":"AbFvOqnGrjnmVGZfUmA_6XDLcfGY-3ZTrNLjARnYOBdnucZ-VHt35gpeUM46uH43vgz5gnPCqJPS3g","reviewer_display_name":"Lindsay Craven","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwOhWfo86IROBtyfCHoJNo4IDWoeDnn0R-Fxyig=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Transou’s Rooter & Plumbing made my first plumbing issue since purchasing our home so simple and stress free. I had the pleasure of speaking with Megan to set things up. She was friendly, thorough, and got an appointment set up in a flash for the next day. Cameron came out to work on our kitchen sink clog. He tells me he’s new to the company and they’ve found a gem in him as an employee. He was extremely helpful, friendly, and dedicated to fixing the problem. He answered all my questions and really educated me on what was likely going on and the various directions we may need take as well as things I can do to avoid future problems with the drain. He had the problem resolved within an hour and did a great job cleaning up. He even answered my questions regarding our hot water heater and got me a quote for that job within a half hour of leaving from the job. The pricing for today’s issue was very reasonable. I’ll definitely be using this company for my future plumbing needs. Don’t hesitate to give them a call - top notch customer service, friendly and honest staff, quality work with reasonable prices - these qualities still exist in our local businesses!","rating":"FIVE","review_reply":"Lindsay, thank you so much for the detailed feedback and for taking the time to share your experience with us. We really appreciate it and it helps us to continue to move and grow in the right direction. Our staff will appreciate you calling them by name and it really builds a sense of appreciation and pride in them outside of the kudos we give them internally. Thank you so much again and we look forward to helping you in the future. Welcome to the Transou's family!","reply_update_time":"2020-12-20T17:45:15.036Z"},{"create_time":"2020-12-16T20:20:15.692Z","update_time":"2020-12-16T20:20:15.692Z","review_id":"AbFvOqnh7YUakUbWO0-6JvP5LwqOfO42R_28n9uFDYoVfr_Nw04DJIrH_83JBcu8q5-sD9xRC3bNDw","reviewer_display_name":"justahamm","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Giw-sPNyUTAZldCYreSFBlzTsqy9bUOclr3K_vK27g=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Very happy with the service we received. Very professional, and kind. Even said hello to our pet rabbit! This was the second time I've used Tansou's and we will be using them again in the future when we have plumbing needs.","rating":"FOUR","review_reply":"Thank you so much for the kind words and for taking the time to leave us feedback. We also appreciate you being a repeat customer and for trusting us to continue to take care of your plumbing needs!","reply_update_time":"2020-12-20T17:38:52.150Z"},{"create_time":"2020-12-14T23:50:20.626Z","update_time":"2020-12-14T23:50:20.626Z","review_id":"AbFvOqmyFScU60Glhc0GnYL1iloFWFfy7-HBfhjxOuVbRNl-qATU1rPasyppTF66xc2rdZ_Ne-jEZA","reviewer_display_name":"Fletcher Bingham","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhHGsHEwoKT-whkwg7xUlPVtQ1bGFqID-jlyzhU=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Transou's Rooter & Plumbing was fantastic! I had a water heater that was rusted out. Turns out it was a custom size in a small space. They were quick in finding a custom sized water heater to replace the one I had, and came out to install it within a few days! Incredibly pleased with their service, response time and how professional the technician was who came out to install it!","rating":"FIVE","review_reply":"Fletcher,  we are happy that our team gave you exceptional service. We are thankful that we could locate the custom water heater quickly and you didn't have to wait long. We welcome you to the Transou's family.","reply_update_time":"2020-12-15T00:07:19.678Z"},{"create_time":"2020-11-19T18:58:36.763Z","update_time":"2020-11-19T18:58:36.763Z","review_id":"AbFvOqki2AZ1gEtn7IMvKMcTiDOcAmtjYViY3cgVMeGZQKY-dkd8V_Ea0CDTiRyFpZYEOVlqcUGTsw","reviewer_display_name":"Betty Hicks-Vanhoy","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gjd-AGMf2uQPM-yC2pWuYtr2B0x9wtEBYYHnyCrzQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Tristan was our technician and he was professional, on time and took great care of us!  Will be calling them again for my plumbing needs","rating":"FIVE","review_reply":"Betty, thank you for taking the time to leave us your feedback and we're very happy that you had a great experience  and that Tristan provided you with great service. Welcome to the Transou's family!","reply_update_time":"2020-11-19T19:12:46.727Z"},{"create_time":"2020-11-12T13:55:14.264Z","update_time":"2020-11-12T13:55:14.264Z","review_id":"AbFvOqm26U59XHlxdPY1hJ9Uqbfh_Ri5ZLiN8sannBeE46t1X2eTp6PpCOo_1Yf9bdNtdY2FYUjd","reviewer_display_name":"emily hendricks","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GixwAR6KeWR9iWPB3_6LXyg9AyeLro9JSwZ-5mhKA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Austen and Clayton came out to fix our bathrooms and our hot water heater. They quickly evaluated our hot water heater and determined we needed a new pressure valve. We also needed some new fixtures In our bathrooms as the previous owners just left them broken\/leaking. They were probably here for 2 hours total and set my whole family up with a working hot water heater, and 2 working bathrooms. If we ever have any plumbing issues we will be contacting them again because of how great they did! Thank you!","rating":"FIVE","review_reply":"Emily, thank you so much for taking the time to share your experience with our team! We are happy to hear that Austen and Clayton provided you and your family excellent service and that's what we strive for with every customer, every time!\n\nWe look forward to seeing you in the future and welcome to the Transou's family!","reply_update_time":"2020-11-12T14:21:21.308Z"},{"create_time":"2020-11-10T00:57:56.453Z","update_time":"2020-11-10T00:57:56.453Z","review_id":"AbFvOqmbPO3El2DJcRjpdwSluOulwWaRULanJm9wB0oQ_NsxrhPoDz99JdHlBBlLF4jWRfXTOk1Z0g","reviewer_display_name":"doha5961","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gib_4AO6Hjn1oW599pGXXN36cffN1UGeOvGEqRM=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Being a retired GC and the family DYI renovation source I run into all types of construction challenges.\n\nThis morning woke to find we needed someone to rod and camera our main sewer line due to backed up drains. I called 3  firms all with 4+ reviews but the phone coordinator with Transou  was the most pleasant, knowledgeable and offered the best price for the much needed TODAY service call.\n\nThe crew called around the estimated time given me and also text before coming. They arrived  prepared and had all the right equipment.  Their estimate was very reasonable and included both rodding and camera with photos. They quickly got the main sewer unstopped and helped determine the exact location outside of the blockage. We will need to replace the old Terracotta tile but for now we are able to use the sewer system.\n\nJob well done.","rating":"FIVE","review_reply":"Thank you so much for taking the time to share your experience in detail! Customer feedback is very important to us. We are happy that you had a great experience and we pride ourselves on great communication, having the tools necessary, and affordable pricing.\n\nWe hope to be your plumber of choice in the future. Welcome to the Transou's family!","reply_update_time":"2020-11-12T14:17:42.680Z"},{"create_time":"2020-11-04T21:05:51.611Z","update_time":"2020-11-04T21:05:51.611Z","review_id":"AbFvOqluWE0kIqhASgbZpH063NVixNPgWRF35Ccf4axpoa9U-S-03CMJQvrhA98c8N9pBMQ--F0AqQ","reviewer_display_name":"Ginny Beeson","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgefhYZDpdBvyNNZ9l3Wklsi1AGXurK11iuxQIf=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"After calling a few other people we found these guys. They came out same day and installed a new water heater. Great guys, very professional, excellent work, amazingly quick response. Wished we had called them first! Thanks Cody, Michael and Tim! Y’all saved the day for us!","rating":"FIVE","review_reply":"Ginny, thank you so much for the kinds words and for taking time to share your experience! We are happy that you found us too and that you were pleased with our service. Welcome to the Transou's family!","reply_update_time":"2020-11-04T22:20:34.984Z"},{"create_time":"2020-10-22T04:38:31.950Z","update_time":"2020-10-22T04:38:31.950Z","review_id":"AbFvOqkksBPx_QahbO7piY1jC1GhrRWWc8tw5Uf_aNIprzGIZ6DeShO1ENf32TvmcSiR_Rg-lL13","reviewer_display_name":"Jilly Hinckley-Noble","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgwI8RxH3pBNlrnsu7lHOdzP_NxVyYIIDgbgNFl=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"The service coordinator who took my call was pleasant and helpful. The service men arrived on time to provide an estimate. They were wearing soiled looking single layer masks. I offered them better masks and they said \"I don't wear those\".  What they were wearing offers the minimum protection, and that only if they are washed at least daily.   I am a health care professional and cannot afford to be exposed to these people.  I do not want them back in my house. I will pay the service trip fee and take the loss.","rating":"TWO","review_reply":"Jilly, thank you for your service in the healthcare industry and for the sacrifice you are making daily in these trying times.\n\nWe take our Google reviews very seriously and they directly effect our locally owned and operated business. We also take serious the safety protocols in regards to mask wearing and our employees are required to wear them. Our cotton masks definitely meet safety protocol with the CDC guidelines and you and our techs were safe.\n\nWe offered you excellent customer service nonetheless and we understand you have the right and choice not to use us for your plumbing needs. We ask that you please remove or adjust your review in fairness and respect to our great customer service we provided and respect for local family owned and operated businesses.","reply_update_time":"2020-10-22T16:32:45.698Z"},{"create_time":"2020-10-12T14:36:07.095Z","update_time":"2020-10-12T14:36:07.095Z","review_id":"AbFvOqlcmeJLxu2Qr3kamtmpsSb-CX-VCkrrlXwTC60ApHv24j88P31AigCiRLHIRH8O1CcQBnG2","reviewer_display_name":"Bart Williams","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzDLnV45svpD5eeRWpCQu6YoxGGFnK8ByfyDJFZ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"Bart, thank you so much for the rating! We appreciate your business and welcome to the Transou's family!","reply_update_time":"2020-10-12T22:32:43.583Z"},{"create_time":"2020-09-12T13:16:35.604Z","update_time":"2020-09-12T13:16:35.604Z","review_id":"AbFvOqnVrmmf9ehqJ4zZUr-JrnzHas6LlF38BhfHWN9RHOTIcxTmPJ8CEIBeqfIAQDkDRnum3_hH7g","reviewer_display_name":"Mary Lynn Birkedal","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwZjTC0K4WaGjxrTUcbki7L-k4Kak924UhQN-jz=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"From start to finish we were very pleased with the work Transou's did for us. We have used them twice to repair and fix our plumbing. Our technician, Michael, was very professional and worked very hard to figure out the problem and to fix it. He called each time to give me a heads up before he came as well as the office notifying me. From Brandon and Brandi in the office to Michael in the field, they are first class and I highly recommend them, and have to others!","rating":"FIVE","review_reply":"Mary, thank you so much for the kind words and we are happy to hear that you had a great experience from beginning to end! Thank you for choosing us again and trusting us to take care of your plumbing needs. We're happy to have you as a part of the Transou's family!","reply_update_time":"2020-09-12T14:38:33.132Z"},{"create_time":"2020-09-11T20:14:15.964Z","update_time":"2020-09-11T20:14:15.964Z","review_id":"AbFvOqnDIAZ64OLquT9U9zehdJFSaHfRYGl3LkA1caxTZnHyWHKPej-eJ-BvN28S0lLFlfk7gdY-xA","reviewer_display_name":"Nora Martin","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgVQ9TjTDeLSN2HEoY6Nnp_WirZ8MaC5SwjpX-b0Q=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Called on a weekend night kinda late, spoke to Anthony.  Got my quote and asked if he could come on out.  Said he was an hour away and would be on out.  He made it in less than an hour and did awesome work.  Really appreciated him taking time away from his family to come out late and he did a superb job of repairing my toilet in more than 1 way.  He replace the ring around the base, updated the hand held bidet fittings and replaced the toilet valve and fittings inside the tank.  Anthony, you are the best!  Thank you again!","rating":"FOUR","review_reply":"Nora, thank you so much for the rave review! It's great to hear that Anthony got to you quickly and took care of your toilet. It looks as if you had a great experience. What could we have done to earn a 5 star review from you instead of a 4? We welcome feedback to help us improve our customer's experience. Thank you and welcome to the Transou's family!","reply_update_time":"2020-09-12T14:36:23.864Z"},{"create_time":"2020-09-11T02:38:10.295Z","update_time":"2020-09-11T02:38:10.295Z","review_id":"AbFvOqm_0zVkL5db0cGdRt2NWb_gGg3wN14oVYQN_Up_AEthiThllksLp3WGcJjiF8gPaxMMh03EKw","reviewer_display_name":"Jerry Marrs","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwN4vY4H7316mEVJUoqY7aN1baEX17QlKktwLs0=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"They were fast to respond and very professional,would definitely use them again","rating":"FIVE","review_reply":"Jerry, thank you for your kind words and for trusting us to take care of your son's home while he is away. We are always happy to help in anyway we can. Welcome to the Transou's family!","reply_update_time":"2020-09-11T19:42:51.501Z"},{"create_time":"2020-09-10T23:57:08.305Z","update_time":"2020-09-10T23:57:08.305Z","review_id":"AbFvOqkYYr3PCL3-7CoK6fpe6jsG1kqbuDdP5-XQSeJNwaq8hTkYrZ4DoQWlgu1NlOMng7_jDDYNhw","reviewer_display_name":"bingaf5","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJy9UeYS101PdxSteFwaqrHzvpNcwn_51k7UzsN4=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Cody, the tech, came out. He was incredibly knowledgeable and very professional. He explained everything that he was doing and showed me how to use everything. He did great work and the pricing was on par! Highly recommend Transous!","rating":"FIVE","review_reply":"Fletcher, we sincerely appreciate your review. We are happy that Cody took great care of you and your plumbing needs. We hope you enjoy your new garbage disposal 😉 Welcome to the Transou's family.","reply_update_time":"2020-09-11T02:37:38.203Z"},{"create_time":"2020-08-12T19:20:19.139Z","update_time":"2020-08-12T19:20:19.139Z","review_id":"AbFvOqnYPc4tSUPNjYT_IdIqFNB7qu-bafEeu2-JD-_p80lUe6cAzydwwUKV1Gw5ucwdLOOhH2sy","reviewer_display_name":"Joel Vernier","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxZfoEHHUIgDs45AO8YmDaORxhuEXr1v0c_8hHJ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I use Transou's for all of my plumbing needs. The staff is knowledgeable, professional and extremely personable.  I am a real estate broker and I only refer vendors that I know will provide exceptional customer service and that is why I only refer Transou's to my clients","rating":"FIVE","review_reply":"Joel, thank you for the kind words and recommendations! You've been a great customer and part of our Transou's family for a while. We always look forward to doing business with you!","reply_update_time":"2020-08-13T03:26:22.581Z"},{"create_time":"2020-08-08T14:43:55.415Z","update_time":"2020-08-08T14:43:55.415Z","review_id":"AbFvOqmpFW1K3O0Tbj_rHYFPqIDLheJ0ncEoBQf5pdAn3OzMJgM2u7OprTyYk2eGKwoESPedsXNaow","reviewer_display_name":"Rodney Hill","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GghtIOiELZ7EydJRds1uxFKVi6h09DPpl6-eIUB=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Super friendly, responsive and competitively priced! Excellent customer service! Highly recommend!","rating":"FIVE","review_reply":"Rodney, thank you for your feedback! We strive to excel in the categories you mentioned and to make happy customers. Welcome to the Transou's family!","reply_update_time":"2020-08-08T16:30:08.359Z"},{"create_time":"2020-08-04T18:25:32.643Z","update_time":"2020-08-04T18:25:32.643Z","review_id":"AbFvOqm1zhhV5oo-CrOZAbcF1EcN30qg-SMnFOwg3foSMcUbV6JBqV5RXfANsAha8dtAGMM1BMvdGw","reviewer_display_name":"Fidelina Loeb","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gj37aJBczbze_9JdtlgXdhuv1ALg3-c04-DAy96cQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"Fidelina, thank you so much for the review and we appreciate you choosing us! Welcome to the Transou's family!","reply_update_time":"2020-08-05T01:52:07.815Z"},{"create_time":"2020-07-25T20:58:05.629Z","update_time":"2020-07-25T20:58:05.629Z","review_id":"AbFvOqnygUslDArY4Wu7TRI9odS838Ipix-YdtBZbyea7zj5nIWohNSBU9IcrRS-wFz75X2e61Tv6A","reviewer_display_name":"Dylan Crump","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxaD5VEocjb6KwQJS7aIWiGc5doj_Al4QKa1EKN=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"Michael is a true asset to this company.  He came by my house and took care of a plumbing issue in no time.  He was very friendly and has great customer service skills.  I’ll always call on this company and ask for Michael.","rating":"FIVE","review_reply":"Dylan, thank you for taking the time to leave us a review and we really appreciate the kind words! Michael is an asset to our company and we are happy to hear that he provided you with world class customer service. Welcome to the Transou's family!","reply_update_time":"2020-07-25T22:05:28.377Z"},{"create_time":"2020-07-15T23:37:27.243Z","update_time":"2020-07-15T23:37:27.243Z","review_id":"AbFvOqn0UIF2DcwVpaBnHIHDELeBBjJJot19LcalacfgZxv-rfdoK_s-0rv2ddHhTTSBaHC2uyHM","reviewer_display_name":"Julie McDowell","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxq4iCEFEuF6dnDv3MxC5RlzI04L4SIoTT7Twf0=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Anthony was awesome! Very professional and informative . I plan on letting my friends and family know about how great Transou's plumbing was today. Will use them in the future!","rating":"FIVE","review_reply":"Julie, we are so happy that Anthony took great care of you. We pride ourselves on AMAZING customer service and QUALITY work and we hear it straight from the customers mouth... we all smile! Thanks for recommending us and welcome to the Transou's family!","reply_update_time":"2020-07-16T01:35:17.823Z"},{"create_time":"2020-07-12T17:42:30.336Z","update_time":"2020-07-12T17:42:30.336Z","review_id":"AbFvOqkpiLzhk9WMOWyjR2PHd4kn3W7Wk6MN0Xxhiw_tRPZhi0Lm0JUwlngOgfUM8wph9BoXx-XlMw","reviewer_display_name":"Kevin Elder","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxmnWPlErcLyv2EbxdwRlGLxKgXlcGXQHOxRPFB=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Anthony was very helpful and friendly.","rating":"FIVE","review_reply":"Kevin, thank you so much for your review! We really appreciate it and we are happy that Anthony provided you with great service. Welcome to the Transou's family!","reply_update_time":"2020-07-12T22:29:32.128Z"},{"create_time":"2020-07-09T20:58:58.110Z","update_time":"2020-07-09T20:58:58.110Z","review_id":"AbFvOqnhL-4KGtvIK0-hVVflRi8Bbgfk4kHKSxyM2-mYxXbeXepFlCuX-oX9CwlwGL1uUeTmNnBs","reviewer_display_name":"Magnel Bascom","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwmQ-UgQKS7oHAvDH-ynr3lDKVlMOOI6jXJc6v1=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FOUR","review_reply":"Magnel, thank you for your review. We would love to hear how we missed the mark of receiving a 5 star review from you because we take customer feedback very seriously and use it for training and improvement. Please reply here, email us, or call 336-893-6516. We will also be reaching out to you for customer follow up. Thank you.","reply_update_time":"2020-07-09T22:07:06.537Z"},{"create_time":"2020-07-08T03:59:07.408Z","update_time":"2020-07-08T03:59:07.408Z","review_id":"AbFvOqn89MiUw_EyPnnGP78jsYu1I4YkJt3SWH2YuTYfT5lsRG9ZJv-lkTkHPb-jfuo4OIlMpENnHw","reviewer_display_name":"Karen Cauthen","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GijaR4W7M4w0KbwalAFOX9DcHFZcxDlmBWtjFwd4_M=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"We needed a gas line capped off in our basement that was being renovated. Anthony was our service tech. He was great, very friendly, and got the job done quickly and professionally all while working around our construction crew. He also, reset our gas appliances and removed the old gas pipes. Transou's Rooter and Plumbing gave us a great price and outstanding service. I would highly recommend them and plan on using them again in the future.","rating":"FIVE","review_reply":"Karen, thank you so much for the kind words and for taking the time to share your experience! We are pleased to hear that Anthony provided you great service and we are also looking forward to working with you in the future. Welcome to the Transou's family!","reply_update_time":"2020-07-08T10:55:29.577Z"},{"create_time":"2020-06-23T18:52:05.108Z","update_time":"2020-06-23T18:52:05.108Z","review_id":"AbFvOqkAWoWaMy_dGib4-4RT-WYk0ps6a3W2WIG2T6-8EcZf_yAbbUAWX477C7cX8uZeIY8UFTQa","reviewer_display_name":"Ebonie Atwater","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgNUVoi92GH7vmRC0dW--O5Ohrumk3VaIpx8BdKOA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"They do a great job! Everyone is very friendly and helpful! Michael goes over and beyond to make sure you what needs to be done without breaking the bank!","rating":"FIVE","review_reply":"Ebonie, thank you so much for the kind words and for leaving us a review! We really appreciate it and so do our future customers. We are happy to hear that Michael took great care of you and we look forward to being your plumbing company of choice in the future. Welcome to the Transou's family!","reply_update_time":"2020-06-23T20:06:48.181Z"},{"create_time":"2020-06-11T21:43:42.699Z","update_time":"2020-06-11T21:43:42.699Z","review_id":"AbFvOqm-VpCicp_E_cM4iCYIaSt9YBRVLmC_lIwCMz9N2Hlkvy4GRDaj9GPd9SGvAVNyjZmCOhZFCw","reviewer_display_name":"Angel Harris","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwvUr8B_is480j8PDy2yOUElNfpahOB_DGK-tu7=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I would like to thank Brandy and Her Team Michael and Cody for the professionalism and the dedication you all shown due to the unfortunate situation of our water heater system going out  this is a awesome family business that I would recommend to anyone that is having issues when finding a great company to manage your needs as well as being compassionate...Thanks again You Guy's Rock🎖🎖🎖","rating":"FIVE","review_reply":"So glad we could get your hot water back on so you could FINALLY get a much deserved hot shower.  Thank you for your kind words ( and the pop-cicles) Welcome  to the family, Angel.","reply_update_time":"2020-06-11T23:06:15.919Z"},{"create_time":"2020-06-08T02:08:29.667Z","update_time":"2020-06-08T02:08:29.667Z","review_id":"AbFvOqk1yvignUFZ8WC-VzOuVhFiSkf9MrhJmBowHws8aOr4aji7OuiJfW1d7rPlleax87zoNQOe-w","reviewer_display_name":"Statesville Equine","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJy7LxCCTp8iWOpfKr_z2_HTHPa9CCJ6qIgaBd44=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I usually do not leave reviews but the service was to good not to.  On a Sunday we had an emergency leak and had to shut off all water.  . Had called several other services but no returned calls. Called this business and phone was answered and at my house within 20 minutes and fixed the problem.  I ha e scheduled them to come out for more work and will use them for all my plumbing needs which will be quite a bit.  Being a business owner myself that also provides on call work I’m happy to say their response and professional presentation and quality of work is just as I except in my business.  Thank you for helping me out in an emergency situation and in turn I will you have earned all my business.   Thank you","rating":"FIVE","review_reply":"Thank you so much for your kind words and we are honored that our service moved you enough to leave a review. We are looking forward to working with you on your other projects. Welcome to the Transou's family!","reply_update_time":"2020-06-08T03:56:50.460Z"}]}