{"totalReviewCount":55,"review":[{"create_time":"2022-06-18T09:31:56.587285Z","update_time":"2022-06-18T09:31:56.587285Z","review_id":"AbFvOqkzjAoHABcdEIAe4N2wxnqGe_tfTSy2bho4NIdeyTtksi7sN5nJKwhvN1rRQ57lktjIgQoeOw","reviewer_display_name":"Mouda Mohamed","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnkeFuj7Vm3-o27GRWBC5A_FOAZ6YlQP4rxqWk1=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"Thanks Mouda!","reply_update_time":"2022-06-21T09:10:50.787608Z"},{"create_time":"2022-01-29T23:55:34.451874Z","update_time":"2022-01-29T23:55:34.451874Z","review_id":"AbFvOqnQ91Vhh5KdP3uy5aCE0YVki3HF8i5qSOaEVGuHPOq5bX6rqUWyBN8busucRU_iJaQ26NFbNw","reviewer_display_name":"Mo Basit","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpTfuTA5dEmRzDKyhudYelmTxIJWtzIW9jTe8Jq=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I actually like this college because when I was studying digital media, it was so fun doing it.","rating":"FIVE","review_reply":"Thank you Mo, we're very pleased to hear it!","reply_update_time":"2022-01-31T09:16:44.707560Z"},{"create_time":"2021-10-01T01:55:46.259052Z","update_time":"2021-10-01T02:15:54.070936Z","review_id":"AbFvOqkhalUXrvPLVfIzBT7T8BMW2M8TAf93gO9Gjv-WKMzRIyTV12jcTCo9lJ-AvZ01WY4nNp0V","reviewer_display_name":"Angelica Karenina","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlDQQiwy3UvorM-FlRubrdE7lCvJDztw_73BFma=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"KEEP AWAY FROM THIS COLLEGE, POOR EDUCATION.\nThe teachers have to be more prepared in acknowledgment about the subject to teach other people, they have to leave aside preferences because I noticed they discriminate some students. I am really disappointed and wasting my time. I did not complete my study due to a teacher (black woman) unprepared to teach properly and lack of professional behaviour.","rating":"ONE","review_reply":"Dear Angelica,\n\nAt ELATT we believe in the essential equality of all peoples and are proud that our students and volunteers come from all around the world, representing hundreds of cultures and backgrounds.  We know following the feedback of hundreds of students every year that our teachers always make every effort to treat each student with an equal respect and support.\n\nWhilst we will always accept feedback in good faith as a vital way for us to improve, we must state that in this case we are concerned as to the nature of your complaint.  It is unacceptable to form an opinion of a teacher, their ability and their attitudes based on the colour of their skin. It is for this reason that we are unable to offer you an alternative class.\n\nShould you wish to pursue this further, we have emailed you our Complaints Procedure showing you how to do so.","reply_update_time":"2021-10-12T09:38:10.099685Z"},{"create_time":"2021-09-11T23:50:47.692363Z","update_time":"2021-09-11T23:50:47.692363Z","review_id":"AbFvOqmTozHQuSMBesjqkBhztDVURVLykRsfUSnufwnh59Pj20qN1C9mEWaB8zfDEDiFxzV-Os7OoQ","reviewer_display_name":"Raphael","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkvrDN4lcOwYakbHwYYkBsBvPEQDhRkcsHt8IrF=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"Very good experience, first course  at  Elatt and I hope more to come.\nVery good communication, my teacher was patient, expert and friendly!\nSubrata really made the effort to include everybody and answer all our questions. Thank you very much Subrata and  Elatt!","rating":"FIVE","review_reply":"Thanks Raphael for this review and it's great to hear you're enjoying your experience at ELATT!","reply_update_time":"2021-09-13T09:38:38.418094Z"},{"create_time":"2021-08-15T19:21:36.618766Z","update_time":"2021-08-15T19:23:43.535813Z","review_id":"AbFvOqna5cNv06O2hKIXps1PpLsNezSUU_dengTgliH2eajhRsO6U2eWbEzaRWNijKgUbpSY3JNnLQ","reviewer_display_name":"Lynda","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucqNQ00rxiaFnUHLzudm6XNtS0WVqxgT0STmkWK8GQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"If you want To develop your english language and learn in a great atmosphere opt for ELAAT","rating":"FIVE","review_reply":"Many thanks for this review!","reply_update_time":"2021-08-16T18:31:05.403373Z"},{"create_time":"2021-08-13T13:36:01.819298Z","update_time":"2021-08-13T13:36:01.819298Z","review_id":"AbFvOqnE_-HOEPgXS6iwcHuytiIcN4_W97VVkYfgT14erJsGOuYTW4RffdMi5JDrpus6Lb7g2ui7Iw","reviewer_display_name":"Abdulkerim murad Abdurahman","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnuO0ITsWPbgoGDko2AdZEcObAKjQazVNrPYEqqPA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I started studying at ELATT in 2019, not long before lockdown. I thought it was going to be very hard to study at home but everyone at ELATT helped me out. At the beginning, my English was not very good but thanks to the Teachers and TA’s I made a big progress.\nThe environment at ELATT is very nice, everyone is super friendly and I made a lot of friends.\n\nWe did a lot of fun projects. My favourite one was the one we did with Laura from London Wildlife Trust at the Walthamstow Wetlands. We learned a lot about nature and helped to do some work around the garden. I also really enjoyed doing a film about homelessness with Emilia from Odd Eyes Theatre, and taking pictures of the community is with Lucy from Headliners.\n\nI have been studying Business IT and have just finished my level 2. Thanks to what I learned at ELATT, I gained more confidence and it helped to get my first job.\n\nI will miss my time here!","rating":"FIVE","review_reply":"Thank you for sharing your experiences, this is wonderful to hear that you've learned so much during your time with us!","reply_update_time":"2021-08-13T21:16:44.864204Z"},{"create_time":"2021-06-22T20:34:11.267623Z","update_time":"2021-06-29T01:28:55.552429Z","review_id":"AbFvOqmnmqNPvnIoDWUQwtDj8XQy4tKUSIY1slK0FFCy8afYTqjo2dhXlpBHj601NBHUW_rE0GHh","reviewer_display_name":"Nadjia Bouzidi","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkg5Oc1DByselzE8KnvMqNFEgfaA93y6Txqv4tq=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"ELATT is one of the best online learning centre, I came across. It gave me  the opportunity to master IT Level 2. After I was really struggling to send an email.\nI am and will be grateful to ELATT for the whole life. The team is caring and sharing thoughts with the students, great communication between ELATT and their students. ELATT helped me get a job after I left my previous one.\nThank you ELATT and thank you very much Team ELATT. I am doing ITLevel 2 Cert,my tutor is Sayeed Zamil such a wonderful teacher after I was really basic at IT he taught me with simple words and methods how to master microsoft  Excel and PowerPoint in a very challenging time. I started the course in March 2021 and I am at the end of it. Sayeed Zamil is one of the best teachers I came across, he is very patient, helpful and positive. I would recommend him to any person who struggling to learn how to use a computer. Thank you Mr Sayeed Zamil for magnificent teaching qualities.","rating":"FIVE","review_reply":"Hi Nadjia, thank you for your review, we are so glad ELATT helped you get a new job!","reply_update_time":"2021-06-23T09:31:22.102763Z"},{"create_time":"2021-06-24T20:21:26.614433Z","update_time":"2021-06-24T20:21:26.614433Z","review_id":"AbFvOqlar-pKQnk7auFEuTfsSXJ1cApm6YOcnuqJ2IvSmrdst-hgzhIKGdy9S47oePROxZEk1go54g","reviewer_display_name":"Shelina Aziz","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkiNq6zV5xV615JitcQX39ZAYq3SNh1N0Xtkeah=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"during the pandemic I have been doing online ESOL classes, my teacher is very supportive, kind and patient, Isabella and Liz. They have explained the English course in so much detail my English is improving. I enjoy connecting with other students who are just like me in same position in these online classes. We do class activities and its very interactive. We learn a lot about daily life and about each others cultures. This is very helpful and I had no idea learning will be this fun.","rating":"FIVE","review_reply":"Thank you so much for your feedback Shelina and it's great to hear that you are enjoying your course.  We'll be sure to tell your teachers!","reply_update_time":"2021-06-25T12:47:38.053078Z"},{"create_time":"2021-06-22T13:36:42.291814Z","update_time":"2021-06-22T21:50:53.805654Z","review_id":"AbFvOqmWC11ddg1GLRvv_7AymnfUG228_U3mbkrg8wbwHFkpqRQiP8fCmT0oUWR8akoHR8WJ_et5UA","reviewer_display_name":"Karima Lachab","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrN4u5RHE3ue0BNXYMT31EzKm1cEj653VekB8mx4g=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I would like to highlight something important. I was really dispointed by Elatt centte. Last year, I enrolled for Digital Media course. Once I have passed the test and paid for the course, they put my name on an IT course which I didnt ask for. When I complained over the phone, they refused to correct their mistake.As if they pushed me into this course. It was n't professional. I was really disappointed and mislead by the staff. I will never go back there and will never recommend it to anyone. It was really a bad experience.","rating":"ONE","review_reply":"Hi Karima, many thanks for your feedback, and we are very sorry to hear of your negative experience with us.  It does happen that from time to time that we are unable to run a particular course (for example, if there aren't enough other students to run a particular course at a given time, perhaps evening or daytimes, that a certain student can attend), and when that happens, we will offer the student an alternative course instead, usually the course that the applicant stated would be their second choice. We're sorry to hear on this occasion that we couldn't offer you an alternative course that you wanted.\n\nWe must clarify though that all our courses are free: the only students who we have charged fees to in the last five years are adults over 24 taking a Level 3 course, where the government requires them to take a student loan called an FE Loan. We have not run any courses since 2014 where a student would need to pay in cash at all. If you think this is not the case for you, please get in touch through our website and we'll be happy to look into it.","reply_update_time":"2021-06-22T22:02:12.670014Z"},{"create_time":"2019-11-26T19:32:40.987438Z","update_time":"2021-06-22T14:35:00.986658Z","review_id":"AbFvOqkG838hrEqd4_O8D6qLr298VwHrjN4eEK729WcIH9iLt_7nIHZhTLYG7z23G96zxsaaRXTKvA","reviewer_display_name":"Thaygla Rhaitza","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucr4MnuBUu8dj09m3XEf5UW2yqpTdH7Z5Q3OCkCOAw=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"Being a Elatt student was the best thing that happened in my life since I first came to London. The support provided, the kindness and respect from teachers and staff made me feel belonging again. I have learnt so much. When the lockdown came through,  I thought it would stopped the classes and fortunately I was wrong. Online classes stared to be our reality. Our lovely teachers provided much more than ESOL classes, they gave us daily hope, guidance to still planning our future and don't give up about our goals. I got my first job later on. I got confidence to speak and write in English. However I got an deep gratitude to this organisation that could never be measured by this simple review. I just want to say that if you are looking for a course to do that would improve your  professional skills, don't think twice. This is the place.","rating":"FIVE","review_reply":"Hi Thaygla, we are so delighted that ELATT helped you feel like you belong, and that online classes kept you going throughout lockdown. Thank you for taking the time to review us!","reply_update_time":"2021-06-23T09:34:47.433170Z"},{"create_time":"2021-06-22T13:15:04.218457Z","update_time":"2021-06-22T13:15:04.218457Z","review_id":"AbFvOqmmRPwMX_mxD0ohGfgyZPrJAhOrRSfQ699RJGVtUsXZ4MHzL8x8qRFeQell554HA7tBIM-g","reviewer_display_name":"Amina Nur","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkiNVXEewMOH5hh6pOBdJMj6hxDUL5aZGPaFFU=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I like the way that they taught me English and I would very much recommend this service to anyone who need a to learn English :)","rating":"FIVE","review_reply":"Many thanks Amina for this feedback, it's great to hear that you enjoyed your course!","reply_update_time":"2021-06-22T14:20:27.382356Z"},{"create_time":"2021-06-14T12:47:49.070202Z","update_time":"2021-06-14T12:47:49.070202Z","review_id":"AbFvOqlBAR-lghH1jfBk4Ssi8y_Wmere3F5rmlvMgcyK4SPaoG5byB1ToC3elTsFeYHJ6jj53LAd","reviewer_display_name":"Vlad Spisak","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlJgJUAQAOd8m-ZTyHDpcmiPjScTNF6Eb-X7LiP=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I'm currently studying Level 2 of Web Dev at Elatt. This is my first experience with distance learning and I have to admit I was sceptical when we started in September last year but it turned out to be absolutely fantastic. The amount of extra information and most importantly support I received from my tutor was second to none and kept pushing me forward. I can recommend it to anyone that wants to start their journey with coding.","rating":"FIVE","review_reply":"Thank you so much Vlad for sharing this brilliant feedback.  Good luck with all your studies and your future career!","reply_update_time":"2021-06-14T13:43:39.984204Z"},{"create_time":"2021-06-03T04:08:00.523730Z","update_time":"2021-06-07T15:34:11.613944Z","review_id":"AbFvOqk2yaZvuyCj7-3Z0skpPOssboJgPKJuI-cMX2YZsLKlmp5LEmNUFS7xpt8gMPY-fKiLj9DA1Q","reviewer_display_name":"Mohammed Ali","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrqTSr2GlX2MNvbWeC_eXNZYVjRPO_66aUOBdO-Kw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I've never completed a course like this before (remote learning) and I cannot express how great the tutor. I would definitely recommend ELATT to my co-workers as well as friends.\nI was not sure what to expect because the class was taught remotely, but I was quite impressed with the entire process.\n\nOur teacher is an expert and very clear in his method of teaching. All my questions were answered and the class interaction is very good.\nThe class is awesome! Our teacher spoke very clear and he is very knowledgeable and patient.\n\nIf I ever need additional training, ELATT will be my first choice!\n\nThank you","rating":"FIVE","review_reply":"Dear Mohammed, this is so wonderful to hear!  We're glad to hear of your positive experience and wish you all the best with your career.  Hope to see you in another of our courses in the future!","reply_update_time":"2021-06-03T09:46:09.333345Z"},{"create_time":"2021-06-07T14:51:20.113321Z","update_time":"2021-06-07T15:19:00.182344Z","review_id":"AbFvOqnJ5Jy72P4AAQBrCUzN1v1smjCQdTmjCfldxjzaQZkBPXHNnzQfNAO5qdC138M7U7kXn3Ec","reviewer_display_name":"Mohammed Ali","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlhc8nrIiiCLMwshWOyrtXSBWbgewbd862Fk-Lv=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Thank you ELATT & the team & the tutors.","rating":"FIVE","review_reply":"Thanks Mohammed!","reply_update_time":"2021-06-07T15:07:42.782005Z"},{"create_time":"2021-03-01T10:54:35.237133Z","update_time":"2021-05-18T17:28:56.889095Z","review_id":"AbFvOqnS6iM6TgqPHh5NVnEp8ed7-06kayQt1KM4cU12bsxfen3_7glpyiwDF9Nz4ySaMzzGGY2S","reviewer_display_name":"Veronica Senis","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrBf5rr6qvHwHvWf85LmpK64eGkZVNHzCWs_rBXlho=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"I decided to change my review following recent events!\n\nI started the level 2 Web Design and Development in mid-February and never missed a class for the duration of the course.\nI recently found a job that does not allow me to attend any more classes.\nThere is only one month left at the end of this course and because I have already finished my portfolio for the final exam,  l kindly asked if I could still “graduate” and get my certificate.\nConsidering I have always attended and have been consistent and I also managed to finish my project a month in advance, it seems a little bit unfair I will not be able to get my certificate. I worked hard for it.\n\nYou should help those who are studying and working at the same time, especially if they are students who have always shown interest and met all deadlines.\nI thought you will support and help those students who finally got a job after this long lockdown.\n\nYou are not giving me another choice and it’s financially impossible for me to choose to attend this month’s classes over my new job.\n\nI am very disappointed with your attitude, there are other people in my class who have made a lot of absences but will still be given the opportunity to finish this course.","rating":"ONE","review_reply":"Hi Veronica, we're sorry to hear what happens and understand we've been communicating with you to aim to resolve this via your Trustpilot post.  Do get in touch if you need anything.","reply_update_time":"2021-06-03T10:06:46.146829Z"},{"create_time":"2021-04-02T23:24:02.681608Z","update_time":"2021-04-02T23:24:02.681608Z","review_id":"AbFvOqksbMCSn26U4RJxSshrhOsnbi1et1jWeEeCdZe9w2BCOGyoPIkENttT8pEu0w1b429h0tCuEA","reviewer_display_name":"Margarita Tsigka","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmn3TF7wldtIcJt2uqgSjz4mCH2MWXZevgXcuvAN=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"Thanks Margarita!","reply_update_time":"2021-04-06T11:16:23.837733Z"},{"create_time":"2021-03-02T17:40:27.567867Z","update_time":"2021-03-02T17:40:27.567867Z","review_id":"AbFvOqn8_rYXCUl_xFWjrmBgebOcMmXlhUjvQoc5hzPJhs-4M-N-MSomUXYu6zYTSRWQiNCSvs6rAg","reviewer_display_name":"Birdie Brietling","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpqvkMml3m184GY_RCeBH-fCS64YbbN3ZnhYtPwYA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-03-02T17:16:50.350637Z","update_time":"2021-03-02T17:16:50.350637Z","review_id":"AbFvOqmPsrjp7B1q2-1FJZNy3cSF-RU7cNYaq_2ot7jkYouTWXPTDDAvfn3jVZPfFwDU4hBBBHd2sg","reviewer_display_name":"Md Haque","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucp02kFdY9Z1CNH_5nqrDVG8m4V9A7A4O00btVleBg=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Admin is excellent to communicate with student. I am from Web development Label 1 2024 course. Our teacher Subrata was amazing to teach about course content. He is very well known, what he is teaching. Easy to understand, flexible to us. So happy for what I am learning now from ELLAT.","rating":"FIVE","review_reply":"Thank you so much for this feedback and we will let our wonderful teacher Subrata know!","reply_update_time":"2021-04-06T11:18:56.468803Z"},{"create_time":"2021-03-02T11:35:20.534918Z","update_time":"2021-03-02T11:35:20.534918Z","review_id":"AbFvOqkuxcxNB_wl2BDFhjXtPAqsqmQrsDQqJurPYL20a2pHDWPGKfci-5AdlA3W-EG55jUJn_hnBw","reviewer_display_name":"Nao Ish","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpsMnSVYjlc13x_f42078KvbTvq6MY_dSxILcmovA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I have just completed and passed City & Guilds Level 1 Web Design & Development course. I had no prior experience 3 months ago but I can now create a website with html, css and basic java script. The tutor and other students were very supportive and I could not have achieved this without this course. I hope I can carry on to finish Level 2.","rating":"FIVE","review_reply":"Congratulations on achieving your qualification Nao, we're sure there will be many more to come!","reply_update_time":"2021-04-06T11:18:28.929341Z"},{"create_time":"2021-03-02T10:52:15.273096Z","update_time":"2021-03-02T10:52:15.273096Z","review_id":"AbFvOql3Ihw4x5Ycy5CYUen-ph4ggfaUKMXCPehwGrISjnL6uElYwsjxf_V3WBpJvXHOsvp7_qq56w","reviewer_display_name":"Anne Work","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmk4Y1x2yuZG8E3YwU_Ue76nJXWq4GMRzF16a2Fy=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I love attending this education centre, I am able to attend class and learn a lot in such a short space of time. My teacher generally cares about us and really encourages everyone in the class to want to do well. I am more confident with my perusing my career because at Elatt we have been producing high level good quality work. I am so grateful for this service especially because I have never found learning easy and Elatt makes it easier for me","rating":"FIVE","review_reply":"This is such wonderful feedback to hear, thank you Anne and good luck as your studies continue!","reply_update_time":"2021-04-06T11:17:53.826896Z"},{"create_time":"2021-03-02T10:34:59.315012Z","update_time":"2021-03-02T10:34:59.315012Z","review_id":"AbFvOqmVzpXRn3sGPNJExj5NWS_3a7h_ZvPLNcxpIAgOIwNO1fl1BWNR7lMnvC3DOVeM_rsYajIDgw","reviewer_display_name":"Bahar Karapinar","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkFedMBO5GN0f5Wf3ixXG0NHTGMkpy60UTY_G67=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I been studying with Elatt I have been learning a lot and I am still studying I am sure I will learn more Thank You Elatt","rating":"FIVE","review_reply":"We're so glad to hear it Bahar, and good luck with the rest of your studies with us!","reply_update_time":"2021-04-06T11:17:27.191776Z"},{"create_time":"2021-02-23T15:39:40.567488Z","update_time":"2021-02-23T15:39:40.567488Z","review_id":"AbFvOql4M7GjdQG4Mqj7FZHwfGxBLDNsLBNuUM8XE4kP81t4mPq-tJYKM7FPHMZX2pkI2nyGyzhQEQ","reviewer_display_name":"E","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmk88rwAi8Ar-SfebeOZLYf6zdI6Gv5UmOtze4p3lA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Phenomenal course! Our tutor did such an amazing job at teaching us and was very passionate about ensuring that we understood every unit on the Web Design Course. I would highly recommend this course to anyone who has an interest in tech!","rating":"FIVE","review_reply":"Many thanks Emma for this wonderful feedback and it's great to hear how much you have got out of this course. We'll be sure to let your tutor know, and good luck with the next step in your career!","reply_update_time":"2021-02-23T15:55:42.597210Z"},{"create_time":"2021-01-30T08:15:18.808394Z","update_time":"2021-01-30T08:15:18.808394Z","review_id":"AbFvOqnmheIqXfQ49HtFphYSpYN3dffU_s6jCmLl49gH1L4KoO4v3gpwn7cLDf_6aY7V1JoRqgu8lA","reviewer_display_name":"Aynur","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmlRKu6wHFNBjw5BGQFDY9R3KWJaigYrLTSFOAbiWw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-01-23T14:24:35.807490Z","update_time":"2021-01-23T14:24:35.807490Z","review_id":"AbFvOqkHkKs0WF5xZJBWCnfRPoqo3uE-Nu6-NjT7PNA1DhD_KS7gcgYMIDZZIWXb1Lx1HOTLLG4xkg","reviewer_display_name":"Souad Foulani","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZuco4swMQdMGLrntn_lLKM2RHrgjBGvXmzXEmTshLGA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FOUR","review_reply":"","reply_update_time":""},{"create_time":"2020-12-21T20:47:32.494704Z","update_time":"2020-12-21T20:47:32.494704Z","review_id":"AbFvOqk6kcnOUqtlwDz_YAuCYSTlm6gV5LkbypkVr15YkXltlr3j3OihUhL2QmI3EC4vPWbRT8KzVA","reviewer_display_name":"Susan Mir","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpIfUllx436XeQPUraQcJM-AVVfkwrxWpQWwPMetQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"Thanks Susan!","reply_update_time":"2020-12-22T12:19:42.469214Z"},{"create_time":"2020-08-26T10:46:43.456540Z","update_time":"2020-08-26T10:55:29.445524Z","review_id":"AbFvOqkZ1abN8Ir5rMUHkGrlno0IFyUthUXCjh9o69clmUhazpd7MifvKtisYxc8BIcRwJZFzkocsg","reviewer_display_name":"Alfie Lewington","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpJqivPSZLZ2iY5s50St7_2YBPjICtmzf4omy6LzA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I have been studying at ELATT since September 2019 and I couldn't be happier! The teachers are friendly towards SEN students like me and are always a pleasure to have around!\n\nBut in March 2020, London was put on lockdown, meaning we couldn't go to ELATT in person. That meant every lesson had to be online. However, there were a few problems. Firstly, my tech lessons required a Windows PC, but the only laptop I had was a Chromebook, so I wasn't able to perform basic Windows tasks, such as Disk Cleanup or typing basic commands in Command Prompt.\n\nI did get a new laptop, but on the first day, it seized up. Nothing was responding, the Start menu was crashing on it, and I couldn't access the Defrag program. It wouldn't even run Webex and Edmodo at the same time, so I had to do most of my Webex sessions on my phone!\n\nIn June 2020, I decided enough was enough. I asked for ELATT to give me a laptop on loan, but never got it in time. I asked my family members if they had a laptop I could use - thankfully someone did! I upgraded it with an SSD and new RAM sticks for optimum performance.\n\nI hope to come back in person this term!","rating":"FOUR","review_reply":"Thank you so much Alfie for your review and we're glad you were able to keep studying throughout lockdown!","reply_update_time":"2020-12-22T12:20:56.526369Z"},{"create_time":"2020-07-24T13:33:55.665673Z","update_time":"2020-07-24T13:33:55.665673Z","review_id":"AbFvOqleDlmQNoFu1W-uq0umXt8hBy0DCokzvblCXR7jbaCZIg0OKm7xvTDpRpUuA2O14swsBzcB8w","reviewer_display_name":"Adnan Tanmoy","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucr3Zd51K-vjyS89z0vQ29AMDKjwbAj50apTZfotsA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Lockdown review my own experience\n\nI writing this review to talk about my experience studying at ELATT during lockdown.\n\nLockdown has been very difficult for me but everyone at ELATT has been wonderful and very supportive. This applies to the admin staff, the technical team, the TAs and the teachers.\n\nSince lockdown I have been able to continue my studies in a whole new way and still carry on in order to get my qualification sorted and ready to take a next leap of my career. I have been having regular timetabled online sessions every week. The teachers teach as if we are in a real classroom. I was really worried about how I was going to continue my studies. Although it is not as good as being in a classroom it is still very good.\n\nI haven’t liked lockdown because I wasn’t allowed to meet my friends or go to any other people’s household which made it boring for me. But because of my online lessons during lockdown I have managed to socialise with my friends at ELATT as we are all in a meeting together. This has been very good for my well being.\n\nIn addition to our normal lessons, ELATT gave us the opportunity to work on online projects with London Wildlife Trust and Headliners. I have to thank Laura from London Wildlife Project for teaching us about the environment and for letting me write a blog. I also have to thank Lucy and Zahrah from Headliners for helping us create podcasts and learn about journalism. We finished the year by going on a Wildlife Action Day to Woodberry wetlands where we learnt about wildlife conservation. It was really good to get out and meet my friends again and also to see the swans and other birds.\n\nI want to finish by saying that although lockdown hasn’t been the best experience for me, ELATT has helped me so much to continue my studies and to help with my mental well being.","rating":"FIVE","review_reply":"Thank you for this wonderful review Adnan and all the effort and commitment you have put into your studies!","reply_update_time":"2020-12-22T12:21:32.069196Z"},{"create_time":"2020-07-07T07:33:45.872114Z","update_time":"2020-07-07T07:33:45.872114Z","review_id":"AbFvOqkISO4dYFufkqyEswAFyi1S9xUmGVTklPnWKRN6vO9JNZwvmuBS8vvEJjOOZpp23ad1oPaemQ","reviewer_display_name":"Desislava Sued","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucqbH9xVw1MATyN1sBsnLiHqfrFtZP7_Nw15z2LLNA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-06-30T22:17:02.539723Z","update_time":"2020-06-30T22:17:02.539723Z","review_id":"AbFvOqn0y_J4TxSfGP7ADnogndGh73m4AU7J4GxUVZpVaQT_eSNrJl70IBLYXO6JUQ0SdYbkiYO0OQ","reviewer_display_name":"Mel Dincer","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpuG8VCsyjnntYnK9Nqp9TPUqv8HAC-m4rdH6ew=s120-c-c0x00000000-cc-rp-mo-ba4-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-06-29T13:50:59.552958Z","update_time":"2020-06-29T13:50:59.552958Z","review_id":"AbFvOqmGarJeAYLiIXutYjaDFPw-GmOr8RnlHzRrzCMfvqGc3wUJYo6F-1FQFie4hn7aMWhg09FqYg","reviewer_display_name":"Shohel Ahmed","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmnjBGSEQhZHw2suV4hmTXuxzUD9isQV0ZE4jEKQw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"My experience with elatt isn’t great at all I understand we under the pandemic that should be a lot easier to give support from home via video call but no support I lost all respect for this agency I have email the teacher and spoke to the receptionist to send me the work sheets by email but they chose to ignore me.","rating":"ONE","review_reply":"Hi SA,\n\nWe're extremely sorry to hear that your experience with ELATT was not as expected.\n\nWith the introduction of the pandemic, we've been working hard to strategise and adapt from providing a classroom-based training experience to an online-based one. Though the change may seem straightforward, it involves changing the whole workflow of how we operate across ELATT as an organisation, so unfortunately there are occasions where there may have shortcomings, but we're working as hard as possible to ensure our training grows to achieve the standard we and our students expect.\n\nIn your situation, we apologise if the communication between yourself and staff hasn't been as expected. Please feel free to try contacting our receptionist again to discuss this and we'll try our best to fix things from there.\n\nBest wishes to yourself and others during these difficult times.","reply_update_time":"2020-06-29T15:11:30.166717Z"},{"create_time":"2020-02-09T00:14:39.686317Z","update_time":"2020-05-31T16:49:18.391069Z","review_id":"AbFvOqmjEKkUPtdjIZM_NGSwhEerzVbx5tFGafSV48tOhboLILLEow9AFPhfY-1o021nHH9O9nm-BQ","reviewer_display_name":"Coratrix","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZuco8JFzOoP1YXH-3FMIcVHJrj6XwNgqbLMIvlcMvmA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-03-10T22:12:08.399812Z","update_time":"2020-03-10T22:12:35.166433Z","review_id":"AbFvOqn17lvxy9Fb62trQIrZ1Gdv3QzZDNCCxSGYzQDKQjtO_sGIUqHwG_Fo6GxV_MbXzLpSP7epZA","reviewer_display_name":"Carlos Yehuda Lopez","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucoxtGF7WwrhAL97TFTHuYfzxiNJRTWyP0EfFeIu1w=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Just what I was looking for...","rating":"FIVE","review_reply":"Thanks for the feedback Carlos, that's great news","reply_update_time":"2021-06-03T09:48:43.118434Z"},{"create_time":"2020-02-11T16:24:26.149485Z","update_time":"2020-02-11T16:24:26.149485Z","review_id":"AbFvOqlZn8WBSDmWAnZbstaMGxmLLIWwlmF1SOg_3Yl9HAa_sKCutThcaQg54LvTYZq-2iF_ulY-","reviewer_display_name":"Sajidul Islam","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucqH9-IqvM0jTVklV6E-j_PHk924bk8KpqcOQkaY=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-11-09T10:44:16.627019Z","update_time":"2019-11-09T10:44:16.627019Z","review_id":"AbFvOqnr3IWg-1RpMzkpGtgptS_N6gpU09ejHxqX6HHDCB_DEHpW7ipMmTlweWZgjedDyQs3pBn_Ew","reviewer_display_name":"Jose Contreras","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmk-YFyWfgZjmnEvBzMZdrTDfxolMetZ51gFQs7=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"\"The staff and teachers are helpful and pleasant to talk to.\" ???\nIT IS NOT TRUE\nKEEP AWAY FROM THIS COLLEGE, POOR EDUCATION.","rating":"ONE","review_reply":"Hi Juan. We're really sorry to hear about the negative experience you've had during your learning at ELATT.\n\nWe'd be really interested in hearing more about why you felt like this, and how we could help in this situation to ensure our services are the best they can be, including for our future learners.","reply_update_time":"2019-11-09T14:13:33.297793Z"},{"create_time":"2019-11-03T15:45:46.349978Z","update_time":"2019-11-03T15:45:46.349978Z","review_id":"AbFvOqlF3ckRVhaQUXZcfxKq4YpdzVuj1tuXCAhxl_qqyva2ypAxTl7SHYA-yCRN3knBxRY9_rldZA","reviewer_display_name":"Burcu Karadağ","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucqjeHpBlPfc97tzFIqXQQGnDA7fkKrdeVjbJO5P=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-06-22T14:08:49.325718Z","update_time":"2019-10-02T17:42:10.570130Z","review_id":"AbFvOqn_z9Sh10xmTxMDI5OaM86n4xD0i23PEvn-3f_UKKk82xBHLbE_J4BmLoY1DhS_XEIk8HtrJA","reviewer_display_name":"Johnny","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpeksUgUB3E9RJaleoGb4l3ncl1Zhxa6UggtR2vZA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"The worst experience in my life education.\nThe teachers... what can I say about them? They have to be more prepared in acknowledgment about the subject to teach other people. First of all, they have to leave aside preferences because I noticed they discriminate some students. I am really disappointed and I have been there for 2 years wasting my time. I did not complete my study due to a teacher (Indian woman) unprepared to teach  properly and lack of professional behavior.","rating":"ONE","review_reply":"Hi Johnny, we're really sorry to hear your experience didn't go well. As a training provider, we always aim to provide the highest quality services for our students, so we would really appreciate some more detail from you about what went wrong so we could try to help fix the problem and ensure it doesn't happen again. If you’re open to discussing this further, please call us and ask to speak with Janet, our Student Support Coordinator. We’d greatly appreciate the opportunity to make things right.","reply_update_time":"2019-06-24T08:57:00.003476Z"},{"create_time":"2019-07-20T22:44:25.156781Z","update_time":"2019-07-20T22:44:25.156781Z","review_id":"AbFvOql2j9QEssUjALEDr7DTsoK0gqgzuH40z5LG3vHzwbD6RjPOc-J3ec5VfHGdfw6GCPPM8_G7","reviewer_display_name":"Viacheslav Krikshchiukas","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZuco1IE8d3YXLIT1ZLcFZJqIvN67l6e7pmEz326mltQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"After completing the ELATT course I may highlight a great value it brings to your learning path. I would admit it gives you the fundamentals of IT skills necessary for your future progression.\nI have studied Web Design and Development. I am still learning further to expand my knowledge and to start a career in Web Development, however, as a starting point it is very beneficial and useful. The teachers are of a great help and are open to share information with you and give advice if needed.\nI am giving 5 stars because the environment is great and the program  they provide gives you the idea in which direction to move forward.","rating":"FIVE","review_reply":"Thank you so much for taking the time to leave us a review Viacheslav. Good luck to you as you move toward the next chapter.","reply_update_time":"2019-07-26T22:05:08.384093Z"},{"create_time":"2019-07-16T14:59:21.058699Z","update_time":"2019-07-16T14:59:21.058699Z","review_id":"AbFvOqmug4hHLFfBCBKVY9Y4XySU--cccPFfwPl8c2h7IDks7uiiehpjIRSF4BRKvXAkb2U5iWM5","reviewer_display_name":"Lee O'Connor","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrWbKFUGUjmd7Nk7W_wAqkftB1-naBkiyxSrkM4644=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I can't stress enough how valuable I found studying Web Design and Development at ELATT. I wouldn't be in my current job position as a web developer without them. Their staff are very friendly, knowledgable and helpful towards guiding you in the correct direction to learn, move forward and succeed in finding a suitable job within a career that best fits your skills. I would highly recommend signing up for and studying at ELATT if you want to find direction, skills\/knowledge and confidence in getting into a career you will thrive in. The education I received has been invaluable and I can't thank them enough. Thank you ELATT, it was a pleasure to be a student of yours.","rating":"FIVE","review_reply":"Thank you Lee for such wonderful feedback, and we're thrilled to hear both your feedback and how well you're doing in the industry now.  Please stay in touch!","reply_update_time":"2019-07-16T15:29:25.849521Z"},{"create_time":"2019-06-27T18:19:10.691381Z","update_time":"2019-06-29T22:40:58.952054Z","review_id":"AbFvOqnBq4fGVNnxvw65k7ZpoCDAO4VwJVktr-0x6BVq9JXjHbvLBB58IuBU7EeHovKl5QE4II_ovg","reviewer_display_name":"Isabelle p (Ip)","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmk30_N7LTD8-BvElZGhuHYUCSsyiNzrPgBUaVcr=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I've had a great time studying web design and development at ELATT.  Teachers give you all the tools needed to succeed in the course and to kick start your career in IT whatever your prior knowledge before enrolling in the course was. Keep up the good work!","rating":"FIVE","review_reply":"Thank you for your review, Isabelle!","reply_update_time":"2019-07-05T14:15:30.085607Z"},{"create_time":"2019-06-25T21:27:11.409403Z","update_time":"2019-06-25T21:27:11.409403Z","review_id":"AbFvOqkAvIWqxVnqUofa-sO8XBsaB6D9_weJ4EUrkwRUiMriU5dlKvffLBt1Jcv6_hzl2gJcdQC5vg","reviewer_display_name":"Vassiliki P","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpUMrjVnIsDZtv5jNwU2zMwRyPRwbDweqOwc1vKSg=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I attended the web design course and it was superb. Both Safiq and Deepa were fantastic teachers with a vast knowledge of coding and an incredible ability to communicate and transfer their expertise.  I can’t recommend ELATT and this specific course enough!!!","rating":"FIVE","review_reply":"We appreciate your review, Vassiliki. Thank you!","reply_update_time":"2019-06-26T12:02:54.705342Z"},{"create_time":"2019-01-30T20:32:34.366322Z","update_time":"2019-01-30T20:32:34.366322Z","review_id":"AbFvOqkDU0nayn0jx8v4Igg81neLtqAA6yxJP3bn9-tY1vvcsWrPRBXlIBlD-lT2Ui7w34vte2m3lw","reviewer_display_name":"Ioana Madincea","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmm7knp10H6pP7WPcNJMwSOCYpQBFMfU0Xya-CdG=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"We appreciate your review, Ioana. Thank you!","reply_update_time":"2019-02-02T10:01:39.092283Z"},{"create_time":"2018-11-28T17:34:17.686751Z","update_time":"2018-11-28T17:34:17.686751Z","review_id":"AbFvOqk0PXdcikKBDo9F0vCZXukv3LoAWVaTk5EMfdsKH885TRunmy9vj99yHw3V3wsZM43KZhq49g","reviewer_display_name":"munira ravat","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucq1JbLOyB8CGM4EGiaIcsgWwXNdPHHtolaC2Tj8=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"Thank you for your review!","reply_update_time":"2019-02-02T10:01:09.500578Z"},{"create_time":"2018-07-25T19:07:07.892Z","update_time":"2018-07-25T19:07:07.892Z","review_id":"AbFvOqkoxlO-ZL3RCBIPU-0-6VGbyF6Kez5pAXWWKygn45L4t8DodC-ARMFME2IBQtaSAQM-LO6Ahg","reviewer_display_name":"Bernard Antony","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpdem92q7kh1OsAIU917LAd-aRQ4hXgKH_hu8WCzw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Cannot speak highly enough of my experience with ELATT, Great place with lovely people to help and support you. Really enjoyed the training. The recruitment and support team have been fantastic and I can’t thank them enough for the support. The course is really worth and it was free, I gained lot of IT knowledge I did Computer Engineering level 2.","rating":"FIVE","review_reply":"Thank you for your review Bernard!","reply_update_time":"2018-07-30T09:09:52.362169Z"},{"create_time":"2018-02-17T16:05:32.229Z","update_time":"2018-02-17T16:05:32.229Z","review_id":"AbFvOqlBXz9ww-gBOsZU6AxM6JC4-A0_-X7Fa5BbVwkYuVCyL7xGtmQ-YzBGAQNkpPmXp6Pst5Kh","reviewer_display_name":"Antan Mighty","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrRouSVsxKaix8PjXQdQaMS0_WVF3ujb4sR4PfG=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"We appreciate your review, Antan. Thank you!","reply_update_time":"2018-02-21T10:27:52.975376Z"},{"create_time":"2018-01-22T16:24:40.627Z","update_time":"2018-01-22T16:24:40.627Z","review_id":"AbFvOqnZGrGwYZG2E-6mIYrhDaXIX47bKb-iZ12i8Jm7dIHZ-fjur8qnBydDx5vAf4kCqEjwUBMZqQ","reviewer_display_name":"Harry D","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmmhfFlJIfCOCP8YPhdfO0bD3bHwgjXhscNNRp8e=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Far more engaging than university, friendly classes, more care in terms of individual progress. Great experience overall. Free cups of tea (Y)","rating":"FIVE","review_reply":"Thank you for your review, Harry!","reply_update_time":"2018-01-23T09:06:35.884476Z"},{"create_time":"2017-11-07T19:27:39.893Z","update_time":"2017-11-07T19:27:39.893Z","review_id":"AbFvOql-m_MzqdaKTC16k6ybbhCrGslUHxWyLAH4tn1Hn2MH3Khw9NZo67M2wg_dyznBjX441mUJUA","reviewer_display_name":"Hamza Osman","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmkpJxSA-BK32KFx_YRGxbyEaroQT2jw_Tdq2Hyx=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Nice staff and good teachers","rating":"FIVE","review_reply":"Thank you for your review!","reply_update_time":"2017-11-07T19:41:28.001065Z"},{"create_time":"2017-08-30T20:52:42.672Z","update_time":"2017-08-30T20:52:42.672Z","review_id":"AbFvOqlRuYMqytRffBFfSljo8qlBARO_9SfeP4gE_m4TbmNPrrN6r77KQmwyTM1So8xYtDUiVcz5Aw","reviewer_display_name":"Tudor Ciocoiu","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AItbvmnNIlon1dFyNEIi4yoDgMEVYxbNpOZsVef5sVqP=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"Thank you for your review, Tudor!","reply_update_time":"2017-08-30T22:33:11.313377Z"},{"create_time":"2017-08-16T22:26:00.104Z","update_time":"2017-08-16T22:26:00.104Z","review_id":"AbFvOqmh27YerZ8IxKAW9oLAzVfNaA_LWRnfAlqmnLqfFO3ACb3ApHsbN02u-5QKKHoMn8NK0IUN","reviewer_display_name":"Davina Clarke","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucpPpWPDlDOHxOpb4MaxZF_MIRYldm-FSCifQmh_=s120-c-c0x00000000-cc-rp-mo-ba4-br100","is_anonymous":null,"comment":null,"rating":"THREE","review_reply":"Thank you for your review, Davina. We're always looking to improve our services. If you'd like to tell us more about your experience with us, our team is available at 0800 0420 184, Monday to Friday.","reply_update_time":"2017-08-17T18:35:23.384511Z"},{"create_time":"2017-07-21T01:04:42.848Z","update_time":"2017-07-21T01:04:42.848Z","review_id":"AbFvOqlyUatQ5bZTVbbR5UK_zpZ6-GXbRD0oEzEtUfDO2dzaJ1lXfB_qQzf-xIHXH2UtD5Sd87ZXAw","reviewer_display_name":"Elusive B","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucqpL5VQKAKDqOgka0fyY7nc2_2XxhUtk4hWDAp0tg=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"This is a hidden treasure in terms of how much they teach and the constant support you get from everyone, from reception to the lecturers.\nIf you want to learn about technology then this is the place to come to.","rating":"FIVE","review_reply":"Thank you G K Blayder, those are some amazing words! We couldn't have done it without our students such as yourself! ;)","reply_update_time":"2017-07-21T10:58:33.502727Z"},{"create_time":"2017-07-19T18:19:10.150Z","update_time":"2017-07-19T18:19:10.150Z","review_id":"AbFvOqkzuuBRlJY1_ppK2sfFXn6EtjZ16g3985VSL0BW365NQHnV8YnZPwICg9fuIPzRqkeSicCy","reviewer_display_name":"Yoel Solla Martin","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AFdZucrXP-5w3Ag6fdpndmg9d18Jw6HuGgoUlEZzdDJBGg=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Very kind staff, very friendly classmates. If you want a change in your work career  try Elatt.","rating":"FOUR","review_reply":"Thank you so much for believing in us Yoel :)","reply_update_time":"2017-07-21T10:56:28.027050Z"}]}