{"totalReviewCount":14,"review":[{"create_time":"2021-12-22T15:41:36.896Z","update_time":"2021-12-22T15:41:36.896Z","review_id":"AbFvOqlwPeDpb1titoiT_NWJNpENcrjYcHHYrO2bMnJjFxkK-7Jq2LHVhj4f5DcI-mwG3nukXYZAjQ","reviewer_display_name":"Rinaldo Bailey","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GiPj4FMKlgWKlU43bCApldPHR4xCwsP6zOTB2Ga=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2021-07-22T23:19:30.628Z","update_time":"2021-07-22T23:19:30.628Z","review_id":"AbFvOqkRNPs9g24yF-c7uH-hVxLITAeKhdWXoZCCE5-9ijE6ooZVPptcsPnJH-qhaRrjYyGv2-LG","reviewer_display_name":"Robert Collins","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GiEtrJNOguIbE2V5dZKOjrRrnThQRFRuxrDj6EWTz8=s120-c-c0x00000000-cc-rp-mo-ba4-br100","is_anonymous":null,"comment":"Great people that work there,","rating":"FIVE","review_reply":"Hello Robert, Thank you for your review!","reply_update_time":"2018-08-09T18:13:23.392Z"},{"create_time":"2021-04-23T19:41:32.227Z","update_time":"2021-04-23T19:41:32.227Z","review_id":"AbFvOqnvCluXDgytm-RLV5J6RLLE732NWAsD19m-V2J-V9w32nH1ce2H6MJiSGs7zi2sxqg-VLT2","reviewer_display_name":"Andy Visser","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhvhwrJbVJVKQTZwQ7WWeEJTU_hYwuZKKuis0jQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I couldn't have asked for better service, from planning to loading material up at their location, everything was perfect. Highly recommended.","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2020-12-09T16:20:49.974Z","update_time":"2020-12-09T16:20:49.974Z","review_id":"AbFvOqkHrrzPzQyCuqUNeN2Sjhsh-pBHTY2iiIuutxcjXE_xHZb_o3Gxnm6jyMAUJBpYb4eoF9Ka2Q","reviewer_display_name":"Jerry Jordan","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgIPaHA3qRSU5UetwbzSz6XLySOjChtSI5NMufKiA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Great 👍","rating":"FIVE","review_reply":"Hello Jerry, Thanks for the thumbs up!","reply_update_time":"2020-12-14T19:53:33.385Z"},{"create_time":"2020-09-18T16:34:48.375Z","update_time":"2020-09-18T16:34:48.375Z","review_id":"AbFvOqmUZmw21t6Qq_82KPmqzmGk_q8z9zs7dfH2Ag1qZoWNzL5r2sOrmRg0YGPtSzm95L2BhuDdtg","reviewer_display_name":"Ross Zammit","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyXCxVH-JiK29dBjUUj-EKd1ecTLGjj3NC8lueZ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Good quality, and very helpful staff. Try them and you will like them and their products.","rating":"FIVE","review_reply":"We appreciate your review and kind words for our hard working staff. Thank you!","reply_update_time":"2020-12-14T19:53:11.128Z"},{"create_time":"2020-07-23T19:50:37.028Z","update_time":"2020-07-23T19:50:37.028Z","review_id":"AbFvOqk2193voybBhBq40okF7g8OSP3mFelefvyCUrb2DiwcPEYWPMMMhP4xTSYqWLr5bY_qGhVa","reviewer_display_name":"barry scruton","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzcc0r-o0-djHpqFbrG0zz66F7lkK5KHle8iOdg=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"This was our second installation of Concord  Glass Railings.From our first\npurchase in 2016 to our recent one two weeks ago we could not be more pleased.The product is spectacular, and the staff are all uniquely qualified and extremely helpful. We sincerely appreciate the efforts put in on our behalf and we have smiles on our faces when we look at the results every day.\nCheers to Pino,Jason and the whole crew.\nThank you so much,\nBarry and Ann Scruton","rating":"FIVE","review_reply":"Barry and Ann, thank you for your kind words! We enjoyed working with you. We appreciate your review!","reply_update_time":"2020-07-23T20:59:28.187Z"},{"create_time":"2020-07-09T17:03:37.304Z","update_time":"2020-07-09T17:03:37.304Z","review_id":"AbFvOqkp5HxSse-25e1AXIfKSFG3ZP2J-1LsX6SsDI9aKPz-d-3Do4Sfts0KkMvFLOITKf8CQsGN6Q","reviewer_display_name":"Alejandro Rodriguez","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Ggel1XuPccvbWI7e6WfFR_Crr2xDwqQK1SAC7mkHw=s120-c-c0x00000000-cc-rp-mo-ba5-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"Thank you! Much appreciated!","reply_update_time":"2020-07-09T18:26:10.776Z"},{"create_time":"2020-06-25T18:43:38.192Z","update_time":"2020-06-25T18:43:38.192Z","review_id":"AbFvOqkWDzs0OSoID3Z9PoamAkF8n8jk6BPk2MHpae9W-zrS1vRuwK9zIUdxpEMbX6d12doN1Rao","reviewer_display_name":"Libia lorena Mebarak","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GjaKzEVLoLrKC7QbOV-DF5xZCbzZxR5YYtv7DLKFQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-09-13T12:04:08.989Z","update_time":"2019-09-13T12:04:08.989Z","review_id":"AbFvOqnDE7MPJ6wqjpxV2RSdVCqOOzcFn-VyM7zQfRfWIOEP_q-9UuvQgjM32WtqFZxxAvLbjEps5g","reviewer_display_name":"Budget Railing","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhI7GKsyyNLfbteoL9CnEJCu9lJ-ihHIBNtvtkvtw=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I started dealing with Concorde back in 2004 for the odd system. As I was manufacturing my own product at the time and had requests for something less expensive than built from scratch custom railings.  Since 2013 I have been dealing with Concorde and they do their very best to accommodate my every request. Like every business they have hiccups once in a while.  Any concerns I have are dealt with in a timely manner and they bend over backwards to make sure I’m well looked after.  I’m not their biggest customer by far but I feel like I’m their most important one.  Keep up the good work!","rating":"FIVE","review_reply":"Hello Michael, we appreciate your review and comments! The relationships we foster with customers are more than just B2B. We build friendships that makes us bend for our customers. Customer size does not matter as we appreciate all customers. By the way you are our biggest customer in Ottawa! You have represented your company and our products for many years. Ottawa could not get our products that people want with out you servicing the entire area. We look forward in many more years in working together.","reply_update_time":"2019-09-13T13:53:23.964Z"},{"create_time":"2019-05-14T18:12:03.064Z","update_time":"2019-05-14T18:12:03.064Z","review_id":"AbFvOqny7ifsyz-iGAX7T146u5ViUezD3_2bST-0L1FQvrKQwCTeICqRtaHUBZBWIzNeeZ9nEkOa","reviewer_display_name":"Shaun Pingitore","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxwmr5K31lxrItlKZiqp5Iil4V4u-3XKmd9IPTF=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"I've been referring clients & friends to Concord Aluminum Railings for a few months now, and the tech company that I work with now has managed their website for years. The staff is professional and friendly.\n\nA friend of mine purchased railings from them for his new house build a few weeks ago and they were able to deliver very promptly and gave us some tips to make the install go smoother.\n\nHighly recommended!","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-05-11T13:05:54.273Z","update_time":"2019-05-11T13:05:54.273Z","review_id":"AbFvOqnYFa4ui2PjhjNVl8E8ADPgi4CJbBuZ2eTKyfYOKLVf2k5b-4WQ8e1anLNtpnheBc8sFPiN6A","reviewer_display_name":"Kuldeep Singh","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyX1QkThk5nmoEs6pG3KGpY6HjGyQEDyU8KFrug=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2019-05-05T19:15:49.875Z","update_time":"2019-05-05T19:15:49.875Z","review_id":"AbFvOqlfu6pQwfCUd-8soUvkcac8kZzgTqcpFm6PPV2yFotY61rAYCG40HLZOHMMrotwGD_VT0SzAA","reviewer_display_name":"Alessandro Quafisi","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyLpu7gyLKuLv_hIhlnDvlqwPCB7BqMPtxFrWJE=s120-c-c0x00000000-cc-rp-mo-ba4-br100","is_anonymous":null,"comment":"Anyone who would give this more than a 2 star rating, must be related in some way.\nI am a contractor who called for a quote 3 weeks ago. The girl gave me the wrong email address for sure because I even read it back to her. This forced me to go in person. I went in, got a very vague quote, asked to set up a profile, which they obviously didn’t.\nI went back in on Friday May 3 to place an order and the girl told me then that my profile wasn’t set up. She told me that the system was down and they weren’t able to do anything. She told me to hang on for a few minutes while she set me up in the system to place my order.\nI waited for over an hour, when I looked over to see what the hold up was, I noticed she hadn’t set me up and she was doing some other work, I walked out to never return. I went to their competitor down the street and I was set up in there system and placed my order within a few minutes. Should have gone there from the get go.","rating":"ONE","review_reply":"I do apologize if there was any miscommunication. We have been having system issues but if you contacted us 3 weeks ago we should have advised a quote.\nConcord Aluminum Railings has been in business for 17 years and we have sold over 3 million feet of railings to satisfied contractors. I am disappointed that we did not get your business.\nI will speak to my staff but I do request if you may send me the email from 3 weeks ago with the quote specs request so I can review with my staff as to why we did not quote in a timely fashion. Call in and ask for me and I will provide my email address as I do want to place any fixes with my CSR's. One of them is fairly new as well but between all of my staff we should have been able to handle your request.\nI do hope we can win your business in future.\nRegards,\nPino","reply_update_time":"2019-05-06T13:46:52.841Z"},{"create_time":"2019-04-26T22:31:29.468Z","update_time":"2019-04-26T22:31:29.468Z","review_id":"AbFvOqm4X12CAOJvjcbqoB7qOPhBceG_PSh-Ibz1bCfSwuplJ7gCetTb6zHN4zHeZLof0TPujwpE","reviewer_display_name":"John-Paul Sacco","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwEV6MHoJGM095ZLt-uI7X0J0ag_twpfiroOE7Y=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I am a contractor and I requested a quote for a client in order to bid on a project.  I requested a quote on April 14th and to this day (April 26th), I still have not received a formal quote.  Your claim is 24 hour turnaround for a quote is it not?  So in a panic and extreme urgency to bid on a job before I lost it, I was finally able to get someone to give me a rough price per linear foot of glass railing over the phone.  (Which no doubt will most likely be wrong).\n\nEvery time I call the lady that answers gives me a new story.  Mostly having to do with corrupt software that crashes halfway through working on a quote.  At this point I think, can this not be solved with a piece of paper and a pencil, but that's not my business.  Every time I call she says \"I will call you back in 10 minutes\" and never does.  Every time I call she says she has it right in front of her and she is working on it, but she never is.  I know this because yesterday, (April 24) she emailed me and asked for specifics on the railing needed to quote it (like height, style, post size etc).  If she really had ever opened the quote I would have been asked these questions 2 weeks ago.\n\nAt least when michelle was there I was never endlessly lied to.  If she was behind she just told me and I was good with that.  I understand.  But enough with the bs.  You claim to never turn down clients, so I really don't know what this is.\n\nSorry pino, I really didn't want to get into this, but you asked.  If you would like me to call you to discuss please send me your number.\n\nJp","rating":"TWO","review_reply":"Dear John, You left a star review but did not indicate your concerns. I don't recognize you as one of our clients so please provide further information and please call into Concord and we can discuss your concerns to rectify. We have never turned away working with our clients or their customers.\nAt this time I can only believe this may be a competitor utilizing the opportunity of social media to advance their company. I look forward to your call. Also, be prepared to advise who installed your railings and proof of purchase.\nKind regards,\nPino","reply_update_time":"2019-04-25T14:17:53.010Z"},{"create_time":"2018-08-10T12:13:14.154Z","update_time":"2018-08-10T12:13:14.154Z","review_id":"AbFvOqnb-mWbbaICm5WuPSmycy2gTB87HIsKbvX0Ke8gHOYN1BH0ZQ9LFeiEblDrc9xm4O_ytXNdAA","reviewer_display_name":"RF","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJw2c3ZI7cIaz-JRwSE2Pj-fxfUWhIkKVR4f1Dxu=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Don’t bother. They don’t deal with the public and they make sure to let you know your call to inquire about their products isn’t welcome.\n\nUPDATE!! I note the response and appreciate same however in my case I was not directed to any installer\/contractor. I was flat out told you are ONLY a supplier and I would need to shop elsewhere.  There were no helpful suggestions made to me to source out product\/installers for my project. I have since contracted and completed my project save for the railing which incidentally I secured on my own.  Perhaps my dealings with your company is a one off but in this particular instance your response to me is completely void of any culpability in how I arrived at my conclusion. At any rate what's done is done and and I stand by my review.","rating":"ONE","review_reply":"We always appreciate any feedback that allows us to clarify concerns from current and potential clients. Concord Aluminum Railings is a manufacturer for over 15 years and is well known in the industry. Unfortunately, we do not sell direct to the public our railings but will sell columns, solar lights, fencing, some railing replacement components, and a few other items direct to the public. As for railings, they are left to our professional install companies we sell direct to and they work with home owners. Their expertise will ensure a smooth supply and install process. Potential home owners looking for Concord Aluminum Railings products, we always provide a direct reference of one of our professional contractors we sell to in their area so they can receive optimal service. By having a potential customer call in, they get the product they want through the appropriate channels. We take away the challenge for them to locate a contractor selling our products.","reply_update_time":"2018-08-09T18:12:37.611Z"}]}