{"totalReviewCount":29,"review":[{"create_time":"2022-02-01T23:53:17.388Z","update_time":"2022-02-01T23:53:17.388Z","review_id":"AbFvOqmze1izDsa--qu1rqGNnl_ZIDx90qZqY7FNPb6YXD_VxRT-pHPOPMxxuPntmSAjdy5E5SAyyw","reviewer_display_name":"Anton Smirnov","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgfnTi8Ocywx-wqvKNQIhtwJTR24ClNxRGYkXD5DQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I had my kelpie mix Gemma train with Tina for a few weeks and the transformation has been truly remarkable. Gradually an unruly puppy that jumped on everything that moved turned into a well-behaved dog. Tina was able to teach Gemma great recall and the commands I never had success with, like 'down,' 'place,' 'leave it,' and many others. The communication was easy and straightforward. I highly recommend Tina and Traction Dog Training club","rating":"FIVE","review_reply":"","reply_update_time":""},{"create_time":"2022-01-21T00:06:07.603Z","update_time":"2022-01-21T00:06:07.603Z","review_id":"AbFvOqkuO16ZkkHPOKnpDYsErMTp2E5k-RBUXFqnXLVbHzLx3xnfxHnPPEKzP-GfO5MCPhsktimXdg","reviewer_display_name":"Monique Kelley","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJwgXQ5DgJv6F8G_q6q6EeWYFiqOr2ZIhkNezpHz=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Tina is a rock star with puppies. She’s practically part of the family now. THRILLED with homeschool. Thank you Traction Dog Training!","rating":"FIVE","review_reply":"We appreciate you being a proactive puppy parent with the Homeschool program!","reply_update_time":"2022-01-21T20:30:38.001Z"},{"create_time":"2022-01-20T23:54:10.375Z","update_time":"2022-01-20T23:54:10.375Z","review_id":"AbFvOqmGEXSZH6qYh5DSgb_ngApij_jh70aOFF-gZ1Z_L953v4XPYpPYsqeTW65IibyGaip01Lb0Zw","reviewer_display_name":"Zoey Spring","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzIEfQXhRw3baRvdFXspMpzyTkwrujiqA486CTN=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Tina recently helped my fiancé and I with our new puppy. I am over the moon happy with the results. We both learned so much about puppyhood. The teething, potty training, crate training, obedience, manners and many other things I’m forgetting can be overwhelming. Tina makes it all okay. She explains it all and walks you through everything step by step. I love that she is a nepopo graduate! I am a behavioral psychologist and learned a little about Bart Bellon’s accomplishments in canine training & behavior. The fact she studied under him went a long way in narrowing our choice to Traction Dog Training. Tina did far more than I thought possible with our baby. Oh and she still checks in on our Pongo. How cool is that!","rating":"FIVE","review_reply":"It is wonderful you were able to learn more behavioral psychology in the realm of puppies and NePoPo! Tina really is a rockstar!","reply_update_time":"2022-01-21T20:32:12.468Z"},{"create_time":"2022-01-20T23:15:10.431Z","update_time":"2022-01-20T23:15:10.431Z","review_id":"AbFvOqks9Jyk80vLM694oLx2BeWXeddQykGGVmecKyOXbQnjAkFjj1udb_uxKyxgDPdrDdf0hbxaag","reviewer_display_name":"Veronica Johnson","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJySaeU59vAUCZdPLdHpKxR-qrYVRSe54bw9MRmo=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Blanco is my 6 month old husky furbaby. He’s such a great dog but had some serious issues w\/ potty training  & crate training mostly. There were a handful of other things but those were the two driving my husband & I crazy. In comes Tina Chavez! I opted for the homeschool program. It fit our family’s needs perfect. Tina is the puppy whisperer. First off, blanco is in love with her. Literally, tina is his favorite and that’s not easy for a mama bear like me to say. Which is crazy because Tina doesn’t let him get away with any bad behavior, ever. My blanco definitely has a hooman crush on Ms. Tina. I’ve had a few dogs and gone through a couple training classes in my life. Tina just has a way of explaining and then showing & teaching you the why\/how\/when you do things in puppy and dog training. I am so happy my family found her. We plan on always having dogs in our home- which means always using Tina.","rating":"FIVE","review_reply":"Thank you Veronica, and congrats on your puppy! Tina will be thrilled to hear this.","reply_update_time":"2022-01-21T20:33:25.300Z"},{"create_time":"2022-01-20T22:50:06.723Z","update_time":"2022-01-20T22:50:06.723Z","review_id":"AbFvOqnHs9nAY_aD5bacNhdgIwTGWf6ge4FswHF57Voi4msRrl1c15cRc-qQ9PLbAqaiRHCh5Vxamg","reviewer_display_name":"Ben Parker","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyYw0Mh1RuW1vt1A3BJCYYGrZH5JAJYNuHDcpco=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Brought my 1 yr old Doberman Max to training for issues with aggression toward other dogs and to officially give him solid obedience. My trainer was Tina. She was great with Max. He tends to not like new people but immediately loved Tina. We did the homeschool program. I wish I would have found “Traction Tina” when I first got Max. He is now able to be around other dogs AND is good with new people. He’s the best Max now. He’s the Max I hoped for. Traction Dog Training and Tina saved me and my max from a lot of frustration and heartache. I will always recommend Tina.","rating":"FIVE","review_reply":"\"Traction Tina\" is a Doberman whisperer at heart!","reply_update_time":"2022-01-21T20:34:01.775Z"},{"create_time":"2022-01-14T03:24:54.306Z","update_time":"2022-01-14T03:24:54.306Z","review_id":"AbFvOqnkQsjREvpl5riaJ-3U4YoAw07Eg6EUic7Fpx35vQxmaO4ExJbofPDGPlVPvm8PH5huCg47LQ","reviewer_display_name":"Cheryl Knight","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxml1eGGRECt3_j1ulHxYIhiUfr9detwT3YffRU=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Training requests exceeded expectations.  Mara is amazing and now our dog is!!!","rating":"FIVE","review_reply":"Thank you Cheryl! You and Tim were a key part in Audi's separation anxiety training being successful.","reply_update_time":"2022-01-21T20:35:20.868Z"},{"create_time":"2022-01-10T17:10:37.890Z","update_time":"2022-01-10T17:10:37.890Z","review_id":"AbFvOqmiWeu5CHr0othomukkXU1rjZz5HJoz3WudPHJ_ww252jA2Pnn28nK4DjTd3Dn3RnTYXZOjUg","reviewer_display_name":"Tiffany Jacobs","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gjc0bD29v7o-bG9yloi5rAxcxeq8EcYOXlXhIxpe8M=s120-c-c0x00000000-cc-rp-mo-ba5-br100","is_anonymous":null,"comment":"Mara is very good at what she does.  The training is detailed and works for dogs of all types.  She teaches the 'parents' and the pups and taught several techniques that we never thought of.  The immediate chemistry she has with your dog, puts you at ease. She will also provide the parents with ongoing support when the sessions are complete.  Highly recommend!","rating":"FIVE","review_reply":"We appreciate you, Tiffany! Your pups are always a joy to watch and work with.","reply_update_time":"2022-01-12T19:21:52.987Z"},{"create_time":"2022-01-07T21:12:17.420Z","update_time":"2022-01-07T21:12:17.420Z","review_id":"AbFvOqmnKzf-1QYh3QgLzvtHAo3EwW7t1KEUUMKL6vEbjD0-sChc3uNidwBnFNy4YdKGTXHAkfP7BA","reviewer_display_name":"Cole Jacobs","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxJdMSP0SlCOdk1dbRyBAXXI7zDrDcVXQsMV0P1=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Mara makes Cesar Millan look like a rookie...seriously.  Our pups have all responded so well to her teachings.  We have three dogs, ranging from a pup to 13 years old.  All of our dogs are more obedient, and I believe happier.  They don't jump on people at the door.  They don't jump on the couch (unless invited).  They peacefully sleep in their kennels.  Our relationship with our dogs has never been better.  Mara is a true professional.  She also watches our home while we travel.  It's a great feeling to know our pups are happy and our home is safe.  Thank you, Mara.  You are great teacher and even better person.","rating":"FIVE","review_reply":"Thank you so much, Cole! You have a pack of very smart pups, always eager to learn more and always ready to play!","reply_update_time":"2022-01-12T19:22:55.351Z"},{"create_time":"2022-01-05T15:28:30.975Z","update_time":"2022-01-05T15:28:30.975Z","review_id":"AbFvOqmRsKH7JqsOEdEU4q0IsI04NC-5zbiPYAgsZqNrhI0iBXCzyPeMue_5qpUT4j3OMN9b3yXnDQ","reviewer_display_name":"Tonya Allen","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Ggi47IxQBrRemwfmPfAaJOrt_FcRxXSKiSNWItf=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Mara is a kind and skilled soul.  She is professional, communicative, effective and above all else an expert in her field.  I hired her for a 3 week daily program to train my dog to become a therapy worker and she was successful with our goals.  Dog training can be expensive but Mara is worth the investment.","rating":"FIVE","review_reply":"This is great to hear, Tonya.  I appreciate it and hope Talia gets many years as a happy therapy dog. :-)","reply_update_time":"2022-01-12T19:23:49.449Z"},{"create_time":"2022-01-03T16:08:49.267Z","update_time":"2022-01-03T16:08:49.267Z","review_id":"AbFvOqlHrxVigLPU_6gTMHFgxgA5QjBGpnc2mbM1XXNQajv9ryiB33Yk7ymVcxlSkI7tkS1VjpOC","reviewer_display_name":"Michelle Pena-Ortiz","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GjVCAMgD_PksH4eY5sq-K17B16fDfZ5PZYbZW2adQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I go to Mara with all of my dog-related questions, and she is always super helpful! I honestly trust her more than anyone on these topics.","rating":"FIVE","review_reply":"We are always happy to provide support and answer questions, especially to the wonderful dog momma of Loki and Lana!","reply_update_time":"2022-01-12T19:24:34.737Z"},{"create_time":"2022-01-03T04:07:15.074Z","update_time":"2022-01-03T04:07:15.074Z","review_id":"AbFvOqmvhFteKtRWMuhThCwxi5mhhWVL7j123WqMfpD8FHhgpoIrejr_luWvEdBILSCiw7mrhSw4","reviewer_display_name":"Jason Hart","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzTHWkdqB4JUi3POilX2Ha1JZJt6XlRdU8Fz4Zw=s120-c-c0x00000000-cc-rp-mo-ba4-br100","is_anonymous":null,"comment":"Have some long term experience with Tina and my pup, he had some personality issues that required serious intervention, Tina was professional and knowledgeable... highly recommended.","rating":"FIVE","review_reply":"Thank you Jason, I'm glad to hear Traction was able to give you a better life with your pup.","reply_update_time":"2022-01-03T15:12:49.982Z"},{"create_time":"2021-12-29T05:19:35.884Z","update_time":"2021-12-29T05:19:35.884Z","review_id":"AbFvOqnKuaUzBduHaZW16LHqcrEL4zmMhYFMZ-7OHrwIqfUdxWKdqFPRtI9puZouxox4PaReY5CuYQ","reviewer_display_name":"Graham Henry","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzLFRy1L4bm-jeN8V_Im2bqzILa9CS1kwgJVkWt=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"My wife and I worked with Tina to train our puppy Theo and could not have had a better experience.  We called Traction because we were not having much success teaching Theo to stop nipping, jumping, barking, etc. on our own.  Tina gave us great insight into how our pup thinks and how we can better communicate with him.  Not only has he stopped \"committing puppy crimes\", he now heels on leash, comes when called, stays in his \"place\" when we have guests at the door or are eating dinner, and more.  We will definitely be returning to Traction when Theo is older for advanced obedience!\nThank you Tina and Traction Dog Training Club!","rating":"FIVE","review_reply":"This is why Tina is our puppy and basic obedience go-to! Thanks Graham!","reply_update_time":"2022-01-03T15:11:28.171Z"},{"create_time":"2021-12-08T16:51:51.383Z","update_time":"2021-12-08T16:51:51.383Z","review_id":"AbFvOqnzTzEBMaS6NVFLf9Zhk5jmx3IRlft8OkGBGvzYvEq668tlXENcHYyKm_147GEftA8kpAj6UQ","reviewer_display_name":"Jennifer Chavez","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzNVE5hjQqIskY91gByN0EaLi7VVTzS5W-logKE=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Tina is very professional and competent!  She an excellent communication and was able to address all of the behavior issues with our dogs.  Highly recommend!","rating":"FIVE","review_reply":"Thank you, Jennifer! I'm glad you enjoyed working with Tina!","reply_update_time":"2021-12-13T00:40:46.685Z"},{"create_time":"2021-11-23T17:11:19.625Z","update_time":"2021-11-23T17:11:19.625Z","review_id":"AbFvOqkQpr_UkHXnLsGb5790HkJlg2WheTiRXdvHcREnMxZqj7Irkq2y66iOPxxMgY4s7hg3cycMDA","reviewer_display_name":"Ryan Kelly","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJx8lNNgNypkabFNrXt3Su_xHajgEHKACQUNjhS1=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Mara was incredibly helpful with training me to train Maze. I reached out to her with a dog that would not recall after trying every treat in the book and working on it for about an hour each day. She would also pull and chase skateboards; anything with wheels. Mara sat down with us and helped create a training program specifically tailored to Maze and her needs. She connected with maze instantly and helped me immediately control the pulling. After just 4 sessions Mara was able to train Maze as well as myself to get Maze to a point where her recall was flawless and she could walk around the park without a leash and ignore any distractions. We now go backpacking, backcountry skiing, and have a much tighter bond. The training always continues and Mara still responds to my texts when I have questions that come up. She helped us out tremendously and I have and will continue to recommend her to my closest friends and anyone else that needs the help. Thanks!","rating":"FIVE","review_reply":"Thank you Ryan! I'm so glad to see you and Maze living the off leash life!","reply_update_time":"2021-12-03T04:08:37.147Z"},{"create_time":"2021-11-22T17:32:43.547Z","update_time":"2021-11-22T17:32:43.547Z","review_id":"AbFvOqlKC6uZ5x0irEZW0jH0h9Jgd8iF4c7xQtcofHSGNstKriucJ1M-quPjHVvrJP9ymmI80lLy8g","reviewer_display_name":"Joe Kelly","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyDEYc1wABMrSS4uTuLZYg214SzF_THDYSY4s8Q=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Thank You Mara,\nWe are so pleased with the results of your training. Archie is a very active and high energy Australian Terrier. We tried two previous trainers to no avail and had almost given up hope.Thanks to you he is now becoming a much better, happier, well behaved dog. It's so nice to take him for a loose leash walk, by our side, without feeling like we are flying a kite. Also at home, among other things, he will stay in place when asked, instead of terrorizing the house. The skills you have taught us and Archie are truly appreciated. Your professionalism and reliability is exceptional and we would highly recommend you to our friends.","rating":"FIVE","review_reply":"I am so glad Archie no longer terrorizes the house and can get his energy out off leash! Thank you Joe and Cindy, much love.","reply_update_time":"2021-11-23T01:19:04Z"},{"create_time":"2021-11-20T21:54:16.723Z","update_time":"2021-11-20T21:54:16.723Z","review_id":"AbFvOqk2IvcN9Sp3uKJWl75fq-77_nz56HRjquitpUlWHB9EO-KKqXGmTjfUh4mgfo0QPgvxylNGag","reviewer_display_name":"Sarah Taylor Peters","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJy5gekIHD2xBlKQKR7mugRPkeUQ_vyejP-YvFPY=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Mara is absolutely wonderful!\n\nI had almost given up hope for my dog Louie who has terrible leash aggression when walking past dogs behind fences.\nMara has turned my Louie around in 3 weeks time.  Walks are a joy again without stress for me!\nI am so thankful. I can now walk Louie and our 9 month old puppy with ease.\n\nThank you Mara!","rating":"FIVE","review_reply":"Congratulations on many happy walks to come with Louie and Lola!! You've been such a joy to work with.","reply_update_time":"2021-11-20T21:57:44.070Z"},{"create_time":"2021-11-20T09:55:36.327Z","update_time":"2021-11-20T09:55:36.327Z","review_id":"AbFvOqnA482uEgK7KwHoO6HICLZk170tOkzdQGei1EFl73gB0PYD5zOB7vBhwwNXvOgq4UxtqitYuw","reviewer_display_name":"Pam Martinez","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzVoYwms_Zl9qEHljTGYCIP3lDiryj1BRnHWQjr=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Great experience!  My dogs have learned when barking is OK and when it’s inappropriate.  The training gave me an approach to accomplish this and to improve my communication with our dogs. Many thanks.","rating":"FIVE","review_reply":"I'm glad your pups have learned the boundaries of barking at the door and in the yard - thank you Pam!","reply_update_time":"2021-11-20T21:30:35.264Z"},{"create_time":"2021-11-16T18:24:57.499Z","update_time":"2021-11-16T18:24:57.499Z","review_id":"AbFvOqmR6cB8xKUuGl-Al_DRHLARcwN_oWigKUK3-XBEGCOPysOoYPvVjp3tbQ5-O3u5lVuYClyQ3g","reviewer_display_name":"Dane Bentley","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzeI8TR9J6xozaQHqlbb1kZJleLy6Wnot1D8BJu=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Mara is great! She clearly knows the psychology and fundamentals of training any type of dog. She is extremely knowledgeable and I wouldn’t know where to start with my E collar without her. Looking forward to more trainings!!!","rating":"FIVE","review_reply":"Thanks Dane, it's great to see Zilla learning the e collar and gaining more off leash freedom!","reply_update_time":"2021-11-20T21:29:45.005Z"},{"create_time":"2021-11-03T13:19:17.305Z","update_time":"2021-11-03T13:19:17.305Z","review_id":"AbFvOqnd91c0Aivr8a0haaPnmB2E0kzsTvnjjER3KP7jqMn3-NWQ6-sTXHhw0eRPEXXwTjQ71c-X3g","reviewer_display_name":"Alex Weeks","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJzWgDcqV_-7IQsT3dKTDQRpAyx_qARccdk_bqCG=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Mara did an amazing job with our middle aged black lab. She had a set schedule which she adhered too but was also flexible enough to meet some of our changes as they popped up. The training process went smoothly and she delivered the results as promised. Overall our lives and our pups have been greatly improved from the training received by the Aerovonz Training Club. Thank you Mara!","rating":"FIVE","review_reply":"Thank you Alex! Moose was a delight to off-leash train!","reply_update_time":"2021-11-04T21:55:04.453Z"},{"create_time":"2021-11-03T00:36:47.709Z","update_time":"2021-11-03T00:36:47.709Z","review_id":"AbFvOqkdz-WzneWZO1sERya93A94dGuEdPuLf3-sTvvDvUz_CN0EdJv9-XDJ6rbUjviP3az7_GYeZA","reviewer_display_name":"Sawna Guadarrama","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GgTzawW8sLu-qiTz4YHTyzFSBj0FSL7h7TplU13LL4=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I went through a couple other local trainers while trying to focus on training both my dogs once I moved to Boulder. I spent weeks with these trainers and too much money (it’s embarrassing) and they couldn’t accomplish what Mara did in ONE DAY. She was so kind but firm with her training, my dogs Juniper (7years old) and Aspen (just turned 1) loved to listen to her and she taught me how to properly communicate so we can continue our loving relationship. Before Mara Juniper pulled on leash when other dogs where around and REALLY wanted to chase deer and rabbit although she was an excellent runner. Now she stays glued to my side (and gets rewarded generously). Aspen, being the Australian cattle dog that he is, is FULL of energy and pulled aggressively when running, he doesn’t pull at all and is working toward not having to greet every dog when passing. WE ARE SO HAPPY with Mara! We opted for the homeschooling sessions and the repetitive training really stuck. It’s not perfect but it’s 95% better than when we started and we will only continue the training!","rating":"FIVE","review_reply":"This feedback is much appreciated! I'm happy to have given Aspen and Juniper some new freedoms they can be trusted with.","reply_update_time":"2021-11-04T21:56:50.636Z"},{"create_time":"2021-10-26T14:10:57.246Z","update_time":"2021-10-26T14:10:57.246Z","review_id":"AbFvOqmoKZ3vyKmv3PaqjWezBihATJrgUWrmXT5ev60fsJnoO1JPgbN_DdInVqh4UFG06g7WzG9M","reviewer_display_name":"Chris Raulf","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Ggf8ajtTZ-0z3_yr_9RY5oDjLThMQQ3Yj7eFts6bw=s120-c-c0x00000000-cc-rp-mo-ba3-br100","is_anonymous":null,"comment":"Mara is an exceptional dog trainer. I was a bit skeptical when she told me that one session may do the trick. Our one-year old Maltipoo has been a challenge at work since he constantly barked at people waling past the windows. Mara's techniques are easy to understand, implement, and maintain. If you're looking for a dog trainer in Boulder (and area), I can highly recommend her!","rating":"FIVE","review_reply":"Thank you Chris! I enjoyed helping train your dog to stop barking and nipping! :-)","reply_update_time":"2021-11-02T23:33:15.924Z"},{"create_time":"2021-10-25T20:29:03.310Z","update_time":"2021-10-25T20:29:03.310Z","review_id":"AbFvOqkDGr7syJgW2zHl0a6UbMQROL4zHFxFcCUrAW8gzU6tvfibFbokUx-RIbMrK04cih6j_4TYhA","reviewer_display_name":"Betsy Batts","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gj1tlvzrOCHN4OPN8idopOmnlec1ezyyF6UiTYq=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Mara is an incredible dog trainer and I would (and have!) recommend her to anyone looking for some extra help training their pup! She is so patient, kind, fun, and explains things in a way that makes it easy to apply to all aspects of your dog’s training. We were just hoping to work on consistent recall, but now we have a pup who can off-leash heel, doesn’t bark or beg, and always comes when called. We couldn’t have done it without Mara’s help!!","rating":"FIVE","review_reply":"You are always a treat to work with, Betsy!! Theo is a brilliant dog, and you and Mike are brilliant dog parents!","reply_update_time":"2021-11-02T23:34:57.599Z"},{"create_time":"2021-10-11T00:13:14.620Z","update_time":"2021-10-11T00:13:14.620Z","review_id":"AbFvOqmCVOBNwYvkchGmzddPwP7Kzv8AWNxRwHynBbMVknF4HfI_AM4uOCR_y5_bHEdmRSSSMOufyw","reviewer_display_name":"PJ Blair","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJxTdhQrH5Wh7HZAhVbqZbxde0_GN8NnOB1zdsBp=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Mara did a wonderful job in getting my little girls shaped up.  I was astonished with how fast she trained them.  Mara is punctual, soft spoken, patient and persistent!  Thanks again Mara!😊","rating":"FIVE","review_reply":"Thank you very much! Lexi and Luci were wonderful dogs to train.","reply_update_time":"2021-10-19T04:04:46.640Z"},{"create_time":"2021-09-22T01:03:48.106Z","update_time":"2021-09-22T01:03:48.106Z","review_id":"AbFvOqkKR4lNguEKTn8qOEngikOW63HpaStM3AcQ8FwiVgjiHFLC0MaheVzqJX_GEBObKQmtNXpB","reviewer_display_name":"Joshua Peter","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a\/AATXAJyKaRqqBp5QnXylS0oA0t79Nnrt-DxpVmwOWBY=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Mara has been a great trainer. She guided us through what to expect as new puppy owners and we are very pleased with her work.","rating":"FIVE","review_reply":"Thank you Josh, keep up the great work with Oreo!","reply_update_time":"2021-09-28T03:42:48.376Z"},{"create_time":"2021-09-11T02:39:47.075Z","update_time":"2021-09-11T02:39:47.075Z","review_id":"AbFvOqkfzqj_a3qJaWtsdkR1iiiv1_V2AgZXOkrBRQrg9kp6smR9SwkdsQCkfmt_w4xXeANckIGq","reviewer_display_name":"Randy Jensen","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GjzrOiL59zKGc26TFohTny7mUxKnXP30bYHoivs=s120-c-c0x00000000-cc-rp-mo-ba2-br100","is_anonymous":null,"comment":"My fur baby Parker was having some behavioral issues...leash resistance, once nipped me a bit..and so I sought out some dog trainers to make things better. I found Mara with Aerovonz Training Club and she's literally the Mary Poppins of dog training. Parker loves her and now he's a perfect gentleman. I would recommend Mara for anyone who would like a caring and talented dog trainer.","rating":"FIVE","review_reply":"Thanks Randy - you and Parker have done so much to spread the word about Aerovonz!","reply_update_time":"2021-09-13T02:55:48.029Z"},{"create_time":"2021-09-09T17:24:29.486Z","update_time":"2021-09-09T17:24:29.486Z","review_id":"AbFvOqkIdXxxzP3b5PW8-AsjLcGVJCv9vh5CJJeoD-AHCeLdgLvKi8L4GIUj5NqLBJElkKZGmGyCUg","reviewer_display_name":"Evelyn Hargett","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GiUUbMWD9lRU6TshtF5bEFExvZ5Pk0SZGGH_flhWA=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":null,"rating":"FIVE","review_reply":"Many thanks, Evie!","reply_update_time":"2021-11-04T21:57:08.276Z"},{"create_time":"2021-09-09T01:37:13.894Z","update_time":"2021-09-09T01:37:13.894Z","review_id":"AbFvOqkNZO1YFN1Kj1p6WRJU2U5ngqu2KTxdB3hTQKGMX-2spMk-FCBWh7p59FBb2TmOgT1nend2NQ","reviewer_display_name":"Ethan Flynn","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gh8V-bR_HduuKCH1Wh_zkFWWoOhbXbR6VCJo247=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"I didn’t think I could keep my dog off leash before, but working with Mara made a huge difference! If you struggle with leash training your dog or obedience off leash I suggest letting her help! She did a great job of explaining to me how to keep up the progress in the future as well.","rating":"FIVE","review_reply":"Thank you Ethan and Keeva!","reply_update_time":"2021-09-13T02:57:48.863Z"},{"create_time":"2021-09-09T01:01:22.463Z","update_time":"2021-09-09T01:01:22.463Z","review_id":"AbFvOqnT141KGAJIsc7ir4AfoXuw0ZLzcBWs5nw3hGM_Q226-GnOgAaxhJI5sR7-8RAP8TXg56Zbdg","reviewer_display_name":"Rebekkah C","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14Gifu8TEdiI5re-_WpB9ijECmRLQKYqh6i_X_zJr=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"The most incredible trainer I would recommend her to everyone who has a dog, The homeschool program Absolutely changed my life!!!","rating":"FIVE","review_reply":"I'm glad Luke has benefitted from the homeschool program! Let me know if the training works for the horses! ;)","reply_update_time":"2021-09-13T02:58:49.590Z"},{"create_time":"2021-09-08T21:02:42.587Z","update_time":"2021-09-08T21:02:42.587Z","review_id":"AbFvOql3IpLE9NnSNgLbDO-gaE9LxWhVjiu0MYUkrZQjAXnVU6TQsqMc_A6loN-I83yv7yfzKWArXg","reviewer_display_name":"Christopher Gould","reviewer_profile_photo":"https:\/\/lh3.googleusercontent.com\/a-\/AOh14GhF9Fuetb4HfMAIUPW-fa-63Qb0LiTqGsXACWHZDQ=s120-c-c0x00000000-cc-rp-mo-br100","is_anonymous":null,"comment":"Undoubtedly the best dog trainer I’ve ever worked with. While my friends’ dogs are still jumping on strangers and barking incessantly, my pup is well behaved and learning more all the time. Mara is a wonderful trainer and I wouldn’t be surprised if we see her on TV in the future teaching a wider audience how to have a better relationship with their dog 🐶","rating":"FIVE","review_reply":"Thank you so much Chris! Kacey is a gem.  I'm glad I've gotten to be a part of her life for so long.  You two will always be an amazing team!","reply_update_time":"2021-09-13T02:59:26.762Z"}]}